TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:28 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v7.4.2 *
       3                    ;* Date/Time created: Sat Sep 26 11:12:27 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --c64p_l1d_workaround=off --endian=little --hll_source=on --long_pre
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C66xx                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *

    2703                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x03)
    2704                    
    2705                    $C$DW$T$78      .dwtag  DW_TAG_enumeration_type
    2706                            .dwattr $C$DW$T$78, DW_AT_byte_size(0x04)
    2707                    $C$DW$228       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_OPT"), DW_AT_const_value(0x00)
    2708                            .dwattr $C$DW$228, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\../c
    2709                            .dwattr $C$DW$228, DW_AT_decl_line(0x6a)
    2710                            .dwattr $C$DW$228, DW_AT_decl_column(0x05)
    2711                    $C$DW$229       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_CN"), DW_AT_const_value(0x01)
    2712                            .dwattr $C$DW$229, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\../c
    2713                            .dwattr $C$DW$229, DW_AT_decl_line(0x6b)
    2714                            .dwattr $C$DW$229, DW_AT_decl_column(0x05)
    2715                    $C$DW$230       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_CNT"), DW_AT_const_value(0x02)
    2716                            .dwattr $C$DW$230, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\../c
    2717                            .dwattr $C$DW$230, DW_AT_decl_line(0x6c)
    2718                            .dwattr $C$DW$230, DW_AT_decl_column(0x05)
    2719                            .dwendtag $C$DW$T$78
    2720                    
    2721                            .dwattr $C$DW$T$78, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\../
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:28 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   56

    2722                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x69)
    2723                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x06)
    2724                    
    2725                    $C$DW$T$79      .dwtag  DW_TAG_enumeration_type
    2726                            .dwattr $C$DW$T$79, DW_AT_byte_size(0x04)
    2727                    $C$DW$231       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_FAIL"), DW_AT_const_value(0x00)
    2728                            .dwattr $C$DW$231, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\../c
    2729                            .dwattr $C$DW$231, DW_AT_decl_line(0x72)
    2730                            .dwattr $C$DW$231, DW_AT_decl_column(0x05)
    2731                    $C$DW$232       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_PASS"), DW_AT_const_value(0x01)
    2732                            .dwattr $C$DW$232, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\../c
    2733                            .dwattr $C$DW$232, DW_AT_decl_line(0x73)
    2734                            .dwattr $C$DW$232, DW_AT_decl_column(0x05)
    2735                            .dwendtag $C$DW$T$79
    2736                    
    2737                            .dwattr $C$DW$T$79, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\../
    2738                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x71)
    2739                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x06)
    2740                    
    2741                    $C$DW$T$80      .dwtag  DW_TAG_enumeration_type
    2742                            .dwattr $C$DW$T$80, DW_AT_byte_size(0x04)
    2743                    $C$DW$233       .dwtag  DW_TAG_enumerator, DW_AT_name("BOOL_FALSE"), DW_AT_const_value(0x00)
    2744                            .dwattr $C$DW$233, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    2745                            .dwattr $C$DW$233, DW_AT_decl_line(0x8f)
    2746                            .dwattr $C$DW$233, DW_AT_decl_column(0x05)
    2747                    $C$DW$234       .dwtag  DW_TAG_enumerator, DW_AT_name("BOOL_TRUE"), DW_AT_const_value(0x01)
    2748                            .dwattr $C$DW$234, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    2749                            .dwattr $C$DW$234, DW_AT_decl_line(0x90)
    2750                            .dwattr $C$DW$234, DW_AT_decl_column(0x05)
    2751                            .dwendtag $C$DW$T$80
    2752                    
    2753                            .dwattr $C$DW$T$80, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    2754                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x8e)
    2755                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x0e)
    2756                    $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("CORB_Bool")
    2757                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    2758                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    2759                            .dwattr $C$DW$T$81, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    2760                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x91)
    2761                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x02)
    2762                    
    2763                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2764                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x20)
    2765                    $C$DW$235       .dwtag  DW_TAG_member
    2766                            .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    2767                            .dwattr $C$DW$235, DW_AT_name("testPattern")
    2768                            .dwattr $C$DW$235, DW_AT_TI_symbol_name("testPattern")
    2769                            .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2770                            .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2771                            .dwattr $C$DW$235, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\VLIB
    2772                            .dwattr $C$DW$235, DW_AT_decl_line(0x24)
    2773                            .dwattr $C$DW$235, DW_AT_decl_column(0x0f)
    2774                    $C$DW$236       .dwtag  DW_TAG_member
    2775                            .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$21)
    2776                            .dwattr $C$DW$236, DW_AT_name("staticInFeatures")
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:28 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   57

    2777                            .dwattr $C$DW$236, DW_AT_TI_symbol_name("staticInFeatures")
    2778                            .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2779                            .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2780                            .dwattr $C$DW$236, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\VLIB
    2781                            .dwattr $C$DW$236, DW_AT_decl_line(0x25)
    2782                            .dwattr $C$DW$236, DW_AT_decl_column(0x0f)
    2783                    $C$DW$237       .dwtag  DW_TAG_member
    2784                            .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$22)
    2785                            .dwattr $C$DW$237, DW_AT_name("staticInImage")
    2786                            .dwattr $C$DW$237, DW_AT_TI_symbol_name("staticInImage")
    2787                            .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2788                            .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2789                            .dwattr $C$DW$237, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\VLIB
    2790                            .dwattr $C$DW$237, DW_AT_decl_line(0x26)
    2791                            .dwattr $C$DW$237, DW_AT_decl_column(0x0f)
    2792                    $C$DW$238       .dwtag  DW_TAG_member
    2793                            .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$24)
    2794                            .dwattr $C$DW$238, DW_AT_name("staticOut1")
    2795                            .dwattr $C$DW$238, DW_AT_TI_symbol_name("staticOut1")
    2796                            .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2797                            .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2798                            .dwattr $C$DW$238, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\VLIB
    2799                            .dwattr $C$DW$238, DW_AT_decl_line(0x27)
    2800                            .dwattr $C$DW$238, DW_AT_decl_column(0x0f)
    2801                    $C$DW$239       .dwtag  DW_TAG_member
    2802                            .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$22)
    2803                            .dwattr $C$DW$239, DW_AT_name("momentPattern")
    2804                            .dwattr $C$DW$239, DW_AT_TI_symbol_name("momentPattern")
    2805                            .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2806                            .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2807                            .dwattr $C$DW$239, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\VLIB
    2808                            .dwattr $C$DW$239, DW_AT_decl_line(0x28)
    2809                            .dwattr $C$DW$239, DW_AT_decl_column(0x0f)
    2810                    $C$DW$240       .dwtag  DW_TAG_member
    2811                            .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$20)
    2812                            .dwattr $C$DW$240, DW_AT_name("imageWidth")
    2813                            .dwattr $C$DW$240, DW_AT_TI_symbol_name("imageWidth")
    2814                            .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2815                            .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2816                            .dwattr $C$DW$240, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\VLIB
    2817                            .dwattr $C$DW$240, DW_AT_decl_line(0x29)
    2818                            .dwattr $C$DW$240, DW_AT_decl_column(0x0f)
    2819                    $C$DW$241       .dwtag  DW_TAG_member
    2820                            .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$20)
    2821                            .dwattr $C$DW$241, DW_AT_name("imageHeight")
    2822                            .dwattr $C$DW$241, DW_AT_TI_symbol_name("imageHeight")
    2823                            .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2824                            .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2825                            .dwattr $C$DW$241, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\VLIB
    2826                            .dwattr $C$DW$241, DW_AT_decl_line(0x2a)
    2827                            .dwattr $C$DW$241, DW_AT_decl_column(0x0f)
    2828                    $C$DW$242       .dwtag  DW_TAG_member
    2829                            .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$25)
    2830                            .dwattr $C$DW$242, DW_AT_name("true_num_features")
    2831                            .dwattr $C$DW$242, DW_AT_TI_symbol_name("true_num_features")
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:28 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   58

    2832                            .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2833                            .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2834                            .dwattr $C$DW$242, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\VLIB
    2835                            .dwattr $C$DW$242, DW_AT_decl_line(0x2b)
    2836                            .dwattr $C$DW$242, DW_AT_decl_column(0x0f)
    2837                    $C$DW$243       .dwtag  DW_TAG_member
    2838                            .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$27)
    2839                            .dwattr $C$DW$243, DW_AT_name("desc")
    2840                            .dwattr $C$DW$243, DW_AT_TI_symbol_name("desc")
    2841                            .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2842                            .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2843                            .dwattr $C$DW$243, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\VLIB
    2844                            .dwattr $C$DW$243, DW_AT_decl_line(0x2c)
    2845                            .dwattr $C$DW$243, DW_AT_decl_column(0x0f)
    2846                            .dwendtag $C$DW$T$28
    2847                    
    2848                            .dwattr $C$DW$T$28, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\VLI
    2849                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x23)
    2850                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    2851                    $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    2852                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$28)
    2853                            .dwattr $C$DW$T$82, DW_AT_address_class(0x20)
    2854                    $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("orb_computeOrientation_testParams_t")
    2855                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$28)
    2856                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    2857                            .dwattr $C$DW$T$84, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\VLI
    2858                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x2d)
    2859                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x03)
    2860                    $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    2861                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    2862                            .dwattr $C$DW$T$85, DW_AT_address_class(0x20)
    2863                    $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    2864                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    2865                            .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    2866                    
    2867                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2868                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x18)
    2869                    $C$DW$244       .dwtag  DW_TAG_member
    2870                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$10)
    2871                            .dwattr $C$DW$244, DW_AT_name("fd")
    2872                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("fd")
    2873                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2874                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2875                            .dwattr $C$DW$244, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2876                            .dwattr $C$DW$244, DW_AT_decl_line(0x49)
    2877                            .dwattr $C$DW$244, DW_AT_decl_column(0x0b)
    2878                    $C$DW$245       .dwtag  DW_TAG_member
    2879                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$29)
    2880                            .dwattr $C$DW$245, DW_AT_name("buf")
    2881                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("buf")
    2882                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2883                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2884                            .dwattr $C$DW$245, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2885                            .dwattr $C$DW$245, DW_AT_decl_line(0x4a)
    2886                            .dwattr $C$DW$245, DW_AT_decl_column(0x16)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:28 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   59

    2887                    $C$DW$246       .dwtag  DW_TAG_member
    2888                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$29)
    2889                            .dwattr $C$DW$246, DW_AT_name("pos")
    2890                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("pos")
    2891                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2892                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2893                            .dwattr $C$DW$246, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2894                            .dwattr $C$DW$246, DW_AT_decl_line(0x4b)
    2895                            .dwattr $C$DW$246, DW_AT_decl_column(0x16)
    2896                    $C$DW$247       .dwtag  DW_TAG_member
    2897                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$29)
    2898                            .dwattr $C$DW$247, DW_AT_name("bufend")
    2899                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("bufend")
    2900                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2901                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2902                            .dwattr $C$DW$247, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2903                            .dwattr $C$DW$247, DW_AT_decl_line(0x4c)
    2904                            .dwattr $C$DW$247, DW_AT_decl_column(0x16)
    2905                    $C$DW$248       .dwtag  DW_TAG_member
    2906                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$29)
    2907                            .dwattr $C$DW$248, DW_AT_name("buff_stop")
    2908                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("buff_stop")
    2909                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2910                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2911                            .dwattr $C$DW$248, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2912                            .dwattr $C$DW$248, DW_AT_decl_line(0x4d)
    2913                            .dwattr $C$DW$248, DW_AT_decl_column(0x16)
    2914                    $C$DW$249       .dwtag  DW_TAG_member
    2915                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$11)
    2916                            .dwattr $C$DW$249, DW_AT_name("flags")
    2917                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("flags")
    2918                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2919                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2920                            .dwattr $C$DW$249, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2921                            .dwattr $C$DW$249, DW_AT_decl_line(0x4e)
    2922                            .dwattr $C$DW$249, DW_AT_decl_column(0x16)
    2923                            .dwendtag $C$DW$T$30
    2924                    
    2925                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2926                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x48)
    2927                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    2928                    $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    2929                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$30)
    2930                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    2931                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2932                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x4f)
    2933                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x03)
    2934                    
    2935                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2936                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x08)
    2937                    $C$DW$250       .dwtag  DW_TAG_member
    2938                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$10)
    2939                            .dwattr $C$DW$250, DW_AT_name("quot")
    2940                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("quot")
    2941                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:28 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   60

    2942                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2943                            .dwattr $C$DW$250, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2944                            .dwattr $C$DW$250, DW_AT_decl_line(0x3e)
    2945                            .dwattr $C$DW$250, DW_AT_decl_column(0x16)
    2946                    $C$DW$251       .dwtag  DW_TAG_member
    2947                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$10)
    2948                            .dwattr $C$DW$251, DW_AT_name("rem")
    2949                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("rem")
    2950                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2951                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2952                            .dwattr $C$DW$251, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2953                            .dwattr $C$DW$251, DW_AT_decl_line(0x3e)
    2954                            .dwattr $C$DW$251, DW_AT_decl_column(0x1c)
    2955                            .dwendtag $C$DW$T$31
    2956                    
    2957                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2958                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x3e)
    2959                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    2960                    $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    2961                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$31)
    2962                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    2963                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2964                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x3e)
    2965                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x23)
    2966                    
    2967                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2968                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x08)
    2969                    $C$DW$252       .dwtag  DW_TAG_member
    2970                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$10)
    2971                            .dwattr $C$DW$252, DW_AT_name("quot")
    2972                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("quot")
    2973                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2974                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2975                            .dwattr $C$DW$252, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2976                            .dwattr $C$DW$252, DW_AT_decl_line(0x40)
    2977                            .dwattr $C$DW$252, DW_AT_decl_column(0x17)
    2978                    $C$DW$253       .dwtag  DW_TAG_member
    2979                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$10)
    2980                            .dwattr $C$DW$253, DW_AT_name("rem")
    2981                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("rem")
    2982                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2983                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2984                            .dwattr $C$DW$253, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2985                            .dwattr $C$DW$253, DW_AT_decl_line(0x40)
    2986                            .dwattr $C$DW$253, DW_AT_decl_column(0x1d)
    2987                            .dwendtag $C$DW$T$32
    2988                    
    2989                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2990                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x40)
    2991                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    2992                    $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    2993                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$32)
    2994                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    2995                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2996                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x40)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:28 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   61

    2997                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x24)
    2998                    
    2999                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3000                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x10)
    3001                    $C$DW$254       .dwtag  DW_TAG_member
    3002                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$14)
    3003                            .dwattr $C$DW$254, DW_AT_name("quot")
    3004                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("quot")
    3005                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3006                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3007                            .dwattr $C$DW$254, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3008                            .dwattr $C$DW$254, DW_AT_decl_line(0x43)
    3009                            .dwattr $C$DW$254, DW_AT_decl_column(0x1c)
    3010                    $C$DW$255       .dwtag  DW_TAG_member
    3011                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$14)
    3012                            .dwattr $C$DW$255, DW_AT_name("rem")
    3013                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("rem")
    3014                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3015                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3016                            .dwattr $C$DW$255, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3017                            .dwattr $C$DW$255, DW_AT_decl_line(0x43)
    3018                            .dwattr $C$DW$255, DW_AT_decl_column(0x22)
    3019                            .dwendtag $C$DW$T$33
    3020                    
    3021                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3022                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x43)
    3023                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    3024                    $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    3025                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$33)
    3026                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    3027                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3028                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x43)
    3029                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x29)
    3030                    
    3031                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3032                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x24)
    3033                    $C$DW$256       .dwtag  DW_TAG_member
    3034                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$34)
    3035                            .dwattr $C$DW$256, DW_AT_name("area")
    3036                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("area")
    3037                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3038                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3039                            .dwattr $C$DW$256, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3040                            .dwattr $C$DW$256, DW_AT_decl_line(0x69)
    3041                            .dwattr $C$DW$256, DW_AT_decl_column(0x0d)
    3042                    $C$DW$257       .dwtag  DW_TAG_member
    3043                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$34)
    3044                            .dwattr $C$DW$257, DW_AT_name("xsum")
    3045                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("xsum")
    3046                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3047                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3048                            .dwattr $C$DW$257, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3049                            .dwattr $C$DW$257, DW_AT_decl_line(0x6a)
    3050                            .dwattr $C$DW$257, DW_AT_decl_column(0x0d)
    3051                    $C$DW$258       .dwtag  DW_TAG_member
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:28 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   62

    3052                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$34)
    3053                            .dwattr $C$DW$258, DW_AT_name("ysum")
    3054                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("ysum")
    3055                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3056                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3057                            .dwattr $C$DW$258, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3058                            .dwattr $C$DW$258, DW_AT_decl_line(0x6b)
    3059                            .dwattr $C$DW$258, DW_AT_decl_column(0x0d)
    3060                    $C$DW$259       .dwtag  DW_TAG_member
    3061                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$34)
    3062                            .dwattr $C$DW$259, DW_AT_name("xmin")
    3063                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("xmin")
    3064                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3065                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3066                            .dwattr $C$DW$259, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3067                            .dwattr $C$DW$259, DW_AT_decl_line(0x6d)
    3068                            .dwattr $C$DW$259, DW_AT_decl_column(0x0d)
    3069                    $C$DW$260       .dwtag  DW_TAG_member
    3070                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$34)
    3071                            .dwattr $C$DW$260, DW_AT_name("ymin")
    3072                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("ymin")
    3073                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3074                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3075                            .dwattr $C$DW$260, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3076                            .dwattr $C$DW$260, DW_AT_decl_line(0x6e)
    3077                            .dwattr $C$DW$260, DW_AT_decl_column(0x0d)
    3078                    $C$DW$261       .dwtag  DW_TAG_member
    3079                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$34)
    3080                            .dwattr $C$DW$261, DW_AT_name("xmax")
    3081                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("xmax")
    3082                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3083                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3084                            .dwattr $C$DW$261, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3085                            .dwattr $C$DW$261, DW_AT_decl_line(0x6f)
    3086                            .dwattr $C$DW$261, DW_AT_decl_column(0x0d)
    3087                    $C$DW$262       .dwtag  DW_TAG_member
    3088                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$34)
    3089                            .dwattr $C$DW$262, DW_AT_name("ymax")
    3090                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("ymax")
    3091                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3092                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3093                            .dwattr $C$DW$262, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3094                            .dwattr $C$DW$262, DW_AT_decl_line(0x70)
    3095                            .dwattr $C$DW$262, DW_AT_decl_column(0x0d)
    3096                    $C$DW$263       .dwtag  DW_TAG_member
    3097                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$34)
    3098                            .dwattr $C$DW$263, DW_AT_name("seedx")
    3099                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("seedx")
    3100                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3101                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3102                            .dwattr $C$DW$263, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3103                            .dwattr $C$DW$263, DW_AT_decl_line(0x72)
    3104                            .dwattr $C$DW$263, DW_AT_decl_column(0x0d)
    3105                    $C$DW$264       .dwtag  DW_TAG_member
    3106                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$34)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:28 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   63

    3107                            .dwattr $C$DW$264, DW_AT_name("seedy")
    3108                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("seedy")
    3109                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3110                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3111                            .dwattr $C$DW$264, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3112                            .dwattr $C$DW$264, DW_AT_decl_line(0x73)
    3113                            .dwattr $C$DW$264, DW_AT_decl_column(0x0d)
    3114                            .dwendtag $C$DW$T$35
    3115                    
    3116                            .dwattr $C$DW$T$35, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3117                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x68)
    3118                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    3119                    $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CC")
    3120                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$35)
    3121                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    3122                            .dwattr $C$DW$T$91, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3123                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x75)
    3124                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x03)
    3125                    
    3126                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3127                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x10)
    3128                    $C$DW$265       .dwtag  DW_TAG_member
    3129                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$8)
    3130                            .dwattr $C$DW$265, DW_AT_name("daylight")
    3131                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("daylight")
    3132                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3133                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3134                            .dwattr $C$DW$265, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3135                            .dwattr $C$DW$265, DW_AT_decl_line(0x52)
    3136                            .dwattr $C$DW$265, DW_AT_decl_column(0x0b)
    3137                    $C$DW$266       .dwtag  DW_TAG_member
    3138                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$10)
    3139                            .dwattr $C$DW$266, DW_AT_name("timezone")
    3140                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("timezone")
    3141                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3142                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3143                            .dwattr $C$DW$266, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3144                            .dwattr $C$DW$266, DW_AT_decl_line(0x53)
    3145                            .dwattr $C$DW$266, DW_AT_decl_column(0x0b)
    3146                    $C$DW$267       .dwtag  DW_TAG_member
    3147                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$36)
    3148                            .dwattr $C$DW$267, DW_AT_name("tzname")
    3149                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("tzname")
    3150                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3151                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3152                            .dwattr $C$DW$267, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3153                            .dwattr $C$DW$267, DW_AT_decl_line(0x54)
    3154                            .dwattr $C$DW$267, DW_AT_decl_column(0x0b)
    3155                    $C$DW$268       .dwtag  DW_TAG_member
    3156                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$36)
    3157                            .dwattr $C$DW$268, DW_AT_name("dstname")
    3158                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("dstname")
    3159                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3160                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3161                            .dwattr $C$DW$268, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:28 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   64

    3162                            .dwattr $C$DW$268, DW_AT_decl_line(0x55)
    3163                            .dwattr $C$DW$268, DW_AT_decl_column(0x0b)
    3164                            .dwendtag $C$DW$T$37
    3165                    
    3166                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3167                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x51)
    3168                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    3169                    $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("TZ")
    3170                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$37)
    3171                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    3172                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3173                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x56)
    3174                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x03)
    3175                    
    3176                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3177                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x14)
    3178                    $C$DW$269       .dwtag  DW_TAG_member
    3179                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$34)
    3180                            .dwattr $C$DW$269, DW_AT_name("width")
    3181                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("width")
    3182                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3183                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3184                            .dwattr $C$DW$269, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3185                            .dwattr $C$DW$269, DW_AT_decl_line(0xaa)
    3186                            .dwattr $C$DW$269, DW_AT_decl_column(0x0d)
    3187                    $C$DW$270       .dwtag  DW_TAG_member
    3188                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$34)
    3189                            .dwattr $C$DW$270, DW_AT_name("height")
    3190                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("height")
    3191                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3192                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3193                            .dwattr $C$DW$270, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3194                            .dwattr $C$DW$270, DW_AT_decl_line(0xab)
    3195                            .dwattr $C$DW$270, DW_AT_decl_column(0x0d)
    3196                    $C$DW$271       .dwtag  DW_TAG_member
    3197                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$34)
    3198                            .dwattr $C$DW$271, DW_AT_name("marginPixels")
    3199                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("marginPixels")
    3200                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3201                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3202                            .dwattr $C$DW$271, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3203                            .dwattr $C$DW$271, DW_AT_decl_line(0xac)
    3204                            .dwattr $C$DW$271, DW_AT_decl_column(0x0d)
    3205                    $C$DW$272       .dwtag  DW_TAG_member
    3206                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$19)
    3207                            .dwattr $C$DW$272, DW_AT_name("fastDifferenceThreshold")
    3208                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("fastDifferenceThreshold")
    3209                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3210                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3211                            .dwattr $C$DW$272, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3212                            .dwattr $C$DW$272, DW_AT_decl_line(0xae)
    3213                            .dwattr $C$DW$272, DW_AT_decl_column(0x0d)
    3214                    $C$DW$273       .dwtag  DW_TAG_member
    3215                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$34)
    3216                            .dwattr $C$DW$273, DW_AT_name("n_features_desired")
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:28 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   65

    3217                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("n_features_desired")
    3218                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3219                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3220                            .dwattr $C$DW$273, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3221                            .dwattr $C$DW$273, DW_AT_decl_line(0xb2)
    3222                            .dwattr $C$DW$273, DW_AT_decl_column(0x0d)
    3223                            .dwendtag $C$DW$T$38
    3224                    
    3225                            .dwattr $C$DW$T$38, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3226                            .dwattr $C$DW$T$38, DW_AT_decl_line(0xa9)
    3227                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    3228                    $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("CORBParameters")
    3229                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$38)
    3230                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    3231                            .dwattr $C$DW$T$93, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3232                            .dwattr $C$DW$T$93, DW_AT_decl_line(0xb3)
    3233                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x02)
    3234                    
    3235                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    3236                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x5a008)
    3237                    $C$DW$274       .dwtag  DW_TAG_member
    3238                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$34)
    3239                            .dwattr $C$DW$274, DW_AT_name("octave")
    3240                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("octave")
    3241                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3242                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3243                            .dwattr $C$DW$274, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3244                            .dwattr $C$DW$274, DW_AT_decl_line(0xb9)
    3245                            .dwattr $C$DW$274, DW_AT_decl_column(0x0d)
    3246                    $C$DW$275       .dwtag  DW_TAG_member
    3247                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$40)
    3248                            .dwattr $C$DW$275, DW_AT_name("relative_patterns")
    3249                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("relative_patterns")
    3250                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3251                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3252                            .dwattr $C$DW$275, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3253                            .dwattr $C$DW$275, DW_AT_decl_line(0xbb)
    3254                            .dwattr $C$DW$275, DW_AT_decl_column(0x0d)
    3255                    $C$DW$276       .dwtag  DW_TAG_member
    3256                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$42)
    3257                            .dwattr $C$DW$276, DW_AT_name("rotated_patterns")
    3258                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("rotated_patterns")
    3259                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c004]
    3260                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3261                            .dwattr $C$DW$276, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3262                            .dwattr $C$DW$276, DW_AT_decl_line(0xbc)
    3263                            .dwattr $C$DW$276, DW_AT_decl_column(0x0d)
    3264                    $C$DW$277       .dwtag  DW_TAG_member
    3265                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$34)
    3266                            .dwattr $C$DW$277, DW_AT_name("integralImageWidth")
    3267                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("integralImageWidth")
    3268                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a004]
    3269                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3270                            .dwattr $C$DW$277, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3271                            .dwattr $C$DW$277, DW_AT_decl_line(0xbd)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:28 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   66

    3272                            .dwattr $C$DW$277, DW_AT_decl_column(0x0d)
    3273                            .dwendtag $C$DW$T$43
    3274                    
    3275                            .dwattr $C$DW$T$43, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3276                            .dwattr $C$DW$T$43, DW_AT_decl_line(0xb8)
    3277                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x10)
    3278                    $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CORBPatterns")
    3279                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$43)
    3280                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3281                            .dwattr $C$DW$T$47, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3282                            .dwattr $C$DW$T$47, DW_AT_decl_line(0xbe)
    3283                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x02)
    3284                    
    3285                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    3286                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x400)
    3287                    $C$DW$278       .dwtag  DW_TAG_member
    3288                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$44)
    3289                            .dwattr $C$DW$278, DW_AT_name("orientation_horizontal_offsets")
    3290                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("orientation_horizontal_offsets")
    3291                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3292                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3293                            .dwattr $C$DW$278, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3294                            .dwattr $C$DW$278, DW_AT_decl_line(0xc4)
    3295                            .dwattr $C$DW$278, DW_AT_decl_column(0x0d)
    3296                    $C$DW$279       .dwtag  DW_TAG_member
    3297                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$44)
    3298                            .dwattr $C$DW$279, DW_AT_name("orientation_vertical_offsets")
    3299                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("orientation_vertical_offsets")
    3300                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e0]
    3301                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3302                            .dwattr $C$DW$279, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3303                            .dwattr $C$DW$279, DW_AT_decl_line(0xc5)
    3304                            .dwattr $C$DW$279, DW_AT_decl_column(0x0d)
    3305                    $C$DW$280       .dwtag  DW_TAG_member
    3306                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$45)
    3307                            .dwattr $C$DW$280, DW_AT_name("u_max")
    3308                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("u_max")
    3309                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c0]
    3310                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3311                            .dwattr $C$DW$280, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3312                            .dwattr $C$DW$280, DW_AT_decl_line(0xc6)
    3313                            .dwattr $C$DW$280, DW_AT_decl_column(0x0d)
    3314                            .dwendtag $C$DW$T$46
    3315                    
    3316                            .dwattr $C$DW$T$46, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3317                            .dwattr $C$DW$T$46, DW_AT_decl_line(0xc3)
    3318                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x10)
    3319                    $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOrientationOffsets")
    3320                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$46)
    3321                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3322                            .dwattr $C$DW$T$48, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3323                            .dwattr $C$DW$T$48, DW_AT_decl_line(0xc7)
    3324                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x02)
    3325                    
    3326                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:28 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   67

    3327                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x5a420)
    3328                    $C$DW$281       .dwtag  DW_TAG_member
    3329                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$47)
    3330                            .dwattr $C$DW$281, DW_AT_name("patterns")
    3331                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("patterns")
    3332                            .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3333                            .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3334                            .dwattr $C$DW$281, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3335                            .dwattr $C$DW$281, DW_AT_decl_line(0xcd)
    3336                            .dwattr $C$DW$281, DW_AT_decl_column(0x1c)
    3337                    $C$DW$282       .dwtag  DW_TAG_member
    3338                            .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$48)
    3339                            .dwattr $C$DW$282, DW_AT_name("offsets")
    3340                            .dwattr $C$DW$282, DW_AT_TI_symbol_name("offsets")
    3341                            .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a008]
    3342                            .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3343                            .dwattr $C$DW$282, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3344                            .dwattr $C$DW$282, DW_AT_decl_line(0xce)
    3345                            .dwattr $C$DW$282, DW_AT_decl_column(0x1c)
    3346                    $C$DW$283       .dwtag  DW_TAG_member
    3347                            .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$22)
    3348                            .dwattr $C$DW$283, DW_AT_name("image")
    3349                            .dwattr $C$DW$283, DW_AT_TI_symbol_name("image")
    3350                            .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a408]
    3351                            .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3352                            .dwattr $C$DW$283, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3353                            .dwattr $C$DW$283, DW_AT_decl_line(0xcf)
    3354                            .dwattr $C$DW$283, DW_AT_decl_column(0x1c)
    3355                    $C$DW$284       .dwtag  DW_TAG_member
    3356                            .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$22)
    3357                            .dwattr $C$DW$284, DW_AT_name("prefimage")
    3358                            .dwattr $C$DW$284, DW_AT_TI_symbol_name("prefimage")
    3359                            .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a40c]
    3360                            .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3361                            .dwattr $C$DW$284, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3362                            .dwattr $C$DW$284, DW_AT_decl_line(0xd0)
    3363                            .dwattr $C$DW$284, DW_AT_decl_column(0x1c)
    3364                    $C$DW$285       .dwtag  DW_TAG_member
    3365                            .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$24)
    3366                            .dwattr $C$DW$285, DW_AT_name("harrisImage")
    3367                            .dwattr $C$DW$285, DW_AT_TI_symbol_name("harrisImage")
    3368                            .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a410]
    3369                            .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3370                            .dwattr $C$DW$285, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3371                            .dwattr $C$DW$285, DW_AT_decl_line(0xd1)
    3372                            .dwattr $C$DW$285, DW_AT_decl_column(0x1c)
    3373                    $C$DW$286       .dwtag  DW_TAG_member
    3374                            .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$49)
    3375                            .dwattr $C$DW$286, DW_AT_name("integralImage")
    3376                            .dwattr $C$DW$286, DW_AT_TI_symbol_name("integralImage")
    3377                            .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a414]
    3378                            .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3379                            .dwattr $C$DW$286, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3380                            .dwattr $C$DW$286, DW_AT_decl_line(0xd2)
    3381                            .dwattr $C$DW$286, DW_AT_decl_column(0x1c)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:28 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   68

    3382                    $C$DW$287       .dwtag  DW_TAG_member
    3383                            .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$27)
    3384                            .dwattr $C$DW$287, DW_AT_name("scratchBuffer")
    3385                            .dwattr $C$DW$287, DW_AT_TI_symbol_name("scratchBuffer")
    3386                            .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a418]
    3387                            .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3388                            .dwattr $C$DW$287, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3389                            .dwattr $C$DW$287, DW_AT_decl_line(0xd3)
    3390                            .dwattr $C$DW$287, DW_AT_decl_column(0x1c)
    3391                    $C$DW$288       .dwtag  DW_TAG_member
    3392                            .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$51)
    3393                            .dwattr $C$DW$288, DW_AT_name("orbPattern31")
    3394                            .dwattr $C$DW$288, DW_AT_TI_symbol_name("orbPattern31")
    3395                            .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a41c]
    3396                            .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3397                            .dwattr $C$DW$288, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3398                            .dwattr $C$DW$288, DW_AT_decl_line(0xd4)
    3399                            .dwattr $C$DW$288, DW_AT_decl_column(0x1c)
    3400                            .dwendtag $C$DW$T$52
    3401                    
    3402                            .dwattr $C$DW$T$52, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3403                            .dwattr $C$DW$T$52, DW_AT_decl_line(0xcc)
    3404                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x10)
    3405                    $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("CORBInput")
    3406                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$52)
    3407                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    3408                            .dwattr $C$DW$T$94, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3409                            .dwattr $C$DW$T$94, DW_AT_decl_line(0xd5)
    3410                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x02)
    3411                    
    3412                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    3413                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x38)
    3414                    $C$DW$289       .dwtag  DW_TAG_member
    3415                            .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$34)
    3416                            .dwattr $C$DW$289, DW_AT_name("x")
    3417                            .dwattr $C$DW$289, DW_AT_TI_symbol_name("x")
    3418                            .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3419                            .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3420                            .dwattr $C$DW$289, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3421                            .dwattr $C$DW$289, DW_AT_decl_line(0xdc)
    3422                            .dwattr $C$DW$289, DW_AT_decl_column(0x0d)
    3423                    $C$DW$290       .dwtag  DW_TAG_member
    3424                            .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$34)
    3425                            .dwattr $C$DW$290, DW_AT_name("y")
    3426                            .dwattr $C$DW$290, DW_AT_TI_symbol_name("y")
    3427                            .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3428                            .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3429                            .dwattr $C$DW$290, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3430                            .dwattr $C$DW$290, DW_AT_decl_line(0xde)
    3431                            .dwattr $C$DW$290, DW_AT_decl_column(0x0d)
    3432                    $C$DW$291       .dwtag  DW_TAG_member
    3433                            .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$34)
    3434                            .dwattr $C$DW$291, DW_AT_name("octave")
    3435                            .dwattr $C$DW$291, DW_AT_TI_symbol_name("octave")
    3436                            .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:28 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   69

    3437                            .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3438                            .dwattr $C$DW$291, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3439                            .dwattr $C$DW$291, DW_AT_decl_line(0xe0)
    3440                            .dwattr $C$DW$291, DW_AT_decl_column(0x0d)
    3441                    $C$DW$292       .dwtag  DW_TAG_member
    3442                            .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$53)
    3443                            .dwattr $C$DW$292, DW_AT_name("angle")
    3444                            .dwattr $C$DW$292, DW_AT_TI_symbol_name("angle")
    3445                            .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3446                            .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3447                            .dwattr $C$DW$292, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3448                            .dwattr $C$DW$292, DW_AT_decl_line(0xe3)
    3449                            .dwattr $C$DW$292, DW_AT_decl_column(0x0e)
    3450                    $C$DW$293       .dwtag  DW_TAG_member
    3451                            .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$34)
    3452                            .dwattr $C$DW$293, DW_AT_name("fastResponse")
    3453                            .dwattr $C$DW$293, DW_AT_TI_symbol_name("fastResponse")
    3454                            .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3455                            .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3456                            .dwattr $C$DW$293, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3457                            .dwattr $C$DW$293, DW_AT_decl_line(0xe4)
    3458                            .dwattr $C$DW$293, DW_AT_decl_column(0x0e)
    3459                    $C$DW$294       .dwtag  DW_TAG_member
    3460                            .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$23)
    3461                            .dwattr $C$DW$294, DW_AT_name("harrisResponse")
    3462                            .dwattr $C$DW$294, DW_AT_TI_symbol_name("harrisResponse")
    3463                            .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3464                            .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3465                            .dwattr $C$DW$294, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3466                            .dwattr $C$DW$294, DW_AT_decl_line(0xe5)
    3467                            .dwattr $C$DW$294, DW_AT_decl_column(0x0e)
    3468                    $C$DW$295       .dwtag  DW_TAG_member
    3469                            .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$54)
    3470                            .dwattr $C$DW$295, DW_AT_name("descriptor")
    3471                            .dwattr $C$DW$295, DW_AT_TI_symbol_name("descriptor")
    3472                            .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3473                            .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3474                            .dwattr $C$DW$295, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3475                            .dwattr $C$DW$295, DW_AT_decl_line(0xe6)
    3476                            .dwattr $C$DW$295, DW_AT_decl_column(0x0e)
    3477                            .dwendtag $C$DW$T$55
    3478                    
    3479                            .dwattr $C$DW$T$55, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3480                            .dwattr $C$DW$T$55, DW_AT_decl_line(0xdb)
    3481                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    3482                    $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CORBFeature")
    3483                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    3484                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    3485                            .dwattr $C$DW$T$56, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3486                            .dwattr $C$DW$T$56, DW_AT_decl_line(0xe7)
    3487                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x02)
    3488                    $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    3489                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    3490                            .dwattr $C$DW$T$57, DW_AT_address_class(0x20)
    3491                    
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:28 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   70

    3492                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    3493                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x08)
    3494                    $C$DW$296       .dwtag  DW_TAG_member
    3495                            .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$57)
    3496                            .dwattr $C$DW$296, DW_AT_name("features")
    3497                            .dwattr $C$DW$296, DW_AT_TI_symbol_name("features")
    3498                            .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3499                            .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3500                            .dwattr $C$DW$296, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3501                            .dwattr $C$DW$296, DW_AT_decl_line(0xed)
    3502                            .dwattr $C$DW$296, DW_AT_decl_column(0x12)
    3503                    $C$DW$297       .dwtag  DW_TAG_member
    3504                            .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$34)
    3505                            .dwattr $C$DW$297, DW_AT_name("n_features")
    3506                            .dwattr $C$DW$297, DW_AT_TI_symbol_name("n_features")
    3507                            .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3508                            .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3509                            .dwattr $C$DW$297, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3510                            .dwattr $C$DW$297, DW_AT_decl_line(0xee)
    3511                            .dwattr $C$DW$297, DW_AT_decl_column(0x12)
    3512                            .dwendtag $C$DW$T$58
    3513                    
    3514                            .dwattr $C$DW$T$58, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3515                            .dwattr $C$DW$T$58, DW_AT_decl_line(0xec)
    3516                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x10)
    3517                    $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOutput")
    3518                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$58)
    3519                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    3520                            .dwattr $C$DW$T$95, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3521                            .dwattr $C$DW$T$95, DW_AT_decl_line(0xef)
    3522                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x02)
    3523                    
    3524                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3525                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x20)
    3526                    $C$DW$298       .dwtag  DW_TAG_member
    3527                            .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$60)
    3528                            .dwattr $C$DW$298, DW_AT_name("val")
    3529                            .dwattr $C$DW$298, DW_AT_TI_symbol_name("val")
    3530                            .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3531                            .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3532                            .dwattr $C$DW$298, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\../c
    3533                            .dwattr $C$DW$298, DW_AT_decl_line(0x25)
    3534                            .dwattr $C$DW$298, DW_AT_decl_column(0x0c)
    3535                            .dwendtag $C$DW$T$61
    3536                    
    3537                            .dwattr $C$DW$T$61, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\../
    3538                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x24)
    3539                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x10)
    3540                    $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("RotationMatrix")
    3541                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$61)
    3542                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    3543                            .dwattr $C$DW$T$96, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\../
    3544                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x26)
    3545                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x02)
    3546                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:28 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   71

    3547                            .dwattr $C$DW$T$2, DW_AT_name("void")
    3548                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3549                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3550                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3551                    $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_PTR")
    3552                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$3)
    3553                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    3554                            .dwattr $C$DW$T$97, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3555                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x5c)
    3556                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x19)
    3557                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    3558                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3559                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    3560                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3561                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    3562                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3563                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3564                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3565                    $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    3566                            .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$5)
    3567                            .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
    3568                    $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    3569                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$5)
    3570                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    3571                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3572                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2a)
    3573                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x1d)
    3574                    $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    3575                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    3576                            .dwattr $C$DW$T$51, DW_AT_address_class(0x20)
    3577                    $C$DW$T$136     .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    3578                            .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$50)
    3579                            .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
    3580                            .dwattr $C$DW$T$136, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3581                            .dwattr $C$DW$T$136, DW_AT_decl_line(0x39)
    3582                            .dwattr $C$DW$T$136, DW_AT_decl_column(0x17)
    3583                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    3584                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3585                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3586                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3587                    $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    3588                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$6)
    3589                            .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    3590                    $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    3591                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
    3592                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    3593                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3594                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x2b)
    3595                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
    3596                    $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    3597                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$19)
    3598                            .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
    3599                    $C$DW$T$67      .dwtag  DW_TAG_restrict_type
    3600                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$22)
    3601                    
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:28 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   72

    3602                    $C$DW$T$54      .dwtag  DW_TAG_array_type
    3603                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$19)
    3604                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    3605                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x20)
    3606                    $C$DW$299       .dwtag  DW_TAG_subrange_type
    3607                            .dwattr $C$DW$299, DW_AT_upper_bound(0x1f)
    3608                            .dwendtag $C$DW$T$54
    3609                    
    3610                    $C$DW$T$138     .dwtag  DW_TAG_const_type
    3611                            .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$19)
    3612                    $C$DW$T$139     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    3613                            .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$19)
    3614                            .dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
    3615                            .dwattr $C$DW$T$139, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3616                            .dwattr $C$DW$T$139, DW_AT_decl_line(0x3a)
    3617                            .dwattr $C$DW$T$139, DW_AT_decl_column(0x16)
    3618                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    3619                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3620                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3621                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    3622                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    3623                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3624                            .dwattr $C$DW$T$8, DW_AT_name("short")
    3625                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    3626                    $C$DW$T$140     .dwtag  DW_TAG_pointer_type
    3627                            .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$8)
    3628                            .dwattr $C$DW$T$140, DW_AT_address_class(0x20)
    3629                    $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    3630                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$8)
    3631                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    3632                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3633                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x2c)
    3634                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x1d)
    3635                    $C$DW$T$24      .dwtag  DW_TAG_pointer_type
    3636                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    3637                            .dwattr $C$DW$T$24, DW_AT_address_class(0x20)
    3638                    $C$DW$T$69      .dwtag  DW_TAG_restrict_type
    3639                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$24)
    3640                    $C$DW$T$141     .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    3641                            .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$23)
    3642                            .dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
    3643                            .dwattr $C$DW$T$141, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3644                            .dwattr $C$DW$T$141, DW_AT_decl_line(0x3c)
    3645                            .dwattr $C$DW$T$141, DW_AT_decl_column(0x17)
    3646                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    3647                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3648                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3649                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    3650                    $C$DW$T$142     .dwtag  DW_TAG_pointer_type
    3651                            .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$9)
    3652                            .dwattr $C$DW$T$142, DW_AT_address_class(0x20)
    3653                    $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    3654                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    3655                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    3656                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:28 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   73

    3657                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x2d)
    3658                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x1c)
    3659                    $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    3660                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    3661                            .dwattr $C$DW$T$21, DW_AT_address_class(0x20)
    3662                    $C$DW$T$144     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    3663                            .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$20)
    3664                            .dwattr $C$DW$T$144, DW_AT_language(DW_LANG_C)
    3665                            .dwattr $C$DW$T$144, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3666                            .dwattr $C$DW$T$144, DW_AT_decl_line(0x3d)
    3667                            .dwattr $C$DW$T$144, DW_AT_decl_column(0x16)
    3668                    $C$DW$T$143     .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    3669                            .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$9)
    3670                            .dwattr $C$DW$T$143, DW_AT_language(DW_LANG_C)
    3671                            .dwattr $C$DW$T$143, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3672                            .dwattr $C$DW$T$143, DW_AT_decl_line(0x53)
    3673                            .dwattr $C$DW$T$143, DW_AT_decl_column(0x1a)
    3674                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    3675                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3676                            .dwattr $C$DW$T$10, DW_AT_name("int")
    3677                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    3678                    $C$DW$T$160     .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
    3679                            .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$10)
    3680                            .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
    3681                            .dwattr $C$DW$T$160, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3682                            .dwattr $C$DW$T$160, DW_AT_decl_line(0x53)
    3683                            .dwattr $C$DW$T$160, DW_AT_decl_column(0x0d)
    3684                    $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    3685                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$10)
    3686                            .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    3687                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3688                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x2e)
    3689                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x1d)
    3690                    $C$DW$T$154     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CCHandle")
    3691                            .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$34)
    3692                            .dwattr $C$DW$T$154, DW_AT_language(DW_LANG_C)
    3693                            .dwattr $C$DW$T$154, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..
    3694                            .dwattr $C$DW$T$154, DW_AT_decl_line(0x77)
    3695                            .dwattr $C$DW$T$154, DW_AT_decl_column(0x11)
    3696                    
    3697                    $C$DW$T$39      .dwtag  DW_TAG_array_type
    3698                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$34)
    3699                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3700                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x2000)
    3701                    $C$DW$300       .dwtag  DW_TAG_subrange_type
    3702                            .dwattr $C$DW$300, DW_AT_upper_bound(0x7ff)
    3703                            .dwendtag $C$DW$T$39
    3704                    
    3705                    
    3706                    $C$DW$T$40      .dwtag  DW_TAG_array_type
    3707                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$34)
    3708                            .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    3709                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x3c000)
    3710                    $C$DW$301       .dwtag  DW_TAG_subrange_type
    3711                            .dwattr $C$DW$301, DW_AT_upper_bound(0x1d)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:28 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   74

    3712                    $C$DW$302       .dwtag  DW_TAG_subrange_type
    3713                            .dwattr $C$DW$302, DW_AT_upper_bound(0x7ff)
    3714                            .dwendtag $C$DW$T$40
    3715                    
    3716                    
    3717                    $C$DW$T$41      .dwtag  DW_TAG_array_type
    3718                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$34)
    3719                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3720                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x1000)
    3721                    $C$DW$303       .dwtag  DW_TAG_subrange_type
    3722                            .dwattr $C$DW$303, DW_AT_upper_bound(0x3ff)
    3723                            .dwendtag $C$DW$T$41
    3724                    
    3725                    
    3726                    $C$DW$T$42      .dwtag  DW_TAG_array_type
    3727                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$34)
    3728                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3729                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x1e000)
    3730                    $C$DW$304       .dwtag  DW_TAG_subrange_type
    3731                            .dwattr $C$DW$304, DW_AT_upper_bound(0x1d)
    3732                    $C$DW$305       .dwtag  DW_TAG_subrange_type
    3733                            .dwattr $C$DW$305, DW_AT_upper_bound(0x3ff)
    3734                            .dwendtag $C$DW$T$42
    3735                    
    3736                    
    3737                    $C$DW$T$44      .dwtag  DW_TAG_array_type
    3738                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$34)
    3739                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3740                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x1e0)
    3741                    $C$DW$306       .dwtag  DW_TAG_subrange_type
    3742                            .dwattr $C$DW$306, DW_AT_upper_bound(0x77)
    3743                            .dwendtag $C$DW$T$44
    3744                    
    3745                    
    3746                    $C$DW$T$45      .dwtag  DW_TAG_array_type
    3747                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$34)
    3748                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3749                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x40)
    3750                    $C$DW$307       .dwtag  DW_TAG_subrange_type
    3751                            .dwattr $C$DW$307, DW_AT_upper_bound(0x0f)
    3752                            .dwendtag $C$DW$T$45
    3753                    
    3754                    
    3755                    $C$DW$T$62      .dwtag  DW_TAG_array_type
    3756                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$34)
    3757                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3758                            .dwattr $C$DW$T$62, DW_AT_byte_size(0x10)
    3759                    $C$DW$308       .dwtag  DW_TAG_subrange_type
    3760                            .dwattr $C$DW$308, DW_AT_upper_bound(0x03)
    3761                            .dwendtag $C$DW$T$62
    3762                    
    3763                    $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    3764                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$34)
    3765                            .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
    3766                    $C$DW$T$155     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:28 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   75

    3767                            .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$34)
    3768                            .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    3769                            .dwattr $C$DW$T$155, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3770                            .dwattr $C$DW$T$155, DW_AT_decl_line(0x4b)
    3771                            .dwattr $C$DW$T$155, DW_AT_decl_column(0x17)
    3772                    $C$DW$T$156     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    3773                            .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$34)
    3774                            .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    3775                            .dwattr $C$DW$T$156, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3776                            .dwattr $C$DW$T$156, DW_AT_decl_line(0x4e)
    3777                            .dwattr $C$DW$T$156, DW_AT_decl_column(0x17)
    3778                    $C$DW$T$157     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    3779                            .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$34)
    3780                            .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
    3781                            .dwattr $C$DW$T$157, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3782                            .dwattr $C$DW$T$157, DW_AT_decl_line(0x49)
    3783                            .dwattr $C$DW$T$157, DW_AT_decl_column(0x17)
    3784                    $C$DW$T$158     .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    3785                            .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$34)
    3786                            .dwattr $C$DW$T$158, DW_AT_language(DW_LANG_C)
    3787                            .dwattr $C$DW$T$158, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3788                            .dwattr $C$DW$T$158, DW_AT_decl_line(0x3e)
    3789                            .dwattr $C$DW$T$158, DW_AT_decl_column(0x17)
    3790                    $C$DW$T$159     .dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
    3791                            .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$10)
    3792                            .dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
