TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:13:05 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v7.4.2 *
       3                    ;* Date/Time created: Sat Sep 26 11:13:05 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --c64p_l1d_workaround=off --endian=little --hll_source=on --long_pre
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C66xx                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *

    2342                    $C$DW$T$65      .dwtag  DW_TAG_enumeration_type
    2343                            .dwattr $C$DW$T$65, DW_AT_byte_size(0x04)
    2344                    $C$DW$210       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_FAIL"), DW_AT_const_value(0x00)
    2345                            .dwattr $C$DW$210, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\../comm
    2346                            .dwattr $C$DW$210, DW_AT_decl_line(0x72)
    2347                            .dwattr $C$DW$210, DW_AT_decl_column(0x05)
    2348                    $C$DW$211       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_PASS"), DW_AT_const_value(0x01)
    2349                            .dwattr $C$DW$211, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\../comm
    2350                            .dwattr $C$DW$211, DW_AT_decl_line(0x73)
    2351                            .dwattr $C$DW$211, DW_AT_decl_column(0x05)
    2352                            .dwendtag $C$DW$T$65
    2353                    
    2354                            .dwattr $C$DW$T$65, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\../com
    2355                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x71)
    2356                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x06)
    2357                    
    2358                    $C$DW$T$66      .dwtag  DW_TAG_enumeration_type
    2359                            .dwattr $C$DW$T$66, DW_AT_byte_size(0x04)
    2360                    $C$DW$212       .dwtag  DW_TAG_enumerator, DW_AT_name("BOOL_FALSE"), DW_AT_const_value(0x00)
    2361                            .dwattr $C$DW$212, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2362                            .dwattr $C$DW$212, DW_AT_decl_line(0x8f)
    2363                            .dwattr $C$DW$212, DW_AT_decl_column(0x05)
    2364                    $C$DW$213       .dwtag  DW_TAG_enumerator, DW_AT_name("BOOL_TRUE"), DW_AT_const_value(0x01)
    2365                            .dwattr $C$DW$213, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2366                            .dwattr $C$DW$213, DW_AT_decl_line(0x90)
    2367                            .dwattr $C$DW$213, DW_AT_decl_column(0x05)
    2368                            .dwendtag $C$DW$T$66
    2369                    
    2370                            .dwattr $C$DW$T$66, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    2371                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x8e)
    2372                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x0e)
    2373                    $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("CORB_Bool")
    2374                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    2375                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:13:05 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   52

    2376                            .dwattr $C$DW$T$67, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    2377                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x91)
    2378                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x02)
    2379                    
    2380                    $C$DW$T$68      .dwtag  DW_TAG_enumeration_type
    2381                            .dwattr $C$DW$T$68, DW_AT_byte_size(0x04)
    2382                    $C$DW$214       .dwtag  DW_TAG_enumerator, DW_AT_name("CORB_OK"), DW_AT_const_value(0x00)
    2383                            .dwattr $C$DW$214, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2384                            .dwattr $C$DW$214, DW_AT_decl_line(0xa2)
    2385                            .dwattr $C$DW$214, DW_AT_decl_column(0x05)
    2386                    $C$DW$215       .dwtag  DW_TAG_enumerator, DW_AT_name("CORB_FAIL"), DW_AT_const_value(-1)
    2387                            .dwattr $C$DW$215, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2388                            .dwattr $C$DW$215, DW_AT_decl_line(0xa3)
    2389                            .dwattr $C$DW$215, DW_AT_decl_column(0x05)
    2390                            .dwendtag $C$DW$T$68
    2391                    
    2392                            .dwattr $C$DW$T$68, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    2393                            .dwattr $C$DW$T$68, DW_AT_decl_line(0xa1)
    2394                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x0e)
    2395                    $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("CORBResult")
    2396                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    2397                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2398                            .dwattr $C$DW$T$69, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    2399                            .dwattr $C$DW$T$69, DW_AT_decl_line(0xa4)
    2400                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x02)
    2401                    
    2402                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2403                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x20)
    2404                    $C$DW$216       .dwtag  DW_TAG_member
    2405                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2406                            .dwattr $C$DW$216, DW_AT_name("testPattern")
    2407                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("testPattern")
    2408                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2409                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2410                            .dwattr $C$DW$216, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\VLIB_or
    2411                            .dwattr $C$DW$216, DW_AT_decl_line(0x24)
    2412                            .dwattr $C$DW$216, DW_AT_decl_column(0x0f)
    2413                    $C$DW$217       .dwtag  DW_TAG_member
    2414                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$20)
    2415                            .dwattr $C$DW$217, DW_AT_name("staticIn")
    2416                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("staticIn")
    2417                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2418                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2419                            .dwattr $C$DW$217, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\VLIB_or
    2420                            .dwattr $C$DW$217, DW_AT_decl_line(0x25)
    2421                            .dwattr $C$DW$217, DW_AT_decl_column(0x0f)
    2422                    $C$DW$218       .dwtag  DW_TAG_member
    2423                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$22)
    2424                            .dwattr $C$DW$218, DW_AT_name("staticInFeatures")
    2425                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("staticInFeatures")
    2426                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2427                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2428                            .dwattr $C$DW$218, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\VLIB_or
    2429                            .dwattr $C$DW$218, DW_AT_decl_line(0x26)
    2430                            .dwattr $C$DW$218, DW_AT_decl_column(0x0f)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:13:05 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   53

    2431                    $C$DW$219       .dwtag  DW_TAG_member
    2432                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$22)
    2433                            .dwattr $C$DW$219, DW_AT_name("staticOut")
    2434                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("staticOut")
    2435                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2436                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2437                            .dwattr $C$DW$219, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\VLIB_or
    2438                            .dwattr $C$DW$219, DW_AT_decl_line(0x27)
    2439                            .dwattr $C$DW$219, DW_AT_decl_column(0x0f)
    2440                    $C$DW$220       .dwtag  DW_TAG_member
    2441                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$21)
    2442                            .dwattr $C$DW$220, DW_AT_name("imageWidth")
    2443                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("imageWidth")
    2444                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2445                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2446                            .dwattr $C$DW$220, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\VLIB_or
    2447                            .dwattr $C$DW$220, DW_AT_decl_line(0x28)
    2448                            .dwattr $C$DW$220, DW_AT_decl_column(0x0f)
    2449                    $C$DW$221       .dwtag  DW_TAG_member
    2450                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$21)
    2451                            .dwattr $C$DW$221, DW_AT_name("imageHeight")
    2452                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("imageHeight")
    2453                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2454                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2455                            .dwattr $C$DW$221, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\VLIB_or
    2456                            .dwattr $C$DW$221, DW_AT_decl_line(0x29)
    2457                            .dwattr $C$DW$221, DW_AT_decl_column(0x0f)
    2458                    $C$DW$222       .dwtag  DW_TAG_member
    2459                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$23)
    2460                            .dwattr $C$DW$222, DW_AT_name("true_num_features")
    2461                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("true_num_features")
    2462                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2463                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2464                            .dwattr $C$DW$222, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\VLIB_or
    2465                            .dwattr $C$DW$222, DW_AT_decl_line(0x2a)
    2466                            .dwattr $C$DW$222, DW_AT_decl_column(0x0f)
    2467                    $C$DW$223       .dwtag  DW_TAG_member
    2468                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    2469                            .dwattr $C$DW$223, DW_AT_name("fastDifferenceThreshold")
    2470                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("fastDifferenceThreshold")
    2471                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2472                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2473                            .dwattr $C$DW$223, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\VLIB_or
    2474                            .dwattr $C$DW$223, DW_AT_decl_line(0x2b)
    2475                            .dwattr $C$DW$223, DW_AT_decl_column(0x0f)
    2476                    $C$DW$224       .dwtag  DW_TAG_member
    2477                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$25)
    2478                            .dwattr $C$DW$224, DW_AT_name("desc")
    2479                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("desc")
    2480                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2481                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2482                            .dwattr $C$DW$224, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\VLIB_or
    2483                            .dwattr $C$DW$224, DW_AT_decl_line(0x2c)
    2484                            .dwattr $C$DW$224, DW_AT_decl_column(0x0f)
    2485                            .dwendtag $C$DW$T$26
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:13:05 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   54

    2486                    
    2487                            .dwattr $C$DW$T$26, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\VLIB_o
    2488                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x23)
    2489                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    2490                    $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    2491                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$26)
    2492                            .dwattr $C$DW$T$70, DW_AT_address_class(0x20)
    2493                    $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("originalfast9_score_testParams_t")
    2494                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$26)
    2495                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    2496                            .dwattr $C$DW$T$72, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\VLIB_o
    2497                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x2d)
    2498                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    2499                    $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    2500                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    2501                            .dwattr $C$DW$T$73, DW_AT_address_class(0x20)
    2502                    $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    2503                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    2504                            .dwattr $C$DW$T$74, DW_AT_address_class(0x20)
    2505                    
    2506                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2507                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x18)
    2508                    $C$DW$225       .dwtag  DW_TAG_member
    2509                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$10)
    2510                            .dwattr $C$DW$225, DW_AT_name("fd")
    2511                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("fd")
    2512                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2513                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2514                            .dwattr $C$DW$225, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2515                            .dwattr $C$DW$225, DW_AT_decl_line(0x49)
    2516                            .dwattr $C$DW$225, DW_AT_decl_column(0x0b)
    2517                    $C$DW$226       .dwtag  DW_TAG_member
    2518                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$27)
    2519                            .dwattr $C$DW$226, DW_AT_name("buf")
    2520                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("buf")
    2521                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2522                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2523                            .dwattr $C$DW$226, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2524                            .dwattr $C$DW$226, DW_AT_decl_line(0x4a)
    2525                            .dwattr $C$DW$226, DW_AT_decl_column(0x16)
    2526                    $C$DW$227       .dwtag  DW_TAG_member
    2527                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$27)
    2528                            .dwattr $C$DW$227, DW_AT_name("pos")
    2529                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("pos")
    2530                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2531                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2532                            .dwattr $C$DW$227, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2533                            .dwattr $C$DW$227, DW_AT_decl_line(0x4b)
    2534                            .dwattr $C$DW$227, DW_AT_decl_column(0x16)
    2535                    $C$DW$228       .dwtag  DW_TAG_member
    2536                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$27)
    2537                            .dwattr $C$DW$228, DW_AT_name("bufend")
    2538                            .dwattr $C$DW$228, DW_AT_TI_symbol_name("bufend")
    2539                            .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2540                            .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:13:05 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   55

    2541                            .dwattr $C$DW$228, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2542                            .dwattr $C$DW$228, DW_AT_decl_line(0x4c)
    2543                            .dwattr $C$DW$228, DW_AT_decl_column(0x16)
    2544                    $C$DW$229       .dwtag  DW_TAG_member
    2545                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$27)
    2546                            .dwattr $C$DW$229, DW_AT_name("buff_stop")
    2547                            .dwattr $C$DW$229, DW_AT_TI_symbol_name("buff_stop")
    2548                            .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2549                            .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2550                            .dwattr $C$DW$229, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2551                            .dwattr $C$DW$229, DW_AT_decl_line(0x4d)
    2552                            .dwattr $C$DW$229, DW_AT_decl_column(0x16)
    2553                    $C$DW$230       .dwtag  DW_TAG_member
    2554                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$11)
    2555                            .dwattr $C$DW$230, DW_AT_name("flags")
    2556                            .dwattr $C$DW$230, DW_AT_TI_symbol_name("flags")
    2557                            .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2558                            .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2559                            .dwattr $C$DW$230, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2560                            .dwattr $C$DW$230, DW_AT_decl_line(0x4e)
    2561                            .dwattr $C$DW$230, DW_AT_decl_column(0x16)
    2562                            .dwendtag $C$DW$T$28
    2563                    
    2564                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2565                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x48)
    2566                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    2567                    $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    2568                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$28)
    2569                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2570                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2571                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x4f)
    2572                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    2573                    
    2574                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2575                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    2576                    $C$DW$231       .dwtag  DW_TAG_member
    2577                            .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$10)
    2578                            .dwattr $C$DW$231, DW_AT_name("quot")
    2579                            .dwattr $C$DW$231, DW_AT_TI_symbol_name("quot")
    2580                            .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2581                            .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2582                            .dwattr $C$DW$231, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2583                            .dwattr $C$DW$231, DW_AT_decl_line(0x3e)
    2584                            .dwattr $C$DW$231, DW_AT_decl_column(0x16)
    2585                    $C$DW$232       .dwtag  DW_TAG_member
    2586                            .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$10)
    2587                            .dwattr $C$DW$232, DW_AT_name("rem")
    2588                            .dwattr $C$DW$232, DW_AT_TI_symbol_name("rem")
    2589                            .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2590                            .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2591                            .dwattr $C$DW$232, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2592                            .dwattr $C$DW$232, DW_AT_decl_line(0x3e)
    2593                            .dwattr $C$DW$232, DW_AT_decl_column(0x1c)
    2594                            .dwendtag $C$DW$T$29
    2595                    
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:13:05 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   56

    2596                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2597                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x3e)
    2598                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    2599                    $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    2600                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$29)
    2601                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    2602                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2603                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x3e)
    2604                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x23)
    2605                    
    2606                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2607                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
    2608                    $C$DW$233       .dwtag  DW_TAG_member
    2609                            .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$10)
    2610                            .dwattr $C$DW$233, DW_AT_name("quot")
    2611                            .dwattr $C$DW$233, DW_AT_TI_symbol_name("quot")
    2612                            .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2613                            .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2614                            .dwattr $C$DW$233, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2615                            .dwattr $C$DW$233, DW_AT_decl_line(0x40)
    2616                            .dwattr $C$DW$233, DW_AT_decl_column(0x17)
    2617                    $C$DW$234       .dwtag  DW_TAG_member
    2618                            .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$10)
    2619                            .dwattr $C$DW$234, DW_AT_name("rem")
    2620                            .dwattr $C$DW$234, DW_AT_TI_symbol_name("rem")
    2621                            .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2622                            .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2623                            .dwattr $C$DW$234, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2624                            .dwattr $C$DW$234, DW_AT_decl_line(0x40)
    2625                            .dwattr $C$DW$234, DW_AT_decl_column(0x1d)
    2626                            .dwendtag $C$DW$T$30
    2627                    
    2628                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2629                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x40)
    2630                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    2631                    $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    2632                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$30)
    2633                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2634                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2635                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x40)
    2636                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x24)
    2637                    
    2638                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2639                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x10)
    2640                    $C$DW$235       .dwtag  DW_TAG_member
    2641                            .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$14)
    2642                            .dwattr $C$DW$235, DW_AT_name("quot")
    2643                            .dwattr $C$DW$235, DW_AT_TI_symbol_name("quot")
    2644                            .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2645                            .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2646                            .dwattr $C$DW$235, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2647                            .dwattr $C$DW$235, DW_AT_decl_line(0x43)
    2648                            .dwattr $C$DW$235, DW_AT_decl_column(0x1c)
    2649                    $C$DW$236       .dwtag  DW_TAG_member
    2650                            .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$14)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:13:05 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   57

    2651                            .dwattr $C$DW$236, DW_AT_name("rem")
    2652                            .dwattr $C$DW$236, DW_AT_TI_symbol_name("rem")
    2653                            .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2654                            .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2655                            .dwattr $C$DW$236, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2656                            .dwattr $C$DW$236, DW_AT_decl_line(0x43)
    2657                            .dwattr $C$DW$236, DW_AT_decl_column(0x22)
    2658                            .dwendtag $C$DW$T$31
    2659                    
    2660                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2661                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x43)
    2662                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    2663                    $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    2664                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$31)
    2665                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    2666                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2667                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x43)
    2668                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x29)
    2669                    
    2670                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2671                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x24)
    2672                    $C$DW$237       .dwtag  DW_TAG_member
    2673                            .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$32)
    2674                            .dwattr $C$DW$237, DW_AT_name("area")
    2675                            .dwattr $C$DW$237, DW_AT_TI_symbol_name("area")
    2676                            .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2677                            .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2678                            .dwattr $C$DW$237, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\comm
    2679                            .dwattr $C$DW$237, DW_AT_decl_line(0x69)
    2680                            .dwattr $C$DW$237, DW_AT_decl_column(0x0d)
    2681                    $C$DW$238       .dwtag  DW_TAG_member
    2682                            .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$32)
    2683                            .dwattr $C$DW$238, DW_AT_name("xsum")
    2684                            .dwattr $C$DW$238, DW_AT_TI_symbol_name("xsum")
    2685                            .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2686                            .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2687                            .dwattr $C$DW$238, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\comm
    2688                            .dwattr $C$DW$238, DW_AT_decl_line(0x6a)
    2689                            .dwattr $C$DW$238, DW_AT_decl_column(0x0d)
    2690                    $C$DW$239       .dwtag  DW_TAG_member
    2691                            .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$32)
    2692                            .dwattr $C$DW$239, DW_AT_name("ysum")
    2693                            .dwattr $C$DW$239, DW_AT_TI_symbol_name("ysum")
    2694                            .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2695                            .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2696                            .dwattr $C$DW$239, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\comm
    2697                            .dwattr $C$DW$239, DW_AT_decl_line(0x6b)
    2698                            .dwattr $C$DW$239, DW_AT_decl_column(0x0d)
    2699                    $C$DW$240       .dwtag  DW_TAG_member
    2700                            .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$32)
    2701                            .dwattr $C$DW$240, DW_AT_name("xmin")
    2702                            .dwattr $C$DW$240, DW_AT_TI_symbol_name("xmin")
    2703                            .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2704                            .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2705                            .dwattr $C$DW$240, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\comm
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:13:05 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   58

    2706                            .dwattr $C$DW$240, DW_AT_decl_line(0x6d)
    2707                            .dwattr $C$DW$240, DW_AT_decl_column(0x0d)
    2708                    $C$DW$241       .dwtag  DW_TAG_member
    2709                            .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$32)
    2710                            .dwattr $C$DW$241, DW_AT_name("ymin")
    2711                            .dwattr $C$DW$241, DW_AT_TI_symbol_name("ymin")
    2712                            .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2713                            .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2714                            .dwattr $C$DW$241, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\comm
    2715                            .dwattr $C$DW$241, DW_AT_decl_line(0x6e)
    2716                            .dwattr $C$DW$241, DW_AT_decl_column(0x0d)
    2717                    $C$DW$242       .dwtag  DW_TAG_member
    2718                            .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$32)
    2719                            .dwattr $C$DW$242, DW_AT_name("xmax")
    2720                            .dwattr $C$DW$242, DW_AT_TI_symbol_name("xmax")
    2721                            .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2722                            .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2723                            .dwattr $C$DW$242, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\comm
    2724                            .dwattr $C$DW$242, DW_AT_decl_line(0x6f)
    2725                            .dwattr $C$DW$242, DW_AT_decl_column(0x0d)
    2726                    $C$DW$243       .dwtag  DW_TAG_member
    2727                            .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$32)
    2728                            .dwattr $C$DW$243, DW_AT_name("ymax")
    2729                            .dwattr $C$DW$243, DW_AT_TI_symbol_name("ymax")
    2730                            .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2731                            .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2732                            .dwattr $C$DW$243, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\comm
    2733                            .dwattr $C$DW$243, DW_AT_decl_line(0x70)
    2734                            .dwattr $C$DW$243, DW_AT_decl_column(0x0d)
    2735                    $C$DW$244       .dwtag  DW_TAG_member
    2736                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$32)
    2737                            .dwattr $C$DW$244, DW_AT_name("seedx")
    2738                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("seedx")
    2739                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2740                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2741                            .dwattr $C$DW$244, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\comm
    2742                            .dwattr $C$DW$244, DW_AT_decl_line(0x72)
    2743                            .dwattr $C$DW$244, DW_AT_decl_column(0x0d)
    2744                    $C$DW$245       .dwtag  DW_TAG_member
    2745                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$32)
    2746                            .dwattr $C$DW$245, DW_AT_name("seedy")
    2747                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("seedy")
    2748                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2749                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2750                            .dwattr $C$DW$245, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\comm
    2751                            .dwattr $C$DW$245, DW_AT_decl_line(0x73)
    2752                            .dwattr $C$DW$245, DW_AT_decl_column(0x0d)
    2753                            .dwendtag $C$DW$T$33
    2754                    
    2755                            .dwattr $C$DW$T$33, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\com
    2756                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x68)
    2757                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    2758                    $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CC")
    2759                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$33)
    2760                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:13:05 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   59

    2761                            .dwattr $C$DW$T$79, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\com
    2762                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x75)
    2763                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x03)
    2764                    
    2765                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2766                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x10)
    2767                    $C$DW$246       .dwtag  DW_TAG_member
    2768                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$8)
    2769                            .dwattr $C$DW$246, DW_AT_name("daylight")
    2770                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("daylight")
    2771                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2772                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2773                            .dwattr $C$DW$246, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2774                            .dwattr $C$DW$246, DW_AT_decl_line(0x52)
    2775                            .dwattr $C$DW$246, DW_AT_decl_column(0x0b)
    2776                    $C$DW$247       .dwtag  DW_TAG_member
    2777                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$10)
    2778                            .dwattr $C$DW$247, DW_AT_name("timezone")
    2779                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("timezone")
    2780                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2781                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2782                            .dwattr $C$DW$247, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2783                            .dwattr $C$DW$247, DW_AT_decl_line(0x53)
    2784                            .dwattr $C$DW$247, DW_AT_decl_column(0x0b)
    2785                    $C$DW$248       .dwtag  DW_TAG_member
    2786                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$34)
    2787                            .dwattr $C$DW$248, DW_AT_name("tzname")
    2788                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("tzname")
    2789                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2790                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2791                            .dwattr $C$DW$248, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2792                            .dwattr $C$DW$248, DW_AT_decl_line(0x54)
    2793                            .dwattr $C$DW$248, DW_AT_decl_column(0x0b)
    2794                    $C$DW$249       .dwtag  DW_TAG_member
    2795                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$34)
    2796                            .dwattr $C$DW$249, DW_AT_name("dstname")
    2797                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("dstname")
    2798                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2799                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2800                            .dwattr $C$DW$249, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2801                            .dwattr $C$DW$249, DW_AT_decl_line(0x55)
    2802                            .dwattr $C$DW$249, DW_AT_decl_column(0x0b)
    2803                            .dwendtag $C$DW$T$35
    2804                    
    2805                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2806                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x51)
    2807                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x01)
    2808                    $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("TZ")
    2809                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$35)
    2810                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    2811                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2812                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x56)
    2813                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x03)
    2814                    
    2815                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:13:05 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   60

    2816                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x14)
    2817                    $C$DW$250       .dwtag  DW_TAG_member
    2818                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$32)
    2819                            .dwattr $C$DW$250, DW_AT_name("width")
    2820                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("width")
    2821                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2822                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2823                            .dwattr $C$DW$250, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2824                            .dwattr $C$DW$250, DW_AT_decl_line(0xaa)
    2825                            .dwattr $C$DW$250, DW_AT_decl_column(0x0d)
    2826                    $C$DW$251       .dwtag  DW_TAG_member
    2827                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$32)
    2828                            .dwattr $C$DW$251, DW_AT_name("height")
    2829                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("height")
    2830                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2831                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2832                            .dwattr $C$DW$251, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2833                            .dwattr $C$DW$251, DW_AT_decl_line(0xab)
    2834                            .dwattr $C$DW$251, DW_AT_decl_column(0x0d)
    2835                    $C$DW$252       .dwtag  DW_TAG_member
    2836                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$32)
    2837                            .dwattr $C$DW$252, DW_AT_name("marginPixels")
    2838                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("marginPixels")
    2839                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2840                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2841                            .dwattr $C$DW$252, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2842                            .dwattr $C$DW$252, DW_AT_decl_line(0xac)
    2843                            .dwattr $C$DW$252, DW_AT_decl_column(0x0d)
    2844                    $C$DW$253       .dwtag  DW_TAG_member
    2845                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    2846                            .dwattr $C$DW$253, DW_AT_name("fastDifferenceThreshold")
    2847                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("fastDifferenceThreshold")
    2848                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2849                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2850                            .dwattr $C$DW$253, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2851                            .dwattr $C$DW$253, DW_AT_decl_line(0xae)
    2852                            .dwattr $C$DW$253, DW_AT_decl_column(0x0d)
    2853                    $C$DW$254       .dwtag  DW_TAG_member
    2854                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$32)
    2855                            .dwattr $C$DW$254, DW_AT_name("n_features_desired")
    2856                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("n_features_desired")
    2857                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2858                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2859                            .dwattr $C$DW$254, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2860                            .dwattr $C$DW$254, DW_AT_decl_line(0xb2)
    2861                            .dwattr $C$DW$254, DW_AT_decl_column(0x0d)
    2862                            .dwendtag $C$DW$T$36
    2863                    
    2864                            .dwattr $C$DW$T$36, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    2865                            .dwattr $C$DW$T$36, DW_AT_decl_line(0xa9)
    2866                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    2867                    $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("CORBParameters")
    2868                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$36)
    2869                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    2870                            .dwattr $C$DW$T$81, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:13:05 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   61

    2871                            .dwattr $C$DW$T$81, DW_AT_decl_line(0xb3)
    2872                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x02)
    2873                    
    2874                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2875                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x5a008)
    2876                    $C$DW$255       .dwtag  DW_TAG_member
    2877                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$32)
    2878                            .dwattr $C$DW$255, DW_AT_name("octave")
    2879                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("octave")
    2880                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2881                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2882                            .dwattr $C$DW$255, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2883                            .dwattr $C$DW$255, DW_AT_decl_line(0xb9)
    2884                            .dwattr $C$DW$255, DW_AT_decl_column(0x0d)
    2885                    $C$DW$256       .dwtag  DW_TAG_member
    2886                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$38)
    2887                            .dwattr $C$DW$256, DW_AT_name("relative_patterns")
    2888                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("relative_patterns")
    2889                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2890                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2891                            .dwattr $C$DW$256, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2892                            .dwattr $C$DW$256, DW_AT_decl_line(0xbb)
    2893                            .dwattr $C$DW$256, DW_AT_decl_column(0x0d)
    2894                    $C$DW$257       .dwtag  DW_TAG_member
    2895                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$40)
    2896                            .dwattr $C$DW$257, DW_AT_name("rotated_patterns")
    2897                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("rotated_patterns")
    2898                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c004]
    2899                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2900                            .dwattr $C$DW$257, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2901                            .dwattr $C$DW$257, DW_AT_decl_line(0xbc)
    2902                            .dwattr $C$DW$257, DW_AT_decl_column(0x0d)
    2903                    $C$DW$258       .dwtag  DW_TAG_member
    2904                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$32)
    2905                            .dwattr $C$DW$258, DW_AT_name("integralImageWidth")
    2906                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("integralImageWidth")
    2907                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a004]
    2908                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2909                            .dwattr $C$DW$258, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2910                            .dwattr $C$DW$258, DW_AT_decl_line(0xbd)
    2911                            .dwattr $C$DW$258, DW_AT_decl_column(0x0d)
    2912                            .dwendtag $C$DW$T$41
    2913                    
    2914                            .dwattr $C$DW$T$41, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    2915                            .dwattr $C$DW$T$41, DW_AT_decl_line(0xb8)
    2916                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    2917                    $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CORBPatterns")
    2918                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$41)
    2919                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2920                            .dwattr $C$DW$T$45, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    2921                            .dwattr $C$DW$T$45, DW_AT_decl_line(0xbe)
    2922                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x02)
    2923                    
    2924                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2925                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x400)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:13:05 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   62

    2926                    $C$DW$259       .dwtag  DW_TAG_member
    2927                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$42)
    2928                            .dwattr $C$DW$259, DW_AT_name("orientation_horizontal_offsets")
    2929                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("orientation_horizontal_offsets")
    2930                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2931                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2932                            .dwattr $C$DW$259, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2933                            .dwattr $C$DW$259, DW_AT_decl_line(0xc4)
    2934                            .dwattr $C$DW$259, DW_AT_decl_column(0x0d)
    2935                    $C$DW$260       .dwtag  DW_TAG_member
    2936                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$42)
    2937                            .dwattr $C$DW$260, DW_AT_name("orientation_vertical_offsets")
    2938                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("orientation_vertical_offsets")
    2939                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e0]
    2940                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2941                            .dwattr $C$DW$260, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2942                            .dwattr $C$DW$260, DW_AT_decl_line(0xc5)
    2943                            .dwattr $C$DW$260, DW_AT_decl_column(0x0d)
    2944                    $C$DW$261       .dwtag  DW_TAG_member
    2945                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$43)
    2946                            .dwattr $C$DW$261, DW_AT_name("u_max")
    2947                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("u_max")
    2948                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c0]
    2949                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2950                            .dwattr $C$DW$261, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2951                            .dwattr $C$DW$261, DW_AT_decl_line(0xc6)
    2952                            .dwattr $C$DW$261, DW_AT_decl_column(0x0d)
    2953                            .dwendtag $C$DW$T$44
    2954                    
    2955                            .dwattr $C$DW$T$44, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    2956                            .dwattr $C$DW$T$44, DW_AT_decl_line(0xc3)
    2957                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    2958                    $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOrientationOffsets")
    2959                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$44)
    2960                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2961                            .dwattr $C$DW$T$46, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    2962                            .dwattr $C$DW$T$46, DW_AT_decl_line(0xc7)
    2963                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x02)
    2964                    
    2965                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    2966                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x5a420)
    2967                    $C$DW$262       .dwtag  DW_TAG_member
    2968                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$45)
    2969                            .dwattr $C$DW$262, DW_AT_name("patterns")
    2970                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("patterns")
    2971                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2972                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2973                            .dwattr $C$DW$262, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2974                            .dwattr $C$DW$262, DW_AT_decl_line(0xcd)
    2975                            .dwattr $C$DW$262, DW_AT_decl_column(0x1c)
    2976                    $C$DW$263       .dwtag  DW_TAG_member
    2977                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$46)
    2978                            .dwattr $C$DW$263, DW_AT_name("offsets")
    2979                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("offsets")
    2980                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a008]
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:13:05 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   63

    2981                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2982                            .dwattr $C$DW$263, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2983                            .dwattr $C$DW$263, DW_AT_decl_line(0xce)
    2984                            .dwattr $C$DW$263, DW_AT_decl_column(0x1c)
    2985                    $C$DW$264       .dwtag  DW_TAG_member
    2986                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$20)
    2987                            .dwattr $C$DW$264, DW_AT_name("image")
    2988                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("image")
    2989                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a408]
    2990                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2991                            .dwattr $C$DW$264, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2992                            .dwattr $C$DW$264, DW_AT_decl_line(0xcf)
    2993                            .dwattr $C$DW$264, DW_AT_decl_column(0x1c)
    2994                    $C$DW$265       .dwtag  DW_TAG_member
    2995                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$20)
    2996                            .dwattr $C$DW$265, DW_AT_name("prefimage")
    2997                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("prefimage")
    2998                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a40c]
    2999                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3000                            .dwattr $C$DW$265, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3001                            .dwattr $C$DW$265, DW_AT_decl_line(0xd0)
    3002                            .dwattr $C$DW$265, DW_AT_decl_column(0x1c)
    3003                    $C$DW$266       .dwtag  DW_TAG_member
    3004                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$48)
    3005                            .dwattr $C$DW$266, DW_AT_name("harrisImage")
    3006                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("harrisImage")
    3007                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a410]
    3008                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3009                            .dwattr $C$DW$266, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3010                            .dwattr $C$DW$266, DW_AT_decl_line(0xd1)
    3011                            .dwattr $C$DW$266, DW_AT_decl_column(0x1c)
    3012                    $C$DW$267       .dwtag  DW_TAG_member
    3013                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$49)
    3014                            .dwattr $C$DW$267, DW_AT_name("integralImage")
    3015                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("integralImage")
    3016                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a414]
    3017                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3018                            .dwattr $C$DW$267, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3019                            .dwattr $C$DW$267, DW_AT_decl_line(0xd2)
    3020                            .dwattr $C$DW$267, DW_AT_decl_column(0x1c)
    3021                    $C$DW$268       .dwtag  DW_TAG_member
    3022                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$25)
    3023                            .dwattr $C$DW$268, DW_AT_name("scratchBuffer")
    3024                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("scratchBuffer")
    3025                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a418]
    3026                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3027                            .dwattr $C$DW$268, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3028                            .dwattr $C$DW$268, DW_AT_decl_line(0xd3)
    3029                            .dwattr $C$DW$268, DW_AT_decl_column(0x1c)
    3030                    $C$DW$269       .dwtag  DW_TAG_member
    3031                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$51)
    3032                            .dwattr $C$DW$269, DW_AT_name("orbPattern31")
    3033                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("orbPattern31")
    3034                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a41c]
    3035                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:13:05 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   64

    3036                            .dwattr $C$DW$269, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3037                            .dwattr $C$DW$269, DW_AT_decl_line(0xd4)
    3038                            .dwattr $C$DW$269, DW_AT_decl_column(0x1c)
    3039                            .dwendtag $C$DW$T$52
    3040                    
    3041                            .dwattr $C$DW$T$52, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    3042                            .dwattr $C$DW$T$52, DW_AT_decl_line(0xcc)
    3043                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x10)
    3044                    $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("CORBInput")
    3045                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$52)
    3046                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    3047                            .dwattr $C$DW$T$82, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    3048                            .dwattr $C$DW$T$82, DW_AT_decl_line(0xd5)
    3049                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x02)
    3050                    
    3051                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    3052                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x38)
    3053                    $C$DW$270       .dwtag  DW_TAG_member
    3054                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$32)
    3055                            .dwattr $C$DW$270, DW_AT_name("x")
    3056                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("x")
    3057                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3058                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3059                            .dwattr $C$DW$270, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3060                            .dwattr $C$DW$270, DW_AT_decl_line(0xdc)
    3061                            .dwattr $C$DW$270, DW_AT_decl_column(0x0d)
    3062                    $C$DW$271       .dwtag  DW_TAG_member
    3063                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$32)
    3064                            .dwattr $C$DW$271, DW_AT_name("y")
    3065                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("y")
    3066                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3067                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3068                            .dwattr $C$DW$271, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3069                            .dwattr $C$DW$271, DW_AT_decl_line(0xde)
    3070                            .dwattr $C$DW$271, DW_AT_decl_column(0x0d)
    3071                    $C$DW$272       .dwtag  DW_TAG_member
    3072                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$32)
    3073                            .dwattr $C$DW$272, DW_AT_name("octave")
    3074                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("octave")
    3075                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3076                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3077                            .dwattr $C$DW$272, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3078                            .dwattr $C$DW$272, DW_AT_decl_line(0xe0)
    3079                            .dwattr $C$DW$272, DW_AT_decl_column(0x0d)
    3080                    $C$DW$273       .dwtag  DW_TAG_member
    3081                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$53)
    3082                            .dwattr $C$DW$273, DW_AT_name("angle")
    3083                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("angle")
    3084                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3085                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3086                            .dwattr $C$DW$273, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3087                            .dwattr $C$DW$273, DW_AT_decl_line(0xe3)
    3088                            .dwattr $C$DW$273, DW_AT_decl_column(0x0e)
    3089                    $C$DW$274       .dwtag  DW_TAG_member
    3090                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$32)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:13:05 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   65

    3091                            .dwattr $C$DW$274, DW_AT_name("fastResponse")
    3092                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("fastResponse")
    3093                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3094                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3095                            .dwattr $C$DW$274, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3096                            .dwattr $C$DW$274, DW_AT_decl_line(0xe4)
    3097                            .dwattr $C$DW$274, DW_AT_decl_column(0x0e)
    3098                    $C$DW$275       .dwtag  DW_TAG_member
    3099                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$47)
    3100                            .dwattr $C$DW$275, DW_AT_name("harrisResponse")
    3101                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("harrisResponse")
    3102                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3103                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3104                            .dwattr $C$DW$275, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3105                            .dwattr $C$DW$275, DW_AT_decl_line(0xe5)
    3106                            .dwattr $C$DW$275, DW_AT_decl_column(0x0e)
    3107                    $C$DW$276       .dwtag  DW_TAG_member
    3108                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$54)
    3109                            .dwattr $C$DW$276, DW_AT_name("descriptor")
    3110                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("descriptor")
    3111                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3112                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3113                            .dwattr $C$DW$276, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3114                            .dwattr $C$DW$276, DW_AT_decl_line(0xe6)
    3115                            .dwattr $C$DW$276, DW_AT_decl_column(0x0e)
    3116                            .dwendtag $C$DW$T$55
    3117                    
    3118                            .dwattr $C$DW$T$55, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    3119                            .dwattr $C$DW$T$55, DW_AT_decl_line(0xdb)
    3120                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    3121                    $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CORBFeature")
    3122                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    3123                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    3124                            .dwattr $C$DW$T$56, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    3125                            .dwattr $C$DW$T$56, DW_AT_decl_line(0xe7)
    3126                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x02)
    3127                    $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    3128                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    3129                            .dwattr $C$DW$T$57, DW_AT_address_class(0x20)
    3130                    
    3131                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    3132                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x08)
    3133                    $C$DW$277       .dwtag  DW_TAG_member
    3134                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$57)
    3135                            .dwattr $C$DW$277, DW_AT_name("features")
    3136                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("features")
    3137                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3138                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3139                            .dwattr $C$DW$277, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3140                            .dwattr $C$DW$277, DW_AT_decl_line(0xed)
    3141                            .dwattr $C$DW$277, DW_AT_decl_column(0x12)
    3142                    $C$DW$278       .dwtag  DW_TAG_member
    3143                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$32)
    3144                            .dwattr $C$DW$278, DW_AT_name("n_features")
    3145                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("n_features")
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:13:05 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   66

    3146                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3147                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3148                            .dwattr $C$DW$278, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3149                            .dwattr $C$DW$278, DW_AT_decl_line(0xee)
    3150                            .dwattr $C$DW$278, DW_AT_decl_column(0x12)
    3151                            .dwendtag $C$DW$T$58
    3152                    
    3153                            .dwattr $C$DW$T$58, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    3154                            .dwattr $C$DW$T$58, DW_AT_decl_line(0xec)
    3155                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x10)
    3156                    $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOutput")
    3157                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$58)
    3158                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3159                            .dwattr $C$DW$T$83, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    3160                            .dwattr $C$DW$T$83, DW_AT_decl_line(0xef)
    3161                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x02)
    3162                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3163                            .dwattr $C$DW$T$2, DW_AT_name("void")
    3164                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3165                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3166                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3167                    $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_PTR")
    3168                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$3)
    3169                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    3170                            .dwattr $C$DW$T$84, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\com
    3171                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x5c)
    3172                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x19)
    3173                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    3174                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3175                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    3176                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3177                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    3178                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3179                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3180                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3181                    $C$DW$T$121     .dwtag  DW_TAG_pointer_type
    3182                            .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$5)
    3183                            .dwattr $C$DW$T$121, DW_AT_address_class(0x20)
    3184                    $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    3185                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$5)
    3186                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    3187                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3188                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2a)
    3189                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x1d)
    3190                    $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    3191                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    3192                            .dwattr $C$DW$T$51, DW_AT_address_class(0x20)
    3193                    $C$DW$T$137     .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    3194                            .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$50)
    3195                            .dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
    3196                            .dwattr $C$DW$T$137, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3197                            .dwattr $C$DW$T$137, DW_AT_decl_line(0x39)
    3198                            .dwattr $C$DW$T$137, DW_AT_decl_column(0x17)
    3199                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    3200                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:13:05 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   67

    3201                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3202                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3203                    $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    3204                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$6)
    3205                            .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    3206                    $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    3207                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
    3208                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    3209                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3210                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x2b)
    3211                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
    3212                    $C$DW$T$20      .dwtag  DW_TAG_pointer_type
    3213                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    3214                            .dwattr $C$DW$T$20, DW_AT_address_class(0x20)
    3215                    $C$DW$T$112     .dwtag  DW_TAG_restrict_type
    3216                            .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$20)
    3217                    
    3218                    $C$DW$T$54      .dwtag  DW_TAG_array_type
    3219                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$19)
    3220                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    3221                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x20)
    3222                    $C$DW$279       .dwtag  DW_TAG_subrange_type
    3223                            .dwattr $C$DW$279, DW_AT_upper_bound(0x1f)
    3224                            .dwendtag $C$DW$T$54
    3225                    
    3226                    $C$DW$T$107     .dwtag  DW_TAG_const_type
    3227                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$19)
    3228                    $C$DW$T$108     .dwtag  DW_TAG_pointer_type
    3229                            .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
    3230                            .dwattr $C$DW$T$108, DW_AT_address_class(0x20)
    3231                    $C$DW$T$109     .dwtag  DW_TAG_restrict_type
    3232                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$108)
    3233                    $C$DW$T$139     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    3234                            .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$19)
    3235                            .dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
    3236                            .dwattr $C$DW$T$139, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3237                            .dwattr $C$DW$T$139, DW_AT_decl_line(0x3a)
    3238                            .dwattr $C$DW$T$139, DW_AT_decl_column(0x16)
    3239                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    3240                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3241                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3242                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    3243                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    3244                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3245                            .dwattr $C$DW$T$8, DW_AT_name("short")
    3246                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    3247                    $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    3248                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$8)
    3249                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3250                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3251                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x2c)
    3252                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x1d)
    3253                    $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    3254                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    3255                            .dwattr $C$DW$T$48, DW_AT_address_class(0x20)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:13:05 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   68

    3256                    $C$DW$T$140     .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    3257                            .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$47)
    3258                            .dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
    3259                            .dwattr $C$DW$T$140, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3260                            .dwattr $C$DW$T$140, DW_AT_decl_line(0x3c)
    3261                            .dwattr $C$DW$T$140, DW_AT_decl_column(0x17)
    3262                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    3263                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3264                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3265                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    3266                    $C$DW$T$141     .dwtag  DW_TAG_pointer_type
    3267                            .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$9)
    3268                            .dwattr $C$DW$T$141, DW_AT_address_class(0x20)
    3269                    $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    3270                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
    3271                            .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    3272                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3273                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x2d)
    3274                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x1c)
    3275                    $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    3276                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    3277                            .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
    3278                    $C$DW$T$143     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    3279                            .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$21)
    3280                            .dwattr $C$DW$T$143, DW_AT_language(DW_LANG_C)
    3281                            .dwattr $C$DW$T$143, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3282                            .dwattr $C$DW$T$143, DW_AT_decl_line(0x3d)
    3283                            .dwattr $C$DW$T$143, DW_AT_decl_column(0x16)
    3284                    $C$DW$T$142     .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    3285                            .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$9)
    3286                            .dwattr $C$DW$T$142, DW_AT_language(DW_LANG_C)
    3287                            .dwattr $C$DW$T$142, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3288                            .dwattr $C$DW$T$142, DW_AT_decl_line(0x53)
    3289                            .dwattr $C$DW$T$142, DW_AT_decl_column(0x1a)
    3290                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    3291                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3292                            .dwattr $C$DW$T$10, DW_AT_name("int")
    3293                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    3294                    $C$DW$T$159     .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
    3295                            .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$10)
    3296                            .dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
    3297                            .dwattr $C$DW$T$159, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3298                            .dwattr $C$DW$T$159, DW_AT_decl_line(0x53)
    3299                            .dwattr $C$DW$T$159, DW_AT_decl_column(0x0d)
    3300                    $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    3301                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$10)
    3302                            .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    3303                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3304                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x2e)
    3305                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x1d)
    3306                    $C$DW$T$153     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CCHandle")
    3307                            .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$32)
    3308                            .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    3309                            .dwattr $C$DW$T$153, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\co
    3310                            .dwattr $C$DW$T$153, DW_AT_decl_line(0x77)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:13:05 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   69

    3311                            .dwattr $C$DW$T$153, DW_AT_decl_column(0x11)
    3312                    
    3313                    $C$DW$T$37      .dwtag  DW_TAG_array_type
    3314                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$32)
    3315                            .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    3316                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x2000)
    3317                    $C$DW$280       .dwtag  DW_TAG_subrange_type
    3318                            .dwattr $C$DW$280, DW_AT_upper_bound(0x7ff)
    3319                            .dwendtag $C$DW$T$37
    3320                    
    3321                    
    3322                    $C$DW$T$38      .dwtag  DW_TAG_array_type
    3323                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$32)
    3324                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3325                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x3c000)
    3326                    $C$DW$281       .dwtag  DW_TAG_subrange_type
    3327                            .dwattr $C$DW$281, DW_AT_upper_bound(0x1d)
    3328                    $C$DW$282       .dwtag  DW_TAG_subrange_type
    3329                            .dwattr $C$DW$282, DW_AT_upper_bound(0x7ff)
    3330                            .dwendtag $C$DW$T$38
    3331                    
    3332                    
    3333                    $C$DW$T$39      .dwtag  DW_TAG_array_type
    3334                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$32)
    3335                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3336                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x1000)
    3337                    $C$DW$283       .dwtag  DW_TAG_subrange_type
    3338                            .dwattr $C$DW$283, DW_AT_upper_bound(0x3ff)
    3339                            .dwendtag $C$DW$T$39
    3340                    
    3341                    
    3342                    $C$DW$T$40      .dwtag  DW_TAG_array_type
    3343                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$32)
    3344                            .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    3345                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x1e000)
    3346                    $C$DW$284       .dwtag  DW_TAG_subrange_type
    3347                            .dwattr $C$DW$284, DW_AT_upper_bound(0x1d)
    3348                    $C$DW$285       .dwtag  DW_TAG_subrange_type
    3349                            .dwattr $C$DW$285, DW_AT_upper_bound(0x3ff)
    3350                            .dwendtag $C$DW$T$40
    3351                    
    3352                    
    3353                    $C$DW$T$42      .dwtag  DW_TAG_array_type
    3354                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$32)
    3355                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3356                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x1e0)
    3357                    $C$DW$286       .dwtag  DW_TAG_subrange_type
    3358                            .dwattr $C$DW$286, DW_AT_upper_bound(0x77)
    3359                            .dwendtag $C$DW$T$42
    3360                    
    3361                    
    3362                    $C$DW$T$43      .dwtag  DW_TAG_array_type
    3363                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$32)
    3364                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    3365                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x40)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:13:05 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   70

    3366                    $C$DW$287       .dwtag  DW_TAG_subrange_type
    3367                            .dwattr $C$DW$287, DW_AT_upper_bound(0x0f)
    3368                            .dwendtag $C$DW$T$43
    3369                    
    3370                    
    3371                    $C$DW$T$59      .dwtag  DW_TAG_array_type
    3372                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$32)
    3373                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    3374                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x10)
    3375                    $C$DW$288       .dwtag  DW_TAG_subrange_type
    3376                            .dwattr $C$DW$288, DW_AT_upper_bound(0x03)
    3377                            .dwendtag $C$DW$T$59
    3378                    
    3379                    $C$DW$T$117     .dwtag  DW_TAG_pointer_type
    3380                            .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$32)
    3381                            .dwattr $C$DW$T$117, DW_AT_address_class(0x20)
    3382                    $C$DW$T$154     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    3383                            .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$32)
    3384                            .dwattr $C$DW$T$154, DW_AT_language(DW_LANG_C)
    3385                            .dwattr $C$DW$T$154, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3386                            .dwattr $C$DW$T$154, DW_AT_decl_line(0x4b)
    3387                            .dwattr $C$DW$T$154, DW_AT_decl_column(0x17)
    3388                    $C$DW$T$155     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    3389                            .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$32)
    3390                            .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    3391                            .dwattr $C$DW$T$155, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3392                            .dwattr $C$DW$T$155, DW_AT_decl_line(0x4e)
    3393                            .dwattr $C$DW$T$155, DW_AT_decl_column(0x17)
    3394                    $C$DW$T$156     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    3395                            .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$32)
    3396                            .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    3397                            .dwattr $C$DW$T$156, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3398                            .dwattr $C$DW$T$156, DW_AT_decl_line(0x49)
    3399                            .dwattr $C$DW$T$156, DW_AT_decl_column(0x17)
    3400                    $C$DW$T$157     .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    3401                            .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$32)
    3402                            .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
    3403                            .dwattr $C$DW$T$157, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3404                            .dwattr $C$DW$T$157, DW_AT_decl_line(0x3e)
    3405                            .dwattr $C$DW$T$157, DW_AT_decl_column(0x17)
    3406                    $C$DW$T$158     .dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
    3407                            .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$10)
    3408                            .dwattr $C$DW$T$158, DW_AT_language(DW_LANG_C)
    3409                            .dwattr $C$DW$T$158, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3410                            .dwattr $C$DW$T$158, DW_AT_decl_line(0x58)
    3411                            .dwattr $C$DW$T$158, DW_AT_decl_column(0x1a)
    3412                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    3413                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3414                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    3415                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    3416                    $C$DW$T$160     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_VAL")
    3417                            .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$11)
    3418                            .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
    3419                            .dwattr $C$DW$T$160, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\co
    3420                            .dwattr $C$DW$T$160, DW_AT_decl_line(0x5d)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:13:05 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   71

    3421                            .dwattr $C$DW$T$160, DW_AT_decl_column(0x17)
    3422                    $C$DW$T$172     .dwtag  DW_TAG_typedef, DW_AT_name("clock_t")
    3423                            .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$11)
    3424                            .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
    3425                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3426                            .dwattr $C$DW$T$172, DW_AT_decl_line(0x37)
    3427                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x16)
    3428                    $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    3429                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$11)
    3430                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    3431                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
