TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_idat.se66 PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v7.4.2 *
       3                    ;* Date/Time created: Sat Sep 26 11:12:06 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --c64p_l1d_workaround=off --endian=little --hll_source=on --long_pre
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C66xx                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *
      12                    ;*   Optimizing for    : Speed                                                *

    3833                            .dwattr $C$DW$23, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66/
    3834                            .dwattr $C$DW$23, DW_AT_decl_line(0x87)
    3835                            .dwattr $C$DW$23, DW_AT_decl_column(0x05)
    3836                    $C$DW$24        .dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_ERR_NOT_IMPLEMENTED"), DW_AT_const_value(0
    3837                            .dwattr $C$DW$24, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66/
    3838                            .dwattr $C$DW$24, DW_AT_decl_line(0x88)
    3839                            .dwattr $C$DW$24, DW_AT_decl_column(0x05)
    3840                    $C$DW$25        .dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_ERROR_MAX"), DW_AT_const_value(0x0f)
    3841                            .dwattr $C$DW$25, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66/
    3842                            .dwattr $C$DW$25, DW_AT_decl_line(0x89)
    3843                            .dwattr $C$DW$25, DW_AT_decl_column(0x05)
    3844                            .dwendtag $C$DW$T$38
    3845                    
    3846                            .dwattr $C$DW$T$38, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c6
    3847                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x79)
    3848                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0e)
    3849                    $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_STATUS")
    3850                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    3851                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3852                            .dwattr $C$DW$T$39, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c6
    3853                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x8a)
    3854                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x03)
    3855                    
    3856                    $C$DW$T$40      .dwtag  DW_TAG_enumeration_type
    3857                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    3858                    $C$DW$26        .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_OPT"), DW_AT_const_value(0x00)
    3859                            .dwattr $C$DW$26, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\VLIB
    3860                            .dwattr $C$DW$26, DW_AT_decl_line(0x6a)
    3861                            .dwattr $C$DW$26, DW_AT_decl_column(0x05)
    3862                    $C$DW$27        .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_CN"), DW_AT_const_value(0x01)
    3863                            .dwattr $C$DW$27, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\VLIB
    3864                            .dwattr $C$DW$27, DW_AT_decl_line(0x6b)
    3865                            .dwattr $C$DW$27, DW_AT_decl_column(0x05)
    3866                    $C$DW$28        .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_CNT"), DW_AT_const_value(0x02)
    3867                            .dwattr $C$DW$28, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\VLIB
    3868                            .dwattr $C$DW$28, DW_AT_decl_line(0x6c)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_idat.se66 PAGE   83

    3869                            .dwattr $C$DW$28, DW_AT_decl_column(0x05)
    3870                            .dwendtag $C$DW$T$40
    3871                    
    3872                            .dwattr $C$DW$T$40, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\VL
    3873                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x69)
    3874                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x06)
    3875                    
    3876                    $C$DW$T$41      .dwtag  DW_TAG_enumeration_type
    3877                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    3878                    $C$DW$29        .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_FAIL"), DW_AT_const_value(0x00)
    3879                            .dwattr $C$DW$29, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\VLIB
    3880                            .dwattr $C$DW$29, DW_AT_decl_line(0x72)
    3881                            .dwattr $C$DW$29, DW_AT_decl_column(0x05)
    3882                    $C$DW$30        .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_PASS"), DW_AT_const_value(0x01)
    3883                            .dwattr $C$DW$30, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\VLIB
    3884                            .dwattr $C$DW$30, DW_AT_decl_line(0x73)
    3885                            .dwattr $C$DW$30, DW_AT_decl_column(0x05)
    3886                            .dwendtag $C$DW$T$41
    3887                    
    3888                            .dwattr $C$DW$T$41, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\VL
    3889                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x71)
    3890                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x06)
    3891                    
    3892                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3893                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x38)
    3894                    $C$DW$31        .dwtag  DW_TAG_member
    3895                            .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
    3896                            .dwattr $C$DW$31, DW_AT_name("testPattern")
    3897                            .dwattr $C$DW$31, DW_AT_TI_symbol_name("testPattern")
    3898                            .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3899                            .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
    3900                            .dwattr $C$DW$31, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTemp
    3901                            .dwattr $C$DW$31, DW_AT_decl_line(0x24)
    3902                            .dwattr $C$DW$31, DW_AT_decl_column(0x0f)
    3903                    $C$DW$32        .dwtag  DW_TAG_member
    3904                            .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$20)
    3905                            .dwattr $C$DW$32, DW_AT_name("orgImg")
    3906                            .dwattr $C$DW$32, DW_AT_TI_symbol_name("orgImg")
    3907                            .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3908                            .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
    3909                            .dwattr $C$DW$32, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTemp
    3910                            .dwattr $C$DW$32, DW_AT_decl_line(0x25)
    3911                            .dwattr $C$DW$32, DW_AT_decl_column(0x0f)
    3912                    $C$DW$33        .dwtag  DW_TAG_member
    3913                            .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$21)
    3914                            .dwattr $C$DW$33, DW_AT_name("orgImgWidth")
    3915                            .dwattr $C$DW$33, DW_AT_TI_symbol_name("orgImgWidth")
    3916                            .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3917                            .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
    3918                            .dwattr $C$DW$33, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTemp
    3919                            .dwattr $C$DW$33, DW_AT_decl_line(0x26)
    3920                            .dwattr $C$DW$33, DW_AT_decl_column(0x0f)
    3921                    $C$DW$34        .dwtag  DW_TAG_member
    3922                            .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$21)
    3923                            .dwattr $C$DW$34, DW_AT_name("orgImgHeight")
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_idat.se66 PAGE   84

    3924                            .dwattr $C$DW$34, DW_AT_TI_symbol_name("orgImgHeight")
    3925                            .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3926                            .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
    3927                            .dwattr $C$DW$34, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTemp
    3928                            .dwattr $C$DW$34, DW_AT_decl_line(0x27)
    3929                            .dwattr $C$DW$34, DW_AT_decl_column(0x0f)
    3930                    $C$DW$35        .dwtag  DW_TAG_member
    3931                            .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$21)
    3932                            .dwattr $C$DW$35, DW_AT_name("orgImgPitch")
    3933                            .dwattr $C$DW$35, DW_AT_TI_symbol_name("orgImgPitch")
    3934                            .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3935                            .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
    3936                            .dwattr $C$DW$35, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTemp
    3937                            .dwattr $C$DW$35, DW_AT_decl_line(0x28)
    3938                            .dwattr $C$DW$35, DW_AT_decl_column(0x0f)
    3939                    $C$DW$36        .dwtag  DW_TAG_member
    3940                            .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$20)
    3941                            .dwattr $C$DW$36, DW_AT_name("tempImg")
    3942                            .dwattr $C$DW$36, DW_AT_TI_symbol_name("tempImg")
    3943                            .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3944                            .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
    3945                            .dwattr $C$DW$36, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTemp
    3946                            .dwattr $C$DW$36, DW_AT_decl_line(0x29)
    3947                            .dwattr $C$DW$36, DW_AT_decl_column(0x0f)
    3948                    $C$DW$37        .dwtag  DW_TAG_member
    3949                            .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$21)
    3950                            .dwattr $C$DW$37, DW_AT_name("tempImgWidth")
    3951                            .dwattr $C$DW$37, DW_AT_TI_symbol_name("tempImgWidth")
    3952                            .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3953                            .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
    3954                            .dwattr $C$DW$37, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTemp
    3955                            .dwattr $C$DW$37, DW_AT_decl_line(0x2a)
    3956                            .dwattr $C$DW$37, DW_AT_decl_column(0x0f)
    3957                    $C$DW$38        .dwtag  DW_TAG_member
    3958                            .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$21)
    3959                            .dwattr $C$DW$38, DW_AT_name("tempImgHeight")
    3960                            .dwattr $C$DW$38, DW_AT_TI_symbol_name("tempImgHeight")
    3961                            .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3962                            .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
    3963                            .dwattr $C$DW$38, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTemp
    3964                            .dwattr $C$DW$38, DW_AT_decl_line(0x2b)
    3965                            .dwattr $C$DW$38, DW_AT_decl_column(0x0f)
    3966                    $C$DW$39        .dwtag  DW_TAG_member
    3967                            .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$21)
    3968                            .dwattr $C$DW$39, DW_AT_name("tempImgPitch")
    3969                            .dwattr $C$DW$39, DW_AT_TI_symbol_name("tempImgPitch")
    3970                            .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3971                            .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
    3972                            .dwattr $C$DW$39, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTemp
    3973                            .dwattr $C$DW$39, DW_AT_decl_line(0x2c)
    3974                            .dwattr $C$DW$39, DW_AT_decl_column(0x0f)
    3975                    $C$DW$40        .dwtag  DW_TAG_member
    3976                            .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
    3977                            .dwattr $C$DW$40, DW_AT_name("xDirJump")
    3978                            .dwattr $C$DW$40, DW_AT_TI_symbol_name("xDirJump")
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_idat.se66 PAGE   85

    3979                            .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3980                            .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
    3981                            .dwattr $C$DW$40, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTemp
    3982                            .dwattr $C$DW$40, DW_AT_decl_line(0x2d)
    3983                            .dwattr $C$DW$40, DW_AT_decl_column(0x0f)
    3984                    $C$DW$41        .dwtag  DW_TAG_member
    3985                            .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
    3986                            .dwattr $C$DW$41, DW_AT_name("yDirJump")
    3987                            .dwattr $C$DW$41, DW_AT_TI_symbol_name("yDirJump")
    3988                            .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    3989                            .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
    3990                            .dwattr $C$DW$41, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTemp
    3991                            .dwattr $C$DW$41, DW_AT_decl_line(0x2e)
    3992                            .dwattr $C$DW$41, DW_AT_decl_column(0x0f)
    3993                    $C$DW$42        .dwtag  DW_TAG_member
    3994                            .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$21)
    3995                            .dwattr $C$DW$42, DW_AT_name("outScorePitch")
    3996                            .dwattr $C$DW$42, DW_AT_TI_symbol_name("outScorePitch")
    3997                            .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3998                            .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
    3999                            .dwattr $C$DW$42, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTemp
    4000                            .dwattr $C$DW$42, DW_AT_decl_line(0x2f)
    4001                            .dwattr $C$DW$42, DW_AT_decl_column(0x0f)
    4002                    $C$DW$43        .dwtag  DW_TAG_member
    4003                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$21)
    4004                            .dwattr $C$DW$43, DW_AT_name("method")
    4005                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("method")
    4006                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4007                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
    4008                            .dwattr $C$DW$43, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTemp
    4009                            .dwattr $C$DW$43, DW_AT_decl_line(0x30)
    4010                            .dwattr $C$DW$43, DW_AT_decl_column(0x0f)
    4011                    $C$DW$44        .dwtag  DW_TAG_member
    4012                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$23)
    4013                            .dwattr $C$DW$44, DW_AT_name("outScore")
    4014                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("outScore")
    4015                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4016                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
    4017                            .dwattr $C$DW$44, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTemp
    4018                            .dwattr $C$DW$44, DW_AT_decl_line(0x31)
    4019                            .dwattr $C$DW$44, DW_AT_decl_column(0x0f)
    4020                    $C$DW$45        .dwtag  DW_TAG_member
    4021                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$25)
    4022                            .dwattr $C$DW$45, DW_AT_name("desc")
    4023                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("desc")
    4024                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4025                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    4026                            .dwattr $C$DW$45, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTemp
    4027                            .dwattr $C$DW$45, DW_AT_decl_line(0x32)
    4028                            .dwattr $C$DW$45, DW_AT_decl_column(0x0f)
    4029                            .dwendtag $C$DW$T$26
    4030                    
    4031                            .dwattr $C$DW$T$26, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTe
    4032                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x23)
    4033                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_idat.se66 PAGE   86

    4034                    $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("matchTemplate_testParams_t")
    4035                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$26)
    4036                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    4037                            .dwattr $C$DW$T$46, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTe
    4038                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x33)
    4039                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x03)
    4040                    $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    4041                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    4042                            .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    4043                    $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    4044                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    4045                            .dwattr $C$DW$T$48, DW_AT_address_class(0x20)
    4046                    $C$DW$T$49      .dwtag  DW_TAG_const_type
    4047                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    4048                    
    4049                    $C$DW$T$50      .dwtag  DW_TAG_array_type
    4050                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$46)
    4051                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    4052                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x460)
    4053                    $C$DW$46        .dwtag  DW_TAG_subrange_type
    4054                            .dwattr $C$DW$46, DW_AT_upper_bound(0x13)
    4055                            .dwendtag $C$DW$T$50
    4056                    
    4057                    
    4058                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4059                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x18)
    4060                    $C$DW$47        .dwtag  DW_TAG_member
    4061                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$10)
    4062                            .dwattr $C$DW$47, DW_AT_name("fd")
    4063                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("fd")
    4064                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4065                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    4066                            .dwattr $C$DW$47, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    4067                            .dwattr $C$DW$47, DW_AT_decl_line(0x49)
    4068                            .dwattr $C$DW$47, DW_AT_decl_column(0x0b)
    4069                    $C$DW$48        .dwtag  DW_TAG_member
    4070                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$27)
    4071                            .dwattr $C$DW$48, DW_AT_name("buf")
    4072                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("buf")
    4073                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4074                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    4075                            .dwattr $C$DW$48, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    4076                            .dwattr $C$DW$48, DW_AT_decl_line(0x4a)
    4077                            .dwattr $C$DW$48, DW_AT_decl_column(0x16)
    4078                    $C$DW$49        .dwtag  DW_TAG_member
    4079                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$27)
    4080                            .dwattr $C$DW$49, DW_AT_name("pos")
    4081                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("pos")
    4082                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4083                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    4084                            .dwattr $C$DW$49, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    4085                            .dwattr $C$DW$49, DW_AT_decl_line(0x4b)
    4086                            .dwattr $C$DW$49, DW_AT_decl_column(0x16)
    4087                    $C$DW$50        .dwtag  DW_TAG_member
    4088                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$27)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_idat.se66 PAGE   87

    4089                            .dwattr $C$DW$50, DW_AT_name("bufend")
    4090                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("bufend")
    4091                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4092                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    4093                            .dwattr $C$DW$50, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    4094                            .dwattr $C$DW$50, DW_AT_decl_line(0x4c)
    4095                            .dwattr $C$DW$50, DW_AT_decl_column(0x16)
    4096                    $C$DW$51        .dwtag  DW_TAG_member
    4097                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$27)
    4098                            .dwattr $C$DW$51, DW_AT_name("buff_stop")
    4099                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("buff_stop")
    4100                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4101                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    4102                            .dwattr $C$DW$51, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    4103                            .dwattr $C$DW$51, DW_AT_decl_line(0x4d)
    4104                            .dwattr $C$DW$51, DW_AT_decl_column(0x16)
    4105                    $C$DW$52        .dwtag  DW_TAG_member
    4106                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$11)
    4107                            .dwattr $C$DW$52, DW_AT_name("flags")
    4108                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("flags")
    4109                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4110                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    4111                            .dwattr $C$DW$52, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    4112                            .dwattr $C$DW$52, DW_AT_decl_line(0x4e)
    4113                            .dwattr $C$DW$52, DW_AT_decl_column(0x16)
    4114                            .dwendtag $C$DW$T$28
    4115                    
    4116                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4117                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x48)
    4118                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    4119                    $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    4120                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$28)
    4121                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    4122                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4123                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x4f)
    4124                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
    4125                    
    4126                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4127                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    4128                    $C$DW$53        .dwtag  DW_TAG_member
    4129                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$10)
    4130                            .dwattr $C$DW$53, DW_AT_name("quot")
    4131                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("quot")
    4132                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4133                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    4134                            .dwattr $C$DW$53, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    4135                            .dwattr $C$DW$53, DW_AT_decl_line(0x3e)
    4136                            .dwattr $C$DW$53, DW_AT_decl_column(0x16)
    4137                    $C$DW$54        .dwtag  DW_TAG_member
    4138                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$10)
    4139                            .dwattr $C$DW$54, DW_AT_name("rem")
    4140                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("rem")
    4141                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4142                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    4143                            .dwattr $C$DW$54, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_idat.se66 PAGE   88

    4144                            .dwattr $C$DW$54, DW_AT_decl_line(0x3e)
    4145                            .dwattr $C$DW$54, DW_AT_decl_column(0x1c)
    4146                            .dwendtag $C$DW$T$29
    4147                    
    4148                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4149                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x3e)
    4150                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    4151                    $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    4152                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$29)
    4153                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    4154                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4155                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x3e)
    4156                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x23)
    4157                    
    4158                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    4159                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
    4160                    $C$DW$55        .dwtag  DW_TAG_member
    4161                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$10)
    4162                            .dwattr $C$DW$55, DW_AT_name("quot")
    4163                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("quot")
    4164                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4165                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    4166                            .dwattr $C$DW$55, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    4167                            .dwattr $C$DW$55, DW_AT_decl_line(0x40)
    4168                            .dwattr $C$DW$55, DW_AT_decl_column(0x17)
    4169                    $C$DW$56        .dwtag  DW_TAG_member
    4170                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$10)
    4171                            .dwattr $C$DW$56, DW_AT_name("rem")
    4172                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("rem")
    4173                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4174                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    4175                            .dwattr $C$DW$56, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    4176                            .dwattr $C$DW$56, DW_AT_decl_line(0x40)
    4177                            .dwattr $C$DW$56, DW_AT_decl_column(0x1d)
    4178                            .dwendtag $C$DW$T$30
    4179                    
    4180                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4181                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x40)
    4182                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    4183                    $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    4184                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$30)
    4185                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    4186                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4187                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x40)
    4188                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x24)
    4189                    
    4190                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4191                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x10)
    4192                    $C$DW$57        .dwtag  DW_TAG_member
    4193                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$14)
    4194                            .dwattr $C$DW$57, DW_AT_name("quot")
    4195                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("quot")
    4196                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4197                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    4198                            .dwattr $C$DW$57, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_idat.se66 PAGE   89

    4199                            .dwattr $C$DW$57, DW_AT_decl_line(0x43)
    4200                            .dwattr $C$DW$57, DW_AT_decl_column(0x1c)
    4201                    $C$DW$58        .dwtag  DW_TAG_member
    4202                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$14)
    4203                            .dwattr $C$DW$58, DW_AT_name("rem")
    4204                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("rem")
    4205                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4206                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    4207                            .dwattr $C$DW$58, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    4208                            .dwattr $C$DW$58, DW_AT_decl_line(0x43)
    4209                            .dwattr $C$DW$58, DW_AT_decl_column(0x22)
    4210                            .dwendtag $C$DW$T$31
    4211                    
    4212                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4213                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x43)
    4214                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    4215                    $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    4216                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$31)
    4217                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    4218                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4219                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x43)
    4220                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x29)
    4221                    
    4222                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4223                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x24)
    4224                    $C$DW$59        .dwtag  DW_TAG_member
    4225                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$21)
    4226                            .dwattr $C$DW$59, DW_AT_name("area")
    4227                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("area")
    4228                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4229                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    4230                            .dwattr $C$DW$59, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66/
    4231                            .dwattr $C$DW$59, DW_AT_decl_line(0x69)
    4232                            .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
    4233                    $C$DW$60        .dwtag  DW_TAG_member
    4234                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$21)
    4235                            .dwattr $C$DW$60, DW_AT_name("xsum")
    4236                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("xsum")
    4237                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4238                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    4239                            .dwattr $C$DW$60, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66/
    4240                            .dwattr $C$DW$60, DW_AT_decl_line(0x6a)
    4241                            .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
    4242                    $C$DW$61        .dwtag  DW_TAG_member
    4243                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$21)
    4244                            .dwattr $C$DW$61, DW_AT_name("ysum")
    4245                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("ysum")
    4246                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4247                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    4248                            .dwattr $C$DW$61, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66/
    4249                            .dwattr $C$DW$61, DW_AT_decl_line(0x6b)
    4250                            .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
    4251                    $C$DW$62        .dwtag  DW_TAG_member
    4252                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$21)
    4253                            .dwattr $C$DW$62, DW_AT_name("xmin")
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_idat.se66 PAGE   90

    4254                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("xmin")
    4255                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4256                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    4257                            .dwattr $C$DW$62, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66/
    4258                            .dwattr $C$DW$62, DW_AT_decl_line(0x6d)
    4259                            .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
    4260                    $C$DW$63        .dwtag  DW_TAG_member
    4261                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$21)
    4262                            .dwattr $C$DW$63, DW_AT_name("ymin")
    4263                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("ymin")
    4264                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4265                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    4266                            .dwattr $C$DW$63, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66/
    4267                            .dwattr $C$DW$63, DW_AT_decl_line(0x6e)
    4268                            .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
    4269                    $C$DW$64        .dwtag  DW_TAG_member
    4270                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$21)
    4271                            .dwattr $C$DW$64, DW_AT_name("xmax")
    4272                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("xmax")
    4273                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4274                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    4275                            .dwattr $C$DW$64, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66/
    4276                            .dwattr $C$DW$64, DW_AT_decl_line(0x6f)
    4277                            .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
    4278                    $C$DW$65        .dwtag  DW_TAG_member
    4279                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$21)
    4280                            .dwattr $C$DW$65, DW_AT_name("ymax")
    4281                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("ymax")
    4282                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4283                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    4284                            .dwattr $C$DW$65, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66/
    4285                            .dwattr $C$DW$65, DW_AT_decl_line(0x70)
    4286                            .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
    4287                    $C$DW$66        .dwtag  DW_TAG_member
    4288                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$21)
    4289                            .dwattr $C$DW$66, DW_AT_name("seedx")
    4290                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("seedx")
    4291                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4292                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    4293                            .dwattr $C$DW$66, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66/
    4294                            .dwattr $C$DW$66, DW_AT_decl_line(0x72)
    4295                            .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
    4296                    $C$DW$67        .dwtag  DW_TAG_member
    4297                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$21)
    4298                            .dwattr $C$DW$67, DW_AT_name("seedy")
    4299                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("seedy")
    4300                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4301                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    4302                            .dwattr $C$DW$67, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66/
    4303                            .dwattr $C$DW$67, DW_AT_decl_line(0x73)
    4304                            .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
    4305                            .dwendtag $C$DW$T$32
    4306                    
    4307                            .dwattr $C$DW$T$32, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c6
    4308                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x68)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_idat.se66 PAGE   91

    4309                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    4310                    $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CC")
    4311                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$32)
    4312                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    4313                            .dwattr $C$DW$T$55, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c6
    4314                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x75)
    4315                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x03)
    4316                    
    4317                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    4318                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    4319                    $C$DW$68        .dwtag  DW_TAG_member
    4320                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$8)
    4321                            .dwattr $C$DW$68, DW_AT_name("daylight")
    4322                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("daylight")
    4323                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4324                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    4325                            .dwattr $C$DW$68, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    4326                            .dwattr $C$DW$68, DW_AT_decl_line(0x52)
    4327                            .dwattr $C$DW$68, DW_AT_decl_column(0x0b)
    4328                    $C$DW$69        .dwtag  DW_TAG_member
    4329                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$10)
    4330                            .dwattr $C$DW$69, DW_AT_name("timezone")
    4331                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("timezone")
    4332                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4333                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    4334                            .dwattr $C$DW$69, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    4335                            .dwattr $C$DW$69, DW_AT_decl_line(0x53)
    4336                            .dwattr $C$DW$69, DW_AT_decl_column(0x0b)
    4337                    $C$DW$70        .dwtag  DW_TAG_member
    4338                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$33)
    4339                            .dwattr $C$DW$70, DW_AT_name("tzname")
    4340                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("tzname")
    4341                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4342                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    4343                            .dwattr $C$DW$70, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    4344                            .dwattr $C$DW$70, DW_AT_decl_line(0x54)
    4345                            .dwattr $C$DW$70, DW_AT_decl_column(0x0b)
    4346                    $C$DW$71        .dwtag  DW_TAG_member
    4347                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$33)
    4348                            .dwattr $C$DW$71, DW_AT_name("dstname")
    4349                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("dstname")
    4350                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4351                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    4352                            .dwattr $C$DW$71, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    4353                            .dwattr $C$DW$71, DW_AT_decl_line(0x55)
    4354                            .dwattr $C$DW$71, DW_AT_decl_column(0x0b)
    4355                            .dwendtag $C$DW$T$34
    4356                    
    4357                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4358                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x51)
    4359                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x01)
    4360                    $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("TZ")
    4361                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$34)
    4362                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    4363                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_idat.se66 PAGE   92

    4364                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x56)
    4365                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x03)
    4366                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    4367                            .dwattr $C$DW$T$2, DW_AT_name("void")
    4368                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4369                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    4370                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    4371                    $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_PTR")
    4372                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$3)
    4373                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    4374                            .dwattr $C$DW$T$57, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c6
    4375                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x5c)
    4376                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x19)
    4377                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    4378                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4379                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    4380                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4381                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    4382                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4383                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4384                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4385                    $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    4386                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$5)
    4387                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    4388                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4389                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x2a)
    4390                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x1d)
    4391                    $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    4392                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    4393                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    4394                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4395                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x39)
    4396                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x17)
    4397                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    4398                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4399                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4400                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4401                    $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    4402                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$6)
    4403                            .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    4404                    $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    4405                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
    4406                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    4407                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4408                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x2b)
    4409                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
    4410                    $C$DW$T$20      .dwtag  DW_TAG_pointer_type
    4411                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    4412                            .dwattr $C$DW$T$20, DW_AT_address_class(0x20)
    4413                    
    4414                    $C$DW$T$62      .dwtag  DW_TAG_array_type
    4415                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$19)
    4416                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    4417                            .dwattr $C$DW$T$62, DW_AT_byte_size(0xa80)
    4418                    $C$DW$72        .dwtag  DW_TAG_subrange_type
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_idat.se66 PAGE   93

    4419                            .dwattr $C$DW$72, DW_AT_upper_bound(0xa7f)
    4420                            .dwendtag $C$DW$T$62
    4421                    
    4422                    
    4423                    $C$DW$T$63      .dwtag  DW_TAG_array_type
    4424                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$19)
    4425                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    4426                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x240)
    4427                    $C$DW$73        .dwtag  DW_TAG_subrange_type
    4428                            .dwattr $C$DW$73, DW_AT_upper_bound(0x23f)
    4429                            .dwendtag $C$DW$T$63
    4430                    
    4431                    $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    4432                            .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$19)
    4433                            .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    4434                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4435                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x3a)
    4436                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x16)
    4437                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    4438                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4439                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4440                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    4441                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    4442                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4443                            .dwattr $C$DW$T$8, DW_AT_name("short")
    4444                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    4445                    $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    4446                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$8)
    4447                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    4448                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4449                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x2c)
    4450                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x1d)
    4451                    $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    4452                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    4453                            .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    4454                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4455                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x3c)
    4456                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x17)
    4457                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    4458                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4459                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4460                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    4461                    $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    4462                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$9)
    4463                            .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    4464                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4465                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x2d)
    4466                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x1c)
    4467                    $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    4468                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    4469                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    4470                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4471                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x3d)
    4472                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x16)
    4473                    $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_idat.se66 PAGE   94

    4474                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$9)
    4475                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    4476                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4477                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x53)
    4478                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x1a)
    4479                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    4480                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    4481                            .dwattr $C$DW$T$10, DW_AT_name("int")
    4482                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    4483                    $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
    4484                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$10)
    4485                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    4486                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4487                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x53)
    4488                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x0d)
    4489                    $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    4490                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$10)
    4491                            .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    4492                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4493                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x2e)
    4494                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x1d)
    4495                    $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CCHandle")
    4496                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$21)
    4497                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    4498                            .dwattr $C$DW$T$72, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c6
    4499                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x77)
    4500                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x11)
    4501                    
    4502                    $C$DW$T$35      .dwtag  DW_TAG_array_type
    4503                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$21)
    4504                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4505                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x10)
    4506                    $C$DW$74        .dwtag  DW_TAG_subrange_type
    4507                            .dwattr $C$DW$74, DW_AT_upper_bound(0x03)
    4508                            .dwendtag $C$DW$T$35
    4509                    
    4510                    $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    4511                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$21)
    4512                            .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
    4513                    $C$DW$T$73      .dwtag  DW_TAG_const_type
    4514                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$58)
    4515                    $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    4516                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$21)
    4517                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    4518                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4519                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x4b)
    4520                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x17)
    4521                    $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    4522                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$21)
    4523                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    4524                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4525                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x4e)
    4526                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x17)
    4527                    $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    4528                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$21)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_idat.se66 PAGE   95

    4529                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    4530                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4531                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x49)
    4532                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x17)
    4533                    $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    4534                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$21)
    4535                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    4536                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4537                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x3e)
    4538                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x17)
    4539                    $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
    4540                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$10)
    4541                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    4542                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4543                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x58)
    4544                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x1a)
    4545                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    4546                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    4547                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    4548                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    4549                    $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_VAL")
    4550                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$11)
    4551                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    4552                            .dwattr $C$DW$T$80, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c6
    4553                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x5d)
    4554                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x17)
    4555                    $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("clock_t")
    4556                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$11)
    4557                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    4558                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4559                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x37)
    4560                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x16)
    4561                    $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    4562                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$11)
    4563                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    4564                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4565                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x45)
    4566                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x19)
    4567                    $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("time_t")
    4568                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$11)
    4569                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    4570                            .dwattr $C$DW$T$81, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4571                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x38)
    4572                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x16)
    4573                    $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    4574                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$11)
    4575                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    4576                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4577                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x2f)
    4578                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x1c)
    4579                    $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast16_t")
    4580                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    4581                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    4582                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4583                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x4c)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_idat.se66 PAGE   96

    4584                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x16)
    4585                    $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast32_t")
    4586                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$82)
    4587                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    4588                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4589                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x4f)
    4590                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x16)
    4591                    $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast8_t")
    4592                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$82)
    4593                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    4594                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4595                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x4a)
    4596                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x16)
    4597                    $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least32_t")
    4598                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$82)
    4599                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    4600                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4601                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x3f)
    4602                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x16)
    4603                    $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("uintptr_t")
    4604                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$11)
    4605                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    4606                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4607                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x59)
    4608                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x1a)
    4609                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    4610                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    4611                            .dwattr $C$DW$T$12, DW_AT_name("__int40_t")
    4612                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x08)
    4613                            .dwattr $C$DW$T$12, DW_AT_bit_size(0x28)
    4614                            .dwattr $C$DW$T$12, DW_AT_bit_offset(0x18)
    4615                    $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("int40_t")
    4616                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$12)
    4617                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    4618                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4619                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x31)
    4620                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x21)
    4621                    $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast40_t")
    4622                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    4623                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    4624                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4625                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x51)
    4626                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x17)
    4627                    $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("int_least40_t")
    4628                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$90)
    4629                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    4630                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4631                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x41)
    4632                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x17)
    4633                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    4634                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    4635                            .dwattr $C$DW$T$13, DW_AT_name("unsigned __int40_t")
    4636                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x08)
    4637                            .dwattr $C$DW$T$13, DW_AT_bit_size(0x28)
    4638                            .dwattr $C$DW$T$13, DW_AT_bit_offset(0x18)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_idat.se66 PAGE   97

    4639                    $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("uint40_t")
    4640                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$13)
    4641                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    4642                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4643                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x32)
    4644                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x20)
    4645                    $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast40_t")
    4646                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    4647                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    4648                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4649                            .dwattr $C$DW$T$94, DW_AT_decl_line(0x52)
    4650                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x16)
    4651                    $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least40_t")
    4652                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$93)
    4653                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    4654                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4655                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x42)
    4656                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x16)
    4657                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    4658                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    4659                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    4660                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    4661                    $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("int64_t")
    4662                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$14)
    4663                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    4664                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4665                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x34)
    4666                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x21)
    4667                    $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast64_t")
    4668                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    4669                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    4670                            .dwattr $C$DW$T$97, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4671                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x54)
    4672                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x17)
    4673                    $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("int_least64_t")
    4674                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$96)
    4675                            .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    4676                            .dwattr $C$DW$T$98, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4677                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x44)
    4678                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x17)
    4679                    $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("intmax_t")
    4680                            .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$14)
    4681                            .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    4682                            .dwattr $C$DW$T$99, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4683                            .dwattr $C$DW$T$99, DW_AT_decl_line(0x5c)
    4684                            .dwattr $C$DW$T$99, DW_AT_decl_column(0x20)
    4685                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    4686                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    4687                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    4688                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    4689                    $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("uint64_t")
    4690                            .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$15)
    4691                            .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    4692                            .dwattr $C$DW$T$100, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4693                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x35)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_idat.se66 PAGE   98

    4694                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x20)
    4695                    $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast64_t")
    4696                            .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
    4697                            .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    4698                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4699                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x55)
    4700                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x16)
    4701                    $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least64_t")
    4702                            .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$100)
    4703                            .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    4704                            .dwattr $C$DW$T$102, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4705                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x45)
    4706                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x16)
    4707                    $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("uintmax_t")
    4708                            .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$15)
    4709                            .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    4710                            .dwattr $C$DW$T$103, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4711                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x5d)
    4712                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x20)
    4713                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    4714                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    4715                            .dwattr $C$DW$T$16, DW_AT_name("float")
    4716                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    4717                    $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_F32")
    4718                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$16)
    4719                            .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    4720                            .dwattr $C$DW$T$22, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c6
    4721                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x5b)
    4722                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x0f)
    4723                    $C$DW$T$23      .dwtag  DW_TAG_pointer_type
    4724                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    4725                            .dwattr $C$DW$T$23, DW_AT_address_class(0x20)
    4726                    $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("float32_t")
    4727                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$16)
    4728                            .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    4729                            .dwattr $C$DW$T$104, DW_AT_decl_file("C:\VLIB_Tools\CCSV5_4_0\ccsv5\tools\compiler\C6000\inclu
    4730                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x30)
    4731                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x0f)
    4732                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    4733                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    4734                            .dwattr $C$DW$T$17, DW_AT_name("double")
    4735                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    4736                    $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_D64")
    4737                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$17)
    4738                            .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    4739                            .dwattr $C$DW$T$105, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c
    4740                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x5a)
    4741                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x10)
    4742                    $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("__float2_t")
    4743                            .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$17)
    4744                            .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    4745                            .dwattr $C$DW$T$106, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4746                            .dwattr $C$DW$T$106, DW_AT_decl_line(0x5f)
    4747                            .dwattr $C$DW$T$106, DW_AT_decl_column(0x14)
    4748                    $C$DW$T$18      .dwtag  DW_TAG_base_type
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_idat.se66 PAGE   99

    4749                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    4750                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    4751                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    4752                    $C$DW$T$24      .dwtag  DW_TAG_base_type
    4753                            .dwattr $C$DW$T$24, DW_AT_encoding(DW_ATE_signed_char)
    4754                            .dwattr $C$DW$T$24, DW_AT_name("signed char")
    4755                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    4756                    $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    4757                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    4758                            .dwattr $C$DW$T$25, DW_AT_address_class(0x20)
    4759                    $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("va_list")
    4760                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$25)
    4761                            .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    4762                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4763                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x2f)
    4764                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x12)
    4765                    
    4766                    $C$DW$T$33      .dwtag  DW_TAG_array_type
    4767                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$24)
    4768                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4769                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x04)
    4770                    $C$DW$75        .dwtag  DW_TAG_subrange_type
    4771                            .dwattr $C$DW$75, DW_AT_upper_bound(0x03)
    4772                            .dwendtag $C$DW$T$33
    4773                    
    4774                    
    4775                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4776                            .dwattr $C$DW$T$36, DW_AT_name("__simd128_int32_t")
    4777                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x10)
    4778                    $C$DW$76        .dwtag  DW_TAG_member
    4779                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$35)
    4780                            .dwattr $C$DW$76, DW_AT_name("_v")
    4781                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("_v")
    4782                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4783                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    4784                            .dwattr $C$DW$76, DW_AT_decl_file("C:\VLIB_Tools\CCSV5_4_0\ccsv5\tools\compiler\C6000\include\
    4785                            .dwattr $C$DW$76, DW_AT_decl_line(0x44)
    4786                            .dwattr $C$DW$76, DW_AT_decl_column(0x01)
    4787                            .dwendtag $C$DW$T$36
    4788                    
    4789                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:\VLIB_Tools\CCSV5_4_0\ccsv5\tools\compiler\C6000\includ
    4790                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x44)
    4791                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    4792                    $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("int32x4_t")
    4793                            .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$36)
    4794                            .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    4795                            .dwattr $C$DW$T$108, DW_AT_decl_file("C:\VLIB_Tools\CCSV5_4_0\ccsv5\tools\compiler\C6000\inclu
    4796                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x44)
    4797                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x01)
    4798                    $C$DW$T$109     .dwtag  DW_TAG_typedef, DW_AT_name("__x128_t")
    4799                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$108)
    4800                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    4801                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:\VLIB_Tools\CCSV5_4_0\ccsv5\tools\compiler\C6000\inclu
    4802                            .dwattr $C$DW$T$109, DW_AT_decl_line(0x46)
    4803                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x13)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_idat.se66 PAGE  100

    4804                    
    4805                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4806                            .dwattr $C$DW$T$37, DW_AT_name("tm")
    4807                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x24)
    4808                    $C$DW$77        .dwtag  DW_TAG_member
    4809                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$10)
    4810                            .dwattr $C$DW$77, DW_AT_name("tm_sec")
    4811                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("tm_sec")
    4812                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4813                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    4814                            .dwattr $C$DW$77, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    4815                            .dwattr $C$DW$77, DW_AT_decl_line(0x41)
    4816                            .dwattr $C$DW$77, DW_AT_decl_column(0x09)
    4817                    $C$DW$78        .dwtag  DW_TAG_member
    4818                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$10)
    4819                            .dwattr $C$DW$78, DW_AT_name("tm_min")
    4820                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("tm_min")
    4821                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4822                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    4823                            .dwattr $C$DW$78, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    4824                            .dwattr $C$DW$78, DW_AT_decl_line(0x42)
    4825                            .dwattr $C$DW$78, DW_AT_decl_column(0x09)
    4826                    $C$DW$79        .dwtag  DW_TAG_member
    4827                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$10)
    4828                            .dwattr $C$DW$79, DW_AT_name("tm_hour")
    4829                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("tm_hour")
    4830                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4831                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    4832                            .dwattr $C$DW$79, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    4833                            .dwattr $C$DW$79, DW_AT_decl_line(0x43)
    4834                            .dwattr $C$DW$79, DW_AT_decl_column(0x09)
    4835                    $C$DW$80        .dwtag  DW_TAG_member
    4836                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$10)
    4837                            .dwattr $C$DW$80, DW_AT_name("tm_mday")
    4838                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("tm_mday")
    4839                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4840                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    4841                            .dwattr $C$DW$80, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    4842                            .dwattr $C$DW$80, DW_AT_decl_line(0x44)
    4843                            .dwattr $C$DW$80, DW_AT_decl_column(0x09)
    4844                    $C$DW$81        .dwtag  DW_TAG_member
    4845                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$10)
    4846                            .dwattr $C$DW$81, DW_AT_name("tm_mon")
    4847                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("tm_mon")
    4848                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4849                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    4850                            .dwattr $C$DW$81, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    4851                            .dwattr $C$DW$81, DW_AT_decl_line(0x45)
    4852                            .dwattr $C$DW$81, DW_AT_decl_column(0x09)
    4853                    $C$DW$82        .dwtag  DW_TAG_member
    4854                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$10)
    4855                            .dwattr $C$DW$82, DW_AT_name("tm_year")
    4856                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("tm_year")
    4857                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4858                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_idat.se66 PAGE  101

    4859                            .dwattr $C$DW$82, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    4860                            .dwattr $C$DW$82, DW_AT_decl_line(0x46)
    4861                            .dwattr $C$DW$82, DW_AT_decl_column(0x09)
    4862                    $C$DW$83        .dwtag  DW_TAG_member
    4863                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$10)
    4864                            .dwattr $C$DW$83, DW_AT_name("tm_wday")
    4865                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("tm_wday")
    4866                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4867                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    4868                            .dwattr $C$DW$83, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    4869                            .dwattr $C$DW$83, DW_AT_decl_line(0x47)
    4870                            .dwattr $C$DW$83, DW_AT_decl_column(0x09)
    4871                    $C$DW$84        .dwtag  DW_TAG_member
    4872                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$10)
    4873                            .dwattr $C$DW$84, DW_AT_name("tm_yday")
    4874                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("tm_yday")
    4875                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4876                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    4877                            .dwattr $C$DW$84, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    4878                            .dwattr $C$DW$84, DW_AT_decl_line(0x48)
    4879                            .dwattr $C$DW$84, DW_AT_decl_column(0x09)
    4880                    $C$DW$85        .dwtag  DW_TAG_member
    4881                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$10)
    4882                            .dwattr $C$DW$85, DW_AT_name("tm_isdst")
    4883                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("tm_isdst")
    4884                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4885                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    4886                            .dwattr $C$DW$85, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    4887                            .dwattr $C$DW$85, DW_AT_decl_line(0x49)
    4888                            .dwattr $C$DW$85, DW_AT_decl_column(0x09)
    4889                            .dwendtag $C$DW$T$37
    4890                    
    4891                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4892                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x3f)
    4893                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x08)
    4894                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    4895                    
    4896                    ;***************************************************************
    4897                    ;* DWARF CIE ENTRIES                                           *
    4898                    ;***************************************************************
    4899                    
    4900                    $C$DW$CIE       .dwcie 19
    4901                            .dwcfi  cfa_register, 31
    4902                            .dwcfi  cfa_offset, 0
    4903                            .dwcfi  undefined, 0
    4904                            .dwcfi  undefined, 1
    4905                            .dwcfi  undefined, 2
    4906                            .dwcfi  undefined, 3
    4907                            .dwcfi  undefined, 4
    4908                            .dwcfi  undefined, 5
    4909                            .dwcfi  undefined, 6
    4910                            .dwcfi  undefined, 7
    4911                            .dwcfi  undefined, 8
    4912                            .dwcfi  undefined, 9
    4913                            .dwcfi  same_value, 10
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_idat.se66 PAGE  102

    4914                            .dwcfi  same_value, 11
    4915                            .dwcfi  same_value, 12
    4916                            .dwcfi  same_value, 13
    4917                            .dwcfi  same_value, 14
    4918                            .dwcfi  same_value, 15
    4919                            .dwcfi  undefined, 16
    4920                            .dwcfi  undefined, 17
    4921                            .dwcfi  undefined, 18
    4922                            .dwcfi  undefined, 19
    4923                            .dwcfi  undefined, 20
