TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_d.se66 PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v7.4.2 *
       3                    ;* Date/Time created: Sat Sep 26 11:12:05 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --c64p_l1d_workaround=off --endian=little --hll_source=on --long_pre
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C66xx                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *
      12                    ;*   Optimizing for    : Speed                                                *

    3637                            .dwattr $C$DW$310, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66
    3638                            .dwattr $C$DW$310, DW_AT_decl_line(0x87)
    3639                            .dwattr $C$DW$310, DW_AT_decl_column(0x05)
    3640                    $C$DW$311       .dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_ERR_NOT_IMPLEMENTED"), DW_AT_const_value(0
    3641                            .dwattr $C$DW$311, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66
    3642                            .dwattr $C$DW$311, DW_AT_decl_line(0x88)
    3643                            .dwattr $C$DW$311, DW_AT_decl_column(0x05)
    3644                    $C$DW$312       .dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_ERROR_MAX"), DW_AT_const_value(0x0f)
    3645                            .dwattr $C$DW$312, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66
    3646                            .dwattr $C$DW$312, DW_AT_decl_line(0x89)
    3647                            .dwattr $C$DW$312, DW_AT_decl_column(0x05)
    3648                            .dwendtag $C$DW$T$38
    3649                    
    3650                            .dwattr $C$DW$T$38, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c6
    3651                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x79)
    3652                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0e)
    3653                    $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_STATUS")
    3654                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    3655                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3656                            .dwattr $C$DW$T$39, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c6
    3657                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x8a)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_d.se66 PAGE   80

    3658                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x03)
    3659                    
    3660                    $C$DW$T$40      .dwtag  DW_TAG_enumeration_type
    3661                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    3662                    $C$DW$313       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_OPT"), DW_AT_const_value(0x00)
    3663                            .dwattr $C$DW$313, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\../common/VLI
    3664                            .dwattr $C$DW$313, DW_AT_decl_line(0x6a)
    3665                            .dwattr $C$DW$313, DW_AT_decl_column(0x05)
    3666                    $C$DW$314       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_CN"), DW_AT_const_value(0x01)
    3667                            .dwattr $C$DW$314, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\../common/VLI
    3668                            .dwattr $C$DW$314, DW_AT_decl_line(0x6b)
    3669                            .dwattr $C$DW$314, DW_AT_decl_column(0x05)
    3670                    $C$DW$315       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_CNT"), DW_AT_const_value(0x02)
    3671                            .dwattr $C$DW$315, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\../common/VLI
    3672                            .dwattr $C$DW$315, DW_AT_decl_line(0x6c)
    3673                            .dwattr $C$DW$315, DW_AT_decl_column(0x05)
    3674                            .dwendtag $C$DW$T$40
    3675                    
    3676                            .dwattr $C$DW$T$40, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\../common/VL
    3677                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x69)
    3678                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x06)
    3679                    
    3680                    $C$DW$T$41      .dwtag  DW_TAG_enumeration_type
    3681                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    3682                    $C$DW$316       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_FAIL"), DW_AT_const_value(0x00)
    3683                            .dwattr $C$DW$316, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\../common/VLI
    3684                            .dwattr $C$DW$316, DW_AT_decl_line(0x72)
    3685                            .dwattr $C$DW$316, DW_AT_decl_column(0x05)
    3686                    $C$DW$317       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_PASS"), DW_AT_const_value(0x01)
    3687                            .dwattr $C$DW$317, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\../common/VLI
    3688                            .dwattr $C$DW$317, DW_AT_decl_line(0x73)
    3689                            .dwattr $C$DW$317, DW_AT_decl_column(0x05)
    3690                            .dwendtag $C$DW$T$41
    3691                    
    3692                            .dwattr $C$DW$T$41, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\../common/VL
    3693                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x71)
    3694                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x06)
    3695                    
    3696                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3697                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x38)
    3698                    $C$DW$318       .dwtag  DW_TAG_member
    3699                            .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$19)
    3700                            .dwattr $C$DW$318, DW_AT_name("testPattern")
    3701                            .dwattr $C$DW$318, DW_AT_TI_symbol_name("testPattern")
    3702                            .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3703                            .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3704                            .dwattr $C$DW$318, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTem
    3705                            .dwattr $C$DW$318, DW_AT_decl_line(0x24)
    3706                            .dwattr $C$DW$318, DW_AT_decl_column(0x0f)
    3707                    $C$DW$319       .dwtag  DW_TAG_member
    3708                            .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$20)
    3709                            .dwattr $C$DW$319, DW_AT_name("orgImg")
    3710                            .dwattr $C$DW$319, DW_AT_TI_symbol_name("orgImg")
    3711                            .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3712                            .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_d.se66 PAGE   81

    3713                            .dwattr $C$DW$319, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTem
    3714                            .dwattr $C$DW$319, DW_AT_decl_line(0x25)
    3715                            .dwattr $C$DW$319, DW_AT_decl_column(0x0f)
    3716                    $C$DW$320       .dwtag  DW_TAG_member
    3717                            .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$21)
    3718                            .dwattr $C$DW$320, DW_AT_name("orgImgWidth")
    3719                            .dwattr $C$DW$320, DW_AT_TI_symbol_name("orgImgWidth")
    3720                            .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3721                            .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3722                            .dwattr $C$DW$320, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTem
    3723                            .dwattr $C$DW$320, DW_AT_decl_line(0x26)
    3724                            .dwattr $C$DW$320, DW_AT_decl_column(0x0f)
    3725                    $C$DW$321       .dwtag  DW_TAG_member
    3726                            .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$21)
    3727                            .dwattr $C$DW$321, DW_AT_name("orgImgHeight")
    3728                            .dwattr $C$DW$321, DW_AT_TI_symbol_name("orgImgHeight")
    3729                            .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3730                            .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3731                            .dwattr $C$DW$321, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTem
    3732                            .dwattr $C$DW$321, DW_AT_decl_line(0x27)
    3733                            .dwattr $C$DW$321, DW_AT_decl_column(0x0f)
    3734                    $C$DW$322       .dwtag  DW_TAG_member
    3735                            .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$21)
    3736                            .dwattr $C$DW$322, DW_AT_name("orgImgPitch")
    3737                            .dwattr $C$DW$322, DW_AT_TI_symbol_name("orgImgPitch")
    3738                            .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3739                            .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3740                            .dwattr $C$DW$322, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTem
    3741                            .dwattr $C$DW$322, DW_AT_decl_line(0x28)
    3742                            .dwattr $C$DW$322, DW_AT_decl_column(0x0f)
    3743                    $C$DW$323       .dwtag  DW_TAG_member
    3744                            .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$20)
    3745                            .dwattr $C$DW$323, DW_AT_name("tempImg")
    3746                            .dwattr $C$DW$323, DW_AT_TI_symbol_name("tempImg")
    3747                            .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3748                            .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3749                            .dwattr $C$DW$323, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTem
    3750                            .dwattr $C$DW$323, DW_AT_decl_line(0x29)
    3751                            .dwattr $C$DW$323, DW_AT_decl_column(0x0f)
    3752                    $C$DW$324       .dwtag  DW_TAG_member
    3753                            .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$21)
    3754                            .dwattr $C$DW$324, DW_AT_name("tempImgWidth")
    3755                            .dwattr $C$DW$324, DW_AT_TI_symbol_name("tempImgWidth")
    3756                            .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3757                            .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3758                            .dwattr $C$DW$324, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTem
    3759                            .dwattr $C$DW$324, DW_AT_decl_line(0x2a)
    3760                            .dwattr $C$DW$324, DW_AT_decl_column(0x0f)
    3761                    $C$DW$325       .dwtag  DW_TAG_member
    3762                            .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$21)
    3763                            .dwattr $C$DW$325, DW_AT_name("tempImgHeight")
    3764                            .dwattr $C$DW$325, DW_AT_TI_symbol_name("tempImgHeight")
    3765                            .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3766                            .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3767                            .dwattr $C$DW$325, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTem
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_d.se66 PAGE   82

    3768                            .dwattr $C$DW$325, DW_AT_decl_line(0x2b)
    3769                            .dwattr $C$DW$325, DW_AT_decl_column(0x0f)
    3770                    $C$DW$326       .dwtag  DW_TAG_member
    3771                            .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$21)
    3772                            .dwattr $C$DW$326, DW_AT_name("tempImgPitch")
    3773                            .dwattr $C$DW$326, DW_AT_TI_symbol_name("tempImgPitch")
    3774                            .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3775                            .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3776                            .dwattr $C$DW$326, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTem
    3777                            .dwattr $C$DW$326, DW_AT_decl_line(0x2c)
    3778                            .dwattr $C$DW$326, DW_AT_decl_column(0x0f)
    3779                    $C$DW$327       .dwtag  DW_TAG_member
    3780                            .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$19)
    3781                            .dwattr $C$DW$327, DW_AT_name("xDirJump")
    3782                            .dwattr $C$DW$327, DW_AT_TI_symbol_name("xDirJump")
    3783                            .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3784                            .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3785                            .dwattr $C$DW$327, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTem
    3786                            .dwattr $C$DW$327, DW_AT_decl_line(0x2d)
    3787                            .dwattr $C$DW$327, DW_AT_decl_column(0x0f)
    3788                    $C$DW$328       .dwtag  DW_TAG_member
    3789                            .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$19)
    3790                            .dwattr $C$DW$328, DW_AT_name("yDirJump")
    3791                            .dwattr $C$DW$328, DW_AT_TI_symbol_name("yDirJump")
    3792                            .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    3793                            .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3794                            .dwattr $C$DW$328, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTem
    3795                            .dwattr $C$DW$328, DW_AT_decl_line(0x2e)
    3796                            .dwattr $C$DW$328, DW_AT_decl_column(0x0f)
    3797                    $C$DW$329       .dwtag  DW_TAG_member
    3798                            .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$21)
    3799                            .dwattr $C$DW$329, DW_AT_name("outScorePitch")
    3800                            .dwattr $C$DW$329, DW_AT_TI_symbol_name("outScorePitch")
    3801                            .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3802                            .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3803                            .dwattr $C$DW$329, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTem
    3804                            .dwattr $C$DW$329, DW_AT_decl_line(0x2f)
    3805                            .dwattr $C$DW$329, DW_AT_decl_column(0x0f)
    3806                    $C$DW$330       .dwtag  DW_TAG_member
    3807                            .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$21)
    3808                            .dwattr $C$DW$330, DW_AT_name("method")
    3809                            .dwattr $C$DW$330, DW_AT_TI_symbol_name("method")
    3810                            .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3811                            .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3812                            .dwattr $C$DW$330, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTem
    3813                            .dwattr $C$DW$330, DW_AT_decl_line(0x30)
    3814                            .dwattr $C$DW$330, DW_AT_decl_column(0x0f)
    3815                    $C$DW$331       .dwtag  DW_TAG_member
    3816                            .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$23)
    3817                            .dwattr $C$DW$331, DW_AT_name("outScore")
    3818                            .dwattr $C$DW$331, DW_AT_TI_symbol_name("outScore")
    3819                            .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3820                            .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3821                            .dwattr $C$DW$331, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTem
    3822                            .dwattr $C$DW$331, DW_AT_decl_line(0x31)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_d.se66 PAGE   83

    3823                            .dwattr $C$DW$331, DW_AT_decl_column(0x0f)
    3824                    $C$DW$332       .dwtag  DW_TAG_member
    3825                            .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$25)
    3826                            .dwattr $C$DW$332, DW_AT_name("desc")
    3827                            .dwattr $C$DW$332, DW_AT_TI_symbol_name("desc")
    3828                            .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3829                            .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3830                            .dwattr $C$DW$332, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTem
    3831                            .dwattr $C$DW$332, DW_AT_decl_line(0x32)
    3832                            .dwattr $C$DW$332, DW_AT_decl_column(0x0f)
    3833                            .dwendtag $C$DW$T$26
    3834                    
    3835                            .dwattr $C$DW$T$26, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTe
    3836                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x23)
    3837                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    3838                    $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    3839                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$26)
    3840                            .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    3841                    $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("matchTemplate_testParams_t")
    3842                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$26)
    3843                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3844                            .dwattr $C$DW$T$44, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\VLIB_matchTe
    3845                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x33)
    3846                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x03)
    3847                    $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    3848                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    3849                            .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    3850                    $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3851                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    3852                            .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    3853                    
    3854                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3855                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x18)
    3856                    $C$DW$333       .dwtag  DW_TAG_member
    3857                            .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$10)
    3858                            .dwattr $C$DW$333, DW_AT_name("fd")
    3859                            .dwattr $C$DW$333, DW_AT_TI_symbol_name("fd")
    3860                            .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3861                            .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3862                            .dwattr $C$DW$333, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3863                            .dwattr $C$DW$333, DW_AT_decl_line(0x49)
    3864                            .dwattr $C$DW$333, DW_AT_decl_column(0x0b)
    3865                    $C$DW$334       .dwtag  DW_TAG_member
    3866                            .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$27)
    3867                            .dwattr $C$DW$334, DW_AT_name("buf")
    3868                            .dwattr $C$DW$334, DW_AT_TI_symbol_name("buf")
    3869                            .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3870                            .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3871                            .dwattr $C$DW$334, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3872                            .dwattr $C$DW$334, DW_AT_decl_line(0x4a)
    3873                            .dwattr $C$DW$334, DW_AT_decl_column(0x16)
    3874                    $C$DW$335       .dwtag  DW_TAG_member
    3875                            .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$27)
    3876                            .dwattr $C$DW$335, DW_AT_name("pos")
    3877                            .dwattr $C$DW$335, DW_AT_TI_symbol_name("pos")
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_d.se66 PAGE   84

    3878                            .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3879                            .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3880                            .dwattr $C$DW$335, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3881                            .dwattr $C$DW$335, DW_AT_decl_line(0x4b)
    3882                            .dwattr $C$DW$335, DW_AT_decl_column(0x16)
    3883                    $C$DW$336       .dwtag  DW_TAG_member
    3884                            .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$27)
    3885                            .dwattr $C$DW$336, DW_AT_name("bufend")
    3886                            .dwattr $C$DW$336, DW_AT_TI_symbol_name("bufend")
    3887                            .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3888                            .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3889                            .dwattr $C$DW$336, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3890                            .dwattr $C$DW$336, DW_AT_decl_line(0x4c)
    3891                            .dwattr $C$DW$336, DW_AT_decl_column(0x16)
    3892                    $C$DW$337       .dwtag  DW_TAG_member
    3893                            .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$27)
    3894                            .dwattr $C$DW$337, DW_AT_name("buff_stop")
    3895                            .dwattr $C$DW$337, DW_AT_TI_symbol_name("buff_stop")
    3896                            .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3897                            .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3898                            .dwattr $C$DW$337, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3899                            .dwattr $C$DW$337, DW_AT_decl_line(0x4d)
    3900                            .dwattr $C$DW$337, DW_AT_decl_column(0x16)
    3901                    $C$DW$338       .dwtag  DW_TAG_member
    3902                            .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$11)
    3903                            .dwattr $C$DW$338, DW_AT_name("flags")
    3904                            .dwattr $C$DW$338, DW_AT_TI_symbol_name("flags")
    3905                            .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3906                            .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3907                            .dwattr $C$DW$338, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3908                            .dwattr $C$DW$338, DW_AT_decl_line(0x4e)
    3909                            .dwattr $C$DW$338, DW_AT_decl_column(0x16)
    3910                            .dwendtag $C$DW$T$28
    3911                    
    3912                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3913                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x48)
    3914                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    3915                    $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    3916                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$28)
    3917                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3918                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3919                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x4f)
    3920                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
    3921                    
    3922                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3923                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    3924                    $C$DW$339       .dwtag  DW_TAG_member
    3925                            .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$10)
    3926                            .dwattr $C$DW$339, DW_AT_name("quot")
    3927                            .dwattr $C$DW$339, DW_AT_TI_symbol_name("quot")
    3928                            .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3929                            .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3930                            .dwattr $C$DW$339, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3931                            .dwattr $C$DW$339, DW_AT_decl_line(0x3e)
    3932                            .dwattr $C$DW$339, DW_AT_decl_column(0x16)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_d.se66 PAGE   85

    3933                    $C$DW$340       .dwtag  DW_TAG_member
    3934                            .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$10)
    3935                            .dwattr $C$DW$340, DW_AT_name("rem")
    3936                            .dwattr $C$DW$340, DW_AT_TI_symbol_name("rem")
    3937                            .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3938                            .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3939                            .dwattr $C$DW$340, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3940                            .dwattr $C$DW$340, DW_AT_decl_line(0x3e)
    3941                            .dwattr $C$DW$340, DW_AT_decl_column(0x1c)
    3942                            .dwendtag $C$DW$T$29
    3943                    
    3944                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3945                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x3e)
    3946                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    3947                    $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    3948                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$29)
    3949                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3950                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3951                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x3e)
    3952                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x23)
    3953                    
    3954                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3955                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
    3956                    $C$DW$341       .dwtag  DW_TAG_member
    3957                            .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$10)
    3958                            .dwattr $C$DW$341, DW_AT_name("quot")
    3959                            .dwattr $C$DW$341, DW_AT_TI_symbol_name("quot")
    3960                            .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3961                            .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3962                            .dwattr $C$DW$341, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3963                            .dwattr $C$DW$341, DW_AT_decl_line(0x40)
    3964                            .dwattr $C$DW$341, DW_AT_decl_column(0x17)
    3965                    $C$DW$342       .dwtag  DW_TAG_member
    3966                            .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$10)
    3967                            .dwattr $C$DW$342, DW_AT_name("rem")
    3968                            .dwattr $C$DW$342, DW_AT_TI_symbol_name("rem")
    3969                            .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3970                            .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3971                            .dwattr $C$DW$342, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3972                            .dwattr $C$DW$342, DW_AT_decl_line(0x40)
    3973                            .dwattr $C$DW$342, DW_AT_decl_column(0x1d)
    3974                            .dwendtag $C$DW$T$30
    3975                    
    3976                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3977                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x40)
    3978                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    3979                    $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    3980                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$30)
    3981                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3982                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3983                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x40)
    3984                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x24)
    3985                    
    3986                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3987                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x10)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_d.se66 PAGE   86

    3988                    $C$DW$343       .dwtag  DW_TAG_member
    3989                            .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$14)
    3990                            .dwattr $C$DW$343, DW_AT_name("quot")
    3991                            .dwattr $C$DW$343, DW_AT_TI_symbol_name("quot")
    3992                            .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3993                            .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3994                            .dwattr $C$DW$343, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3995                            .dwattr $C$DW$343, DW_AT_decl_line(0x43)
    3996                            .dwattr $C$DW$343, DW_AT_decl_column(0x1c)
    3997                    $C$DW$344       .dwtag  DW_TAG_member
    3998                            .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$14)
    3999                            .dwattr $C$DW$344, DW_AT_name("rem")
    4000                            .dwattr $C$DW$344, DW_AT_TI_symbol_name("rem")
    4001                            .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4002                            .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    4003                            .dwattr $C$DW$344, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4004                            .dwattr $C$DW$344, DW_AT_decl_line(0x43)
    4005                            .dwattr $C$DW$344, DW_AT_decl_column(0x22)
    4006                            .dwendtag $C$DW$T$31
    4007                    
    4008                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4009                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x43)
    4010                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    4011                    $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    4012                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$31)
    4013                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    4014                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4015                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x43)
    4016                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x29)
    4017                    
    4018                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4019                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x24)
    4020                    $C$DW$345       .dwtag  DW_TAG_member
    4021                            .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$21)
    4022                            .dwattr $C$DW$345, DW_AT_name("area")
    4023                            .dwattr $C$DW$345, DW_AT_TI_symbol_name("area")
    4024                            .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4025                            .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    4026                            .dwattr $C$DW$345, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66
    4027                            .dwattr $C$DW$345, DW_AT_decl_line(0x69)
    4028                            .dwattr $C$DW$345, DW_AT_decl_column(0x0d)
    4029                    $C$DW$346       .dwtag  DW_TAG_member
    4030                            .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$21)
    4031                            .dwattr $C$DW$346, DW_AT_name("xsum")
    4032                            .dwattr $C$DW$346, DW_AT_TI_symbol_name("xsum")
    4033                            .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4034                            .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    4035                            .dwattr $C$DW$346, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66
    4036                            .dwattr $C$DW$346, DW_AT_decl_line(0x6a)
    4037                            .dwattr $C$DW$346, DW_AT_decl_column(0x0d)
    4038                    $C$DW$347       .dwtag  DW_TAG_member
    4039                            .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$21)
    4040                            .dwattr $C$DW$347, DW_AT_name("ysum")
    4041                            .dwattr $C$DW$347, DW_AT_TI_symbol_name("ysum")
    4042                            .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_d.se66 PAGE   87

    4043                            .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    4044                            .dwattr $C$DW$347, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66
    4045                            .dwattr $C$DW$347, DW_AT_decl_line(0x6b)
    4046                            .dwattr $C$DW$347, DW_AT_decl_column(0x0d)
    4047                    $C$DW$348       .dwtag  DW_TAG_member
    4048                            .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$21)
    4049                            .dwattr $C$DW$348, DW_AT_name("xmin")
    4050                            .dwattr $C$DW$348, DW_AT_TI_symbol_name("xmin")
    4051                            .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4052                            .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    4053                            .dwattr $C$DW$348, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66
    4054                            .dwattr $C$DW$348, DW_AT_decl_line(0x6d)
    4055                            .dwattr $C$DW$348, DW_AT_decl_column(0x0d)
    4056                    $C$DW$349       .dwtag  DW_TAG_member
    4057                            .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$21)
    4058                            .dwattr $C$DW$349, DW_AT_name("ymin")
    4059                            .dwattr $C$DW$349, DW_AT_TI_symbol_name("ymin")
    4060                            .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4061                            .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    4062                            .dwattr $C$DW$349, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66
    4063                            .dwattr $C$DW$349, DW_AT_decl_line(0x6e)
    4064                            .dwattr $C$DW$349, DW_AT_decl_column(0x0d)
    4065                    $C$DW$350       .dwtag  DW_TAG_member
    4066                            .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$21)
    4067                            .dwattr $C$DW$350, DW_AT_name("xmax")
    4068                            .dwattr $C$DW$350, DW_AT_TI_symbol_name("xmax")
    4069                            .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4070                            .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    4071                            .dwattr $C$DW$350, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66
    4072                            .dwattr $C$DW$350, DW_AT_decl_line(0x6f)
    4073                            .dwattr $C$DW$350, DW_AT_decl_column(0x0d)
    4074                    $C$DW$351       .dwtag  DW_TAG_member
    4075                            .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$21)
    4076                            .dwattr $C$DW$351, DW_AT_name("ymax")
    4077                            .dwattr $C$DW$351, DW_AT_TI_symbol_name("ymax")
    4078                            .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4079                            .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    4080                            .dwattr $C$DW$351, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66
    4081                            .dwattr $C$DW$351, DW_AT_decl_line(0x70)
    4082                            .dwattr $C$DW$351, DW_AT_decl_column(0x0d)
    4083                    $C$DW$352       .dwtag  DW_TAG_member
    4084                            .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$21)
    4085                            .dwattr $C$DW$352, DW_AT_name("seedx")
    4086                            .dwattr $C$DW$352, DW_AT_TI_symbol_name("seedx")
    4087                            .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4088                            .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    4089                            .dwattr $C$DW$352, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66
    4090                            .dwattr $C$DW$352, DW_AT_decl_line(0x72)
    4091                            .dwattr $C$DW$352, DW_AT_decl_column(0x0d)
    4092                    $C$DW$353       .dwtag  DW_TAG_member
    4093                            .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$21)
    4094                            .dwattr $C$DW$353, DW_AT_name("seedy")
    4095                            .dwattr $C$DW$353, DW_AT_TI_symbol_name("seedy")
    4096                            .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4097                            .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_d.se66 PAGE   88

    4098                            .dwattr $C$DW$353, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c66
    4099                            .dwattr $C$DW$353, DW_AT_decl_line(0x73)
    4100                            .dwattr $C$DW$353, DW_AT_decl_column(0x0d)
    4101                            .dwendtag $C$DW$T$32
    4102                    
    4103                            .dwattr $C$DW$T$32, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c6
    4104                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x68)
    4105                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    4106                    $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CC")
    4107                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$32)
    4108                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    4109                            .dwattr $C$DW$T$51, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c6
    4110                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x75)
    4111                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
    4112                    
    4113                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    4114                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    4115                    $C$DW$354       .dwtag  DW_TAG_member
    4116                            .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$8)
    4117                            .dwattr $C$DW$354, DW_AT_name("daylight")
    4118                            .dwattr $C$DW$354, DW_AT_TI_symbol_name("daylight")
    4119                            .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4120                            .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    4121                            .dwattr $C$DW$354, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4122                            .dwattr $C$DW$354, DW_AT_decl_line(0x52)
    4123                            .dwattr $C$DW$354, DW_AT_decl_column(0x0b)
    4124                    $C$DW$355       .dwtag  DW_TAG_member
    4125                            .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$10)
    4126                            .dwattr $C$DW$355, DW_AT_name("timezone")
    4127                            .dwattr $C$DW$355, DW_AT_TI_symbol_name("timezone")
    4128                            .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4129                            .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    4130                            .dwattr $C$DW$355, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4131                            .dwattr $C$DW$355, DW_AT_decl_line(0x53)
    4132                            .dwattr $C$DW$355, DW_AT_decl_column(0x0b)
    4133                    $C$DW$356       .dwtag  DW_TAG_member
    4134                            .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$33)
    4135                            .dwattr $C$DW$356, DW_AT_name("tzname")
    4136                            .dwattr $C$DW$356, DW_AT_TI_symbol_name("tzname")
    4137                            .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4138                            .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    4139                            .dwattr $C$DW$356, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4140                            .dwattr $C$DW$356, DW_AT_decl_line(0x54)
    4141                            .dwattr $C$DW$356, DW_AT_decl_column(0x0b)
    4142                    $C$DW$357       .dwtag  DW_TAG_member
    4143                            .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$33)
    4144                            .dwattr $C$DW$357, DW_AT_name("dstname")
    4145                            .dwattr $C$DW$357, DW_AT_TI_symbol_name("dstname")
    4146                            .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4147                            .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    4148                            .dwattr $C$DW$357, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4149                            .dwattr $C$DW$357, DW_AT_decl_line(0x55)
    4150                            .dwattr $C$DW$357, DW_AT_decl_column(0x0b)
    4151                            .dwendtag $C$DW$T$34
    4152                    
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_d.se66 PAGE   89

    4153                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4154                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x51)
    4155                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x01)
    4156                    $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("TZ")
    4157                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$34)
    4158                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    4159                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4160                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x56)
    4161                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x03)
    4162                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    4163                            .dwattr $C$DW$T$2, DW_AT_name("void")
    4164                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4165                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    4166                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    4167                    $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_PTR")
    4168                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$3)
    4169                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    4170                            .dwattr $C$DW$T$53, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c6
    4171                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x5c)
    4172                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x19)
    4173                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    4174                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4175                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    4176                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4177                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    4178                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4179                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4180                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4181                    $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    4182                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$5)
    4183                            .dwattr $C$DW$T$82, DW_AT_address_class(0x20)
    4184                    $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    4185                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$5)
    4186                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    4187                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4188                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x2a)
    4189                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x1d)
    4190                    $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    4191                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    4192                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    4193                            .dwattr $C$DW$T$97, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4194                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x39)
    4195                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x17)
    4196                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    4197                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4198                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4199                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4200                    $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    4201                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$6)
    4202                            .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    4203                    $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    4204                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
    4205                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    4206                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4207                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x2b)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_d.se66 PAGE   90

    4208                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
    4209                    $C$DW$T$20      .dwtag  DW_TAG_pointer_type
    4210                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    4211                            .dwattr $C$DW$T$20, DW_AT_address_class(0x20)
    4212                    $C$DW$T$99      .dwtag  DW_TAG_restrict_type
    4213                            .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$20)
    4214                    $C$DW$T$100     .dwtag  DW_TAG_const_type
    4215                            .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$19)
    4216                    $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    4217                            .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$19)
    4218                            .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    4219                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4220                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x3a)
    4221                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x16)
    4222                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    4223                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4224                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4225                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    4226                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    4227                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4228                            .dwattr $C$DW$T$8, DW_AT_name("short")
    4229                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    4230                    $C$DW$T$102     .dwtag  DW_TAG_pointer_type
    4231                            .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$8)
    4232                            .dwattr $C$DW$T$102, DW_AT_address_class(0x20)
    4233                    $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    4234                            .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$8)
    4235                            .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    4236                            .dwattr $C$DW$T$103, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4237                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x2c)
    4238                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x1d)
    4239                    $C$DW$T$104     .dwtag  DW_TAG_pointer_type
    4240                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
    4241                            .dwattr $C$DW$T$104, DW_AT_address_class(0x20)
    4242                    $C$DW$T$105     .dwtag  DW_TAG_restrict_type
    4243                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
    4244                    $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    4245                            .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$103)
    4246                            .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    4247                            .dwattr $C$DW$T$106, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4248                            .dwattr $C$DW$T$106, DW_AT_decl_line(0x3c)
    4249                            .dwattr $C$DW$T$106, DW_AT_decl_column(0x17)
    4250                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    4251                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4252                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4253                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    4254                    $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    4255                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$9)
    4256                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    4257                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4258                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x2d)
    4259                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x1c)
    4260                    $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    4261                            .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$75)
    4262                            .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_d.se66 PAGE   91

    4263                            .dwattr $C$DW$T$108, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4264                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x3d)
    4265                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x16)
    4266                    $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    4267                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$9)
    4268                            .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    4269                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4270                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x53)
    4271                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x1a)
    4272                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    4273                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    4274                            .dwattr $C$DW$T$10, DW_AT_name("int")
    4275                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    4276                    $C$DW$T$131     .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
    4277                            .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$10)
    4278                            .dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
    4279                            .dwattr $C$DW$T$131, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4280                            .dwattr $C$DW$T$131, DW_AT_decl_line(0x53)
    4281                            .dwattr $C$DW$T$131, DW_AT_decl_column(0x0d)
    4282                    $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    4283                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$10)
    4284                            .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    4285                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4286                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x2e)
    4287                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x1d)
    4288                    $C$DW$T$123     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CCHandle")
    4289                            .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$21)
    4290                            .dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
    4291                            .dwattr $C$DW$T$123, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c
    4292                            .dwattr $C$DW$T$123, DW_AT_decl_line(0x77)
    4293                            .dwattr $C$DW$T$123, DW_AT_decl_column(0x11)
    4294                    
    4295                    $C$DW$T$35      .dwtag  DW_TAG_array_type
    4296                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$21)
    4297                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4298                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x10)
    4299                    $C$DW$358       .dwtag  DW_TAG_subrange_type
    4300                            .dwattr $C$DW$358, DW_AT_upper_bound(0x03)
    4301                            .dwendtag $C$DW$T$35
    4302                    
    4303                    $C$DW$T$78      .dwtag  DW_TAG_pointer_type
    4304                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$21)
    4305                            .dwattr $C$DW$T$78, DW_AT_address_class(0x20)
    4306                    $C$DW$T$126     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    4307                            .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$21)
    4308                            .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    4309                            .dwattr $C$DW$T$126, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4310                            .dwattr $C$DW$T$126, DW_AT_decl_line(0x4b)
    4311                            .dwattr $C$DW$T$126, DW_AT_decl_column(0x17)
    4312                    $C$DW$T$127     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    4313                            .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$21)
    4314                            .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    4315                            .dwattr $C$DW$T$127, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4316                            .dwattr $C$DW$T$127, DW_AT_decl_line(0x4e)
    4317                            .dwattr $C$DW$T$127, DW_AT_decl_column(0x17)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_d.se66 PAGE   92

    4318                    $C$DW$T$128     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    4319                            .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$21)
    4320                            .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    4321                            .dwattr $C$DW$T$128, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4322                            .dwattr $C$DW$T$128, DW_AT_decl_line(0x49)
    4323                            .dwattr $C$DW$T$128, DW_AT_decl_column(0x17)
    4324                    $C$DW$T$129     .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    4325                            .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$21)
    4326                            .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    4327                            .dwattr $C$DW$T$129, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4328                            .dwattr $C$DW$T$129, DW_AT_decl_line(0x3e)
    4329                            .dwattr $C$DW$T$129, DW_AT_decl_column(0x17)
    4330                    $C$DW$T$130     .dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
    4331                            .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$10)
    4332                            .dwattr $C$DW$T$130, DW_AT_language(DW_LANG_C)
    4333                            .dwattr $C$DW$T$130, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4334                            .dwattr $C$DW$T$130, DW_AT_decl_line(0x58)
    4335                            .dwattr $C$DW$T$130, DW_AT_decl_column(0x1a)
    4336                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    4337                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    4338                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    4339                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    4340                    $C$DW$T$132     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_VAL")
    4341                            .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$11)
    4342                            .dwattr $C$DW$T$132, DW_AT_language(DW_LANG_C)
    4343                            .dwattr $C$DW$T$132, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c
    4344                            .dwattr $C$DW$T$132, DW_AT_decl_line(0x5d)
    4345                            .dwattr $C$DW$T$132, DW_AT_decl_column(0x17)
    4346                    $C$DW$T$143     .dwtag  DW_TAG_typedef, DW_AT_name("clock_t")
    4347                            .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$11)
    4348                            .dwattr $C$DW$T$143, DW_AT_language(DW_LANG_C)
    4349                            .dwattr $C$DW$T$143, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4350                            .dwattr $C$DW$T$143, DW_AT_decl_line(0x37)
    4351                            .dwattr $C$DW$T$143, DW_AT_decl_column(0x16)
    4352                    $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    4353                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$11)
    4354                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    4355                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4356                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x45)
    4357                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x19)
    4358                    $C$DW$T$136     .dwtag  DW_TAG_typedef, DW_AT_name("time_t")
    4359                            .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$11)
    4360                            .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
    4361                            .dwattr $C$DW$T$136, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4362                            .dwattr $C$DW$T$136, DW_AT_decl_line(0x38)
    4363                            .dwattr $C$DW$T$136, DW_AT_decl_column(0x16)
    4364                    $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    4365                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$11)
    4366                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    4367                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4368                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x2f)
    4369                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x1c)
    4370                    $C$DW$T$138     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast16_t")
    4371                            .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$69)
    4372                            .dwattr $C$DW$T$138, DW_AT_language(DW_LANG_C)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_d.se66 PAGE   93

    4373                            .dwattr $C$DW$T$138, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4374                            .dwattr $C$DW$T$138, DW_AT_decl_line(0x4c)
    4375                            .dwattr $C$DW$T$138, DW_AT_decl_column(0x16)
    4376                    $C$DW$T$139     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast32_t")
    4377                            .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$69)
    4378                            .dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
    4379                            .dwattr $C$DW$T$139, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4380                            .dwattr $C$DW$T$139, DW_AT_decl_line(0x4f)
    4381                            .dwattr $C$DW$T$139, DW_AT_decl_column(0x16)
    4382                    $C$DW$T$140     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast8_t")
    4383                            .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$69)
    4384                            .dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
    4385                            .dwattr $C$DW$T$140, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4386                            .dwattr $C$DW$T$140, DW_AT_decl_line(0x4a)
    4387                            .dwattr $C$DW$T$140, DW_AT_decl_column(0x16)
    4388                    $C$DW$T$141     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least32_t")
    4389                            .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$69)
    4390                            .dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
    4391                            .dwattr $C$DW$T$141, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4392                            .dwattr $C$DW$T$141, DW_AT_decl_line(0x3f)
    4393                            .dwattr $C$DW$T$141, DW_AT_decl_column(0x16)
    4394                    $C$DW$T$142     .dwtag  DW_TAG_typedef, DW_AT_name("uintptr_t")
    4395                            .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$11)
    4396                            .dwattr $C$DW$T$142, DW_AT_language(DW_LANG_C)
    4397                            .dwattr $C$DW$T$142, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4398                            .dwattr $C$DW$T$142, DW_AT_decl_line(0x59)
    4399                            .dwattr $C$DW$T$142, DW_AT_decl_column(0x1a)
    4400                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    4401                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    4402                            .dwattr $C$DW$T$12, DW_AT_name("__int40_t")
    4403                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x08)
    4404                            .dwattr $C$DW$T$12, DW_AT_bit_size(0x28)
    4405                            .dwattr $C$DW$T$12, DW_AT_bit_offset(0x18)
    4406                    $C$DW$T$144     .dwtag  DW_TAG_typedef, DW_AT_name("int40_t")
    4407                            .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$12)
    4408                            .dwattr $C$DW$T$144, DW_AT_language(DW_LANG_C)
    4409                            .dwattr $C$DW$T$144, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4410                            .dwattr $C$DW$T$144, DW_AT_decl_line(0x31)
    4411                            .dwattr $C$DW$T$144, DW_AT_decl_column(0x21)
    4412                    $C$DW$T$145     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast40_t")
    4413                            .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$144)
    4414                            .dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
    4415                            .dwattr $C$DW$T$145, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4416                            .dwattr $C$DW$T$145, DW_AT_decl_line(0x51)
    4417                            .dwattr $C$DW$T$145, DW_AT_decl_column(0x17)
    4418                    $C$DW$T$146     .dwtag  DW_TAG_typedef, DW_AT_name("int_least40_t")
    4419                            .dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$144)
    4420                            .dwattr $C$DW$T$146, DW_AT_language(DW_LANG_C)
    4421                            .dwattr $C$DW$T$146, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4422                            .dwattr $C$DW$T$146, DW_AT_decl_line(0x41)
    4423                            .dwattr $C$DW$T$146, DW_AT_decl_column(0x17)
    4424                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    4425                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    4426                            .dwattr $C$DW$T$13, DW_AT_name("unsigned __int40_t")
    4427                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x08)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_d.se66 PAGE   94

    4428                            .dwattr $C$DW$T$13, DW_AT_bit_size(0x28)
    4429                            .dwattr $C$DW$T$13, DW_AT_bit_offset(0x18)
    4430                    $C$DW$T$147     .dwtag  DW_TAG_typedef, DW_AT_name("uint40_t")
    4431                            .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$13)
    4432                            .dwattr $C$DW$T$147, DW_AT_language(DW_LANG_C)
    4433                            .dwattr $C$DW$T$147, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4434                            .dwattr $C$DW$T$147, DW_AT_decl_line(0x32)
    4435                            .dwattr $C$DW$T$147, DW_AT_decl_column(0x20)
    4436                    $C$DW$T$148     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast40_t")
    4437                            .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$147)
    4438                            .dwattr $C$DW$T$148, DW_AT_language(DW_LANG_C)
    4439                            .dwattr $C$DW$T$148, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4440                            .dwattr $C$DW$T$148, DW_AT_decl_line(0x52)
    4441                            .dwattr $C$DW$T$148, DW_AT_decl_column(0x16)
    4442                    $C$DW$T$149     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least40_t")
    4443                            .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$147)
    4444                            .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
    4445                            .dwattr $C$DW$T$149, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4446                            .dwattr $C$DW$T$149, DW_AT_decl_line(0x42)
    4447                            .dwattr $C$DW$T$149, DW_AT_decl_column(0x16)
    4448                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    4449                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    4450                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    4451                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    4452                    $C$DW$T$151     .dwtag  DW_TAG_typedef, DW_AT_name("int64_t")
    4453                            .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$14)
    4454                            .dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
    4455                            .dwattr $C$DW$T$151, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4456                            .dwattr $C$DW$T$151, DW_AT_decl_line(0x34)
    4457                            .dwattr $C$DW$T$151, DW_AT_decl_column(0x21)
    4458                    $C$DW$T$152     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast64_t")
    4459                            .dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$151)
    4460                            .dwattr $C$DW$T$152, DW_AT_language(DW_LANG_C)
    4461                            .dwattr $C$DW$T$152, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4462                            .dwattr $C$DW$T$152, DW_AT_decl_line(0x54)
    4463                            .dwattr $C$DW$T$152, DW_AT_decl_column(0x17)
    4464                    $C$DW$T$153     .dwtag  DW_TAG_typedef, DW_AT_name("int_least64_t")
    4465                            .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$151)
    4466                            .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    4467                            .dwattr $C$DW$T$153, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4468                            .dwattr $C$DW$T$153, DW_AT_decl_line(0x44)
    4469                            .dwattr $C$DW$T$153, DW_AT_decl_column(0x17)
    4470                    $C$DW$T$154     .dwtag  DW_TAG_typedef, DW_AT_name("intmax_t")
    4471                            .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$14)
    4472                            .dwattr $C$DW$T$154, DW_AT_language(DW_LANG_C)
    4473                            .dwattr $C$DW$T$154, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4474                            .dwattr $C$DW$T$154, DW_AT_decl_line(0x5c)
    4475                            .dwattr $C$DW$T$154, DW_AT_decl_column(0x20)
    4476                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    4477                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    4478                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    4479                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    4480                    $C$DW$T$156     .dwtag  DW_TAG_pointer_type
    4481                            .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$15)
    4482                            .dwattr $C$DW$T$156, DW_AT_address_class(0x20)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_d.se66 PAGE   95

    4483                    $C$DW$T$157     .dwtag  DW_TAG_typedef, DW_AT_name("uint64_t")
    4484                            .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$15)
    4485                            .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
    4486                            .dwattr $C$DW$T$157, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4487                            .dwattr $C$DW$T$157, DW_AT_decl_line(0x35)
    4488                            .dwattr $C$DW$T$157, DW_AT_decl_column(0x20)
    4489                    
    4490                    $C$DW$T$158     .dwtag  DW_TAG_array_type
    4491                            .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$157)
    4492                            .dwattr $C$DW$T$158, DW_AT_language(DW_LANG_C)
    4493                            .dwattr $C$DW$T$158, DW_AT_byte_size(0x10)
    4494                    $C$DW$359       .dwtag  DW_TAG_subrange_type
    4495                            .dwattr $C$DW$359, DW_AT_upper_bound(0x01)
    4496                            .dwendtag $C$DW$T$158
    4497                    
    4498                    $C$DW$T$159     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast64_t")
    4499                            .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$157)
    4500                            .dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
    4501                            .dwattr $C$DW$T$159, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4502                            .dwattr $C$DW$T$159, DW_AT_decl_line(0x55)
    4503                            .dwattr $C$DW$T$159, DW_AT_decl_column(0x16)
    4504                    $C$DW$T$160     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least64_t")
    4505                            .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$157)
    4506                            .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
    4507                            .dwattr $C$DW$T$160, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4508                            .dwattr $C$DW$T$160, DW_AT_decl_line(0x45)
    4509                            .dwattr $C$DW$T$160, DW_AT_decl_column(0x16)
    4510                    $C$DW$T$161     .dwtag  DW_TAG_typedef, DW_AT_name("uintmax_t")
    4511                            .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$15)
    4512                            .dwattr $C$DW$T$161, DW_AT_language(DW_LANG_C)
    4513                            .dwattr $C$DW$T$161, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4514                            .dwattr $C$DW$T$161, DW_AT_decl_line(0x5d)
    4515                            .dwattr $C$DW$T$161, DW_AT_decl_column(0x20)
    4516                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    4517                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    4518                            .dwattr $C$DW$T$16, DW_AT_name("float")
    4519                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    4520                    $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_F32")
    4521                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$16)
    4522                            .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    4523                            .dwattr $C$DW$T$22, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c6
    4524                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x5b)
    4525                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x0f)
    4526                    $C$DW$T$23      .dwtag  DW_TAG_pointer_type
    4527                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    4528                            .dwattr $C$DW$T$23, DW_AT_address_class(0x20)
    4529                    $C$DW$T$117     .dwtag  DW_TAG_restrict_type
    4530                            .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$23)
    4531                    $C$DW$T$162     .dwtag  DW_TAG_pointer_type
    4532                            .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$16)
    4533                            .dwattr $C$DW$T$162, DW_AT_address_class(0x20)
    4534                    $C$DW$T$163     .dwtag  DW_TAG_typedef, DW_AT_name("float32_t")
    4535                            .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$16)
    4536                            .dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
    4537                            .dwattr $C$DW$T$163, DW_AT_decl_file("C:\VLIB_Tools\CCSV5_4_0\ccsv5\tools\compiler\C6000\inclu
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_d.se66 PAGE   96

    4538                            .dwattr $C$DW$T$163, DW_AT_decl_line(0x30)
    4539                            .dwattr $C$DW$T$163, DW_AT_decl_column(0x0f)
    4540                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    4541                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    4542                            .dwattr $C$DW$T$17, DW_AT_name("double")
    4543                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    4544                    $C$DW$T$164     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_D64")
    4545                            .dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$17)
    4546                            .dwattr $C$DW$T$164, DW_AT_language(DW_LANG_C)
    4547                            .dwattr $C$DW$T$164, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_matchTemplate\..\common\c
    4548                            .dwattr $C$DW$T$164, DW_AT_decl_line(0x5a)
    4549                            .dwattr $C$DW$T$164, DW_AT_decl_column(0x10)
    4550                    $C$DW$T$167     .dwtag  DW_TAG_typedef, DW_AT_name("__float2_t")
    4551                            .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$17)
    4552                            .dwattr $C$DW$T$167, DW_AT_language(DW_LANG_C)
    4553                            .dwattr $C$DW$T$167, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4554                            .dwattr $C$DW$T$167, DW_AT_decl_line(0x5f)
    4555                            .dwattr $C$DW$T$167, DW_AT_decl_column(0x14)
    4556                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    4557                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    4558                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    4559                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    4560                    $C$DW$T$24      .dwtag  DW_TAG_base_type
    4561                            .dwattr $C$DW$T$24, DW_AT_encoding(DW_ATE_signed_char)
    4562                            .dwattr $C$DW$T$24, DW_AT_name("signed char")
    4563                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    4564                    $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    4565                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    4566                            .dwattr $C$DW$T$25, DW_AT_address_class(0x20)
    4567                    $C$DW$T$168     .dwtag  DW_TAG_typedef, DW_AT_name("va_list")
    4568                            .dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$25)
    4569                            .dwattr $C$DW$T$168, DW_AT_language(DW_LANG_C)
    4570                            .dwattr $C$DW$T$168, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4571                            .dwattr $C$DW$T$168, DW_AT_decl_line(0x2f)
    4572                            .dwattr $C$DW$T$168, DW_AT_decl_column(0x12)
    4573                    
    4574                    $C$DW$T$33      .dwtag  DW_TAG_array_type
    4575                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$24)
    4576                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4577                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x04)
    4578                    $C$DW$360       .dwtag  DW_TAG_subrange_type
    4579                            .dwattr $C$DW$360, DW_AT_upper_bound(0x03)
    4580                            .dwendtag $C$DW$T$33
    4581                    
    4582                    $C$DW$T$109     .dwtag  DW_TAG_const_type
    4583                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$24)
    4584                    $C$DW$T$110     .dwtag  DW_TAG_pointer_type
    4585                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    4586                            .dwattr $C$DW$T$110, DW_AT_address_class(0x20)
    4587                    
    4588                    $C$DW$T$169     .dwtag  DW_TAG_array_type
    4589                            .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$24)
    4590                            .dwattr $C$DW$T$169, DW_AT_language(DW_LANG_C)
    4591                    $C$DW$361       .dwtag  DW_TAG_subrange_type
    4592                            .dwendtag $C$DW$T$169
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_d.se66 PAGE   97

    4593                    
    4594                    
    4595                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4596                            .dwattr $C$DW$T$36, DW_AT_name("__simd128_int32_t")
    4597                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x10)
    4598                    $C$DW$362       .dwtag  DW_TAG_member
    4599                            .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$35)
    4600                            .dwattr $C$DW$362, DW_AT_name("_v")
    4601                            .dwattr $C$DW$362, DW_AT_TI_symbol_name("_v")
    4602                            .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4603                            .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    4604                            .dwattr $C$DW$362, DW_AT_decl_file("C:\VLIB_Tools\CCSV5_4_0\ccsv5\tools\compiler\C6000\include
    4605                            .dwattr $C$DW$362, DW_AT_decl_line(0x44)
    4606                            .dwattr $C$DW$362, DW_AT_decl_column(0x01)
    4607                            .dwendtag $C$DW$T$36
    4608                    
    4609                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:\VLIB_Tools\CCSV5_4_0\ccsv5\tools\compiler\C6000\includ
    4610                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x44)
    4611                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    4612                    $C$DW$T$170     .dwtag  DW_TAG_typedef, DW_AT_name("int32x4_t")
    4613                            .dwattr $C$DW$T$170, DW_AT_type(*$C$DW$T$36)
    4614                            .dwattr $C$DW$T$170, DW_AT_language(DW_LANG_C)
    4615                            .dwattr $C$DW$T$170, DW_AT_decl_file("C:\VLIB_Tools\CCSV5_4_0\ccsv5\tools\compiler\C6000\inclu
    4616                            .dwattr $C$DW$T$170, DW_AT_decl_line(0x44)
    4617                            .dwattr $C$DW$T$170, DW_AT_decl_column(0x01)
    4618                    $C$DW$T$171     .dwtag  DW_TAG_typedef, DW_AT_name("__x128_t")
    4619                            .dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$170)
    4620                            .dwattr $C$DW$T$171, DW_AT_language(DW_LANG_C)
    4621                            .dwattr $C$DW$T$171, DW_AT_decl_file("C:\VLIB_Tools\CCSV5_4_0\ccsv5\tools\compiler\C6000\inclu
    4622                            .dwattr $C$DW$T$171, DW_AT_decl_line(0x46)
    4623                            .dwattr $C$DW$T$171, DW_AT_decl_column(0x13)
    4624                    
    4625                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4626                            .dwattr $C$DW$T$37, DW_AT_name("tm")
    4627                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x24)
    4628                    $C$DW$363       .dwtag  DW_TAG_member
    4629                            .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$10)
    4630                            .dwattr $C$DW$363, DW_AT_name("tm_sec")
    4631                            .dwattr $C$DW$363, DW_AT_TI_symbol_name("tm_sec")
    4632                            .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4633                            .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    4634                            .dwattr $C$DW$363, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4635                            .dwattr $C$DW$363, DW_AT_decl_line(0x41)
    4636                            .dwattr $C$DW$363, DW_AT_decl_column(0x09)
    4637                    $C$DW$364       .dwtag  DW_TAG_member
    4638                            .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$10)
    4639                            .dwattr $C$DW$364, DW_AT_name("tm_min")
    4640                            .dwattr $C$DW$364, DW_AT_TI_symbol_name("tm_min")
    4641                            .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4642                            .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    4643                            .dwattr $C$DW$364, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4644                            .dwattr $C$DW$364, DW_AT_decl_line(0x42)
    4645                            .dwattr $C$DW$364, DW_AT_decl_column(0x09)
    4646                    $C$DW$365       .dwtag  DW_TAG_member
    4647                            .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$10)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_d.se66 PAGE   98

    4648                            .dwattr $C$DW$365, DW_AT_name("tm_hour")
    4649                            .dwattr $C$DW$365, DW_AT_TI_symbol_name("tm_hour")
    4650                            .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4651                            .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    4652                            .dwattr $C$DW$365, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4653                            .dwattr $C$DW$365, DW_AT_decl_line(0x43)
    4654                            .dwattr $C$DW$365, DW_AT_decl_column(0x09)
    4655                    $C$DW$366       .dwtag  DW_TAG_member
    4656                            .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$10)
    4657                            .dwattr $C$DW$366, DW_AT_name("tm_mday")
    4658                            .dwattr $C$DW$366, DW_AT_TI_symbol_name("tm_mday")
    4659                            .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4660                            .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    4661                            .dwattr $C$DW$366, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4662                            .dwattr $C$DW$366, DW_AT_decl_line(0x44)
    4663                            .dwattr $C$DW$366, DW_AT_decl_column(0x09)
    4664                    $C$DW$367       .dwtag  DW_TAG_member
    4665                            .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$10)
    4666                            .dwattr $C$DW$367, DW_AT_name("tm_mon")
    4667                            .dwattr $C$DW$367, DW_AT_TI_symbol_name("tm_mon")
    4668                            .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4669                            .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    4670                            .dwattr $C$DW$367, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4671                            .dwattr $C$DW$367, DW_AT_decl_line(0x45)
    4672                            .dwattr $C$DW$367, DW_AT_decl_column(0x09)
    4673                    $C$DW$368       .dwtag  DW_TAG_member
    4674                            .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$10)
    4675                            .dwattr $C$DW$368, DW_AT_name("tm_year")
    4676                            .dwattr $C$DW$368, DW_AT_TI_symbol_name("tm_year")
    4677                            .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4678                            .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4679                            .dwattr $C$DW$368, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4680                            .dwattr $C$DW$368, DW_AT_decl_line(0x46)
    4681                            .dwattr $C$DW$368, DW_AT_decl_column(0x09)
    4682                    $C$DW$369       .dwtag  DW_TAG_member
    4683                            .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$10)
    4684                            .dwattr $C$DW$369, DW_AT_name("tm_wday")
    4685                            .dwattr $C$DW$369, DW_AT_TI_symbol_name("tm_wday")
    4686                            .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4687                            .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4688                            .dwattr $C$DW$369, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4689                            .dwattr $C$DW$369, DW_AT_decl_line(0x47)
    4690                            .dwattr $C$DW$369, DW_AT_decl_column(0x09)
    4691                    $C$DW$370       .dwtag  DW_TAG_member
    4692                            .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$10)
    4693                            .dwattr $C$DW$370, DW_AT_name("tm_yday")
    4694                            .dwattr $C$DW$370, DW_AT_TI_symbol_name("tm_yday")
    4695                            .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4696                            .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4697                            .dwattr $C$DW$370, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4698                            .dwattr $C$DW$370, DW_AT_decl_line(0x48)
    4699                            .dwattr $C$DW$370, DW_AT_decl_column(0x09)
    4700                    $C$DW$371       .dwtag  DW_TAG_member
    4701                            .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$10)
    4702                            .dwattr $C$DW$371, DW_AT_name("tm_isdst")
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:12:06 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_matchTemplate/VLIB_matchTemplate_d.se66 PAGE   99

    4703                            .dwattr $C$DW$371, DW_AT_TI_symbol_name("tm_isdst")
    4704                            .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4705                            .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4706                            .dwattr $C$DW$371, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4707                            .dwattr $C$DW$371, DW_AT_decl_line(0x49)
    4708                            .dwattr $C$DW$371, DW_AT_decl_column(0x09)
    4709                            .dwendtag $C$DW$T$37
    4710                    
    4711                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4712                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x3f)
    4713                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x08)
