TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsDense/VLIB_haarDetectObjectsDense_d.se66 PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v7.4.2 *
       3                    ;* Date/Time created: Sat Sep 26 11:10:15 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --c64p_l1d_workaround=off --endian=little --hll_source=on --long_pre
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C66xx                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *

    2965                            .dwattr $C$DW$260, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\../c
    2966                            .dwattr $C$DW$260, DW_AT_decl_line(0x6c)
    2967                            .dwattr $C$DW$260, DW_AT_decl_column(0x05)
    2968                            .dwendtag $C$DW$T$59
    2969                    
    2970                            .dwattr $C$DW$T$59, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\../
    2971                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x69)
    2972                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x06)
    2973                    
    2974                    $C$DW$T$60      .dwtag  DW_TAG_enumeration_type
    2975                            .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    2976                    $C$DW$261       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_FAIL"), DW_AT_const_value(0x00)
    2977                            .dwattr $C$DW$261, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\../c
    2978                            .dwattr $C$DW$261, DW_AT_decl_line(0x72)
    2979                            .dwattr $C$DW$261, DW_AT_decl_column(0x05)
    2980                    $C$DW$262       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_PASS"), DW_AT_const_value(0x01)
    2981                            .dwattr $C$DW$262, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\../c
    2982                            .dwattr $C$DW$262, DW_AT_decl_line(0x73)
    2983                            .dwattr $C$DW$262, DW_AT_decl_column(0x05)
    2984                            .dwendtag $C$DW$T$60
    2985                    
    2986                            .dwattr $C$DW$T$60, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\../
    2987                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x71)
    2988                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x06)
    2989                    
    2990                    $C$DW$T$61      .dwtag  DW_TAG_enumeration_type
    2991                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    2992                    $C$DW$263       .dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_HAAR_X2"), DW_AT_const_value(0x01)
    2993                            .dwattr $C$DW$263, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    2994                            .dwattr $C$DW$263, DW_AT_decl_line(0x76)
    2995                            .dwattr $C$DW$263, DW_AT_decl_column(0x05)
    2996                    $C$DW$264       .dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_HAAR_Y2"), DW_AT_const_value(0x02)
    2997                            .dwattr $C$DW$264, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    2998                            .dwattr $C$DW$264, DW_AT_decl_line(0x77)
    2999                            .dwattr $C$DW$264, DW_AT_decl_column(0x05)
    3000                    $C$DW$265       .dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_HAAR_X2_Y2"), DW_AT_const_value(0x03)
    3001                            .dwattr $C$DW$265, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    3002                            .dwattr $C$DW$265, DW_AT_decl_line(0x78)
    3003                            .dwattr $C$DW$265, DW_AT_decl_column(0x05)
    3004                    $C$DW$266       .dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_HAAR_GEN2"), DW_AT_const_value(0x04)
    3005                            .dwattr $C$DW$266, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    3006                            .dwattr $C$DW$266, DW_AT_decl_line(0x79)
    3007                            .dwattr $C$DW$266, DW_AT_decl_column(0x05)
    3008                    $C$DW$267       .dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_HAAR_GEN3"), DW_AT_const_value(0x05)
    3009                            .dwattr $C$DW$267, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    3010                            .dwattr $C$DW$267, DW_AT_decl_line(0x7a)
    3011                            .dwattr $C$DW$267, DW_AT_decl_column(0x05)
    3012                            .dwendtag $C$DW$T$61
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsDense/VLIB_haarDetectObjectsDense_d.se66 PAGE   67

    3013                    
    3014                            .dwattr $C$DW$T$61, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66
    3015                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x75)
    3016                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x0e)
    3017                    $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_HAARDETOBJ_rectType")
    3018                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    3019                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3020                            .dwattr $C$DW$T$62, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66
    3021                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x7b)
    3022                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    3023                    
    3024                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
    3025                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
    3026                    $C$DW$268       .dwtag  DW_TAG_member
    3027                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    3028                            .dwattr $C$DW$268, DW_AT_name("offsetTL")
    3029                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("offsetTL")
    3030                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3031                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3032                            .dwattr $C$DW$268, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    3033                            .dwattr $C$DW$268, DW_AT_decl_line(0x41)
    3034                            .dwattr $C$DW$268, DW_AT_decl_column(0x0d)
    3035                    $C$DW$269       .dwtag  DW_TAG_member
    3036                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    3037                            .dwattr $C$DW$269, DW_AT_name("offsetTR")
    3038                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("offsetTR")
    3039                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3040                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3041                            .dwattr $C$DW$269, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    3042                            .dwattr $C$DW$269, DW_AT_decl_line(0x42)
    3043                            .dwattr $C$DW$269, DW_AT_decl_column(0x0d)
    3044                    $C$DW$270       .dwtag  DW_TAG_member
    3045                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    3046                            .dwattr $C$DW$270, DW_AT_name("offsetBL")
    3047                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("offsetBL")
    3048                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3049                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3050                            .dwattr $C$DW$270, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    3051                            .dwattr $C$DW$270, DW_AT_decl_line(0x43)
    3052                            .dwattr $C$DW$270, DW_AT_decl_column(0x0d)
    3053                    $C$DW$271       .dwtag  DW_TAG_member
    3054                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$19)
    3055                            .dwattr $C$DW$271, DW_AT_name("offsetBR")
    3056                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("offsetBR")
    3057                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3058                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3059                            .dwattr $C$DW$271, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    3060                            .dwattr $C$DW$271, DW_AT_decl_line(0x44)
    3061                            .dwattr $C$DW$271, DW_AT_decl_column(0x0d)
    3062                            .dwendtag $C$DW$T$20
    3063                    
    3064                            .dwattr $C$DW$T$20, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66
    3065                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x40)
    3066                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    3067                    $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_HAARDETOBJ_sRect")
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsDense/VLIB_haarDetectObjectsDense_d.se66 PAGE   68

    3068                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$20)
    3069                            .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    3070                            .dwattr $C$DW$T$24, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66
    3071                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x45)
    3072                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x03)
    3073                    
    3074                    $C$DW$T$25      .dwtag  DW_TAG_array_type
    3075                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    3076                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    3077                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x18)
    3078                    $C$DW$272       .dwtag  DW_TAG_subrange_type
    3079                            .dwattr $C$DW$272, DW_AT_upper_bound(0x02)
    3080                            .dwendtag $C$DW$T$25
    3081                    
    3082                    
    3083                    $C$DW$T$26      .dwtag  DW_TAG_array_type
    3084                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$24)
    3085                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    3086                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x48)
    3087                    $C$DW$273       .dwtag  DW_TAG_subrange_type
    3088                            .dwattr $C$DW$273, DW_AT_upper_bound(0x02)
    3089                    $C$DW$274       .dwtag  DW_TAG_subrange_type
    3090                            .dwattr $C$DW$274, DW_AT_upper_bound(0x02)
    3091                            .dwendtag $C$DW$T$26
    3092                    
    3093                    
    3094                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3095                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x78)
    3096                    $C$DW$275       .dwtag  DW_TAG_member
    3097                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$23)
    3098                            .dwattr $C$DW$275, DW_AT_name("weight")
    3099                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("weight")
    3100                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3101                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3102                            .dwattr $C$DW$275, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    3103                            .dwattr $C$DW$275, DW_AT_decl_line(0xae)
    3104                            .dwattr $C$DW$275, DW_AT_decl_column(0x1b)
    3105                    $C$DW$276       .dwtag  DW_TAG_member
    3106                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    3107                            .dwattr $C$DW$276, DW_AT_name("numNodes")
    3108                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("numNodes")
    3109                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3110                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3111                            .dwattr $C$DW$276, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    3112                            .dwattr $C$DW$276, DW_AT_decl_line(0xaf)
    3113                            .dwattr $C$DW$276, DW_AT_decl_column(0x1b)
    3114                    $C$DW$277       .dwtag  DW_TAG_member
    3115                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$26)
    3116                            .dwattr $C$DW$277, DW_AT_name("rect")
    3117                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("rect")
    3118                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3119                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3120                            .dwattr $C$DW$277, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    3121                            .dwattr $C$DW$277, DW_AT_decl_line(0xb0)
    3122                            .dwattr $C$DW$277, DW_AT_decl_column(0x1b)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsDense/VLIB_haarDetectObjectsDense_d.se66 PAGE   69

    3123                    $C$DW$278       .dwtag  DW_TAG_member
    3124                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$28)
    3125                            .dwattr $C$DW$278, DW_AT_name("alpha")
    3126                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("alpha")
    3127                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3128                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3129                            .dwattr $C$DW$278, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    3130                            .dwattr $C$DW$278, DW_AT_decl_line(0xb1)
    3131                            .dwattr $C$DW$278, DW_AT_decl_column(0x1b)
    3132                    $C$DW$279       .dwtag  DW_TAG_member
    3133                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$29)
    3134                            .dwattr $C$DW$279, DW_AT_name("result")
    3135                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("result")
    3136                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    3137                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3138                            .dwattr $C$DW$279, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    3139                            .dwattr $C$DW$279, DW_AT_decl_line(0xb2)
    3140                            .dwattr $C$DW$279, DW_AT_decl_column(0x1b)
    3141                    $C$DW$280       .dwtag  DW_TAG_member
    3142                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$30)
    3143                            .dwattr $C$DW$280, DW_AT_name("rectType")
    3144                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("rectType")
    3145                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    3146                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3147                            .dwattr $C$DW$280, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    3148                            .dwattr $C$DW$280, DW_AT_decl_line(0xb3)
    3149                            .dwattr $C$DW$280, DW_AT_decl_column(0x1b)
    3150                            .dwendtag $C$DW$T$31
    3151                    
    3152                            .dwattr $C$DW$T$31, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66
    3153                            .dwattr $C$DW$T$31, DW_AT_decl_line(0xad)
    3154                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    3155                    $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_HAARDETOBJ_sTree")
    3156                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$31)
    3157                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3158                            .dwattr $C$DW$T$35, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66
    3159                            .dwattr $C$DW$T$35, DW_AT_decl_line(0xb4)
    3160                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
    3161                    $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    3162                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    3163                            .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
    3164                    
    3165                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3166                            .dwattr $C$DW$T$37, DW_AT_byte_size(0xd4)
    3167                    $C$DW$281       .dwtag  DW_TAG_member
    3168                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$27)
    3169                            .dwattr $C$DW$281, DW_AT_name("numStages")
    3170                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("numStages")
    3171                            .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3172                            .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3173                            .dwattr $C$DW$281, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    3174                            .dwattr $C$DW$281, DW_AT_decl_line(0xce)
    3175                            .dwattr $C$DW$281, DW_AT_decl_column(0x1c)
    3176                    $C$DW$282       .dwtag  DW_TAG_member
    3177                            .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$27)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsDense/VLIB_haarDetectObjectsDense_d.se66 PAGE   70

    3178                            .dwattr $C$DW$282, DW_AT_name("maxNodesPerTree")
    3179                            .dwattr $C$DW$282, DW_AT_TI_symbol_name("maxNodesPerTree")
    3180                            .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3181                            .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3182                            .dwattr $C$DW$282, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    3183                            .dwattr $C$DW$282, DW_AT_decl_line(0xcf)
    3184                            .dwattr $C$DW$282, DW_AT_decl_column(0x1c)
    3185                    $C$DW$283       .dwtag  DW_TAG_member
    3186                            .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$32)
    3187                            .dwattr $C$DW$283, DW_AT_name("patchSize")
    3188                            .dwattr $C$DW$283, DW_AT_TI_symbol_name("patchSize")
    3189                            .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3190                            .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3191                            .dwattr $C$DW$283, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    3192                            .dwattr $C$DW$283, DW_AT_decl_line(0xd0)
    3193                            .dwattr $C$DW$283, DW_AT_decl_column(0x1c)
    3194                    $C$DW$284       .dwtag  DW_TAG_member
    3195                            .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$33)
    3196                            .dwattr $C$DW$284, DW_AT_name("numTrees")
    3197                            .dwattr $C$DW$284, DW_AT_TI_symbol_name("numTrees")
    3198                            .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3199                            .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3200                            .dwattr $C$DW$284, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    3201                            .dwattr $C$DW$284, DW_AT_decl_line(0xd1)
    3202                            .dwattr $C$DW$284, DW_AT_decl_column(0x1c)
    3203                    $C$DW$285       .dwtag  DW_TAG_member
    3204                            .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$33)
    3205                            .dwattr $C$DW$285, DW_AT_name("maxRectangle")
    3206                            .dwattr $C$DW$285, DW_AT_TI_symbol_name("maxRectangle")
    3207                            .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3208                            .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3209                            .dwattr $C$DW$285, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    3210                            .dwattr $C$DW$285, DW_AT_decl_line(0xd2)
    3211                            .dwattr $C$DW$285, DW_AT_decl_column(0x1c)
    3212                    $C$DW$286       .dwtag  DW_TAG_member
    3213                            .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$34)
    3214                            .dwattr $C$DW$286, DW_AT_name("stageTh")
    3215                            .dwattr $C$DW$286, DW_AT_TI_symbol_name("stageTh")
    3216                            .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3217                            .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3218                            .dwattr $C$DW$286, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    3219                            .dwattr $C$DW$286, DW_AT_decl_line(0xd3)
    3220                            .dwattr $C$DW$286, DW_AT_decl_column(0x1c)
    3221                    $C$DW$287       .dwtag  DW_TAG_member
    3222                            .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$36)
    3223                            .dwattr $C$DW$287, DW_AT_name("tree")
    3224                            .dwattr $C$DW$287, DW_AT_TI_symbol_name("tree")
    3225                            .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3226                            .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3227                            .dwattr $C$DW$287, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    3228                            .dwattr $C$DW$287, DW_AT_decl_line(0xd4)
    3229                            .dwattr $C$DW$287, DW_AT_decl_column(0x1c)
    3230                            .dwendtag $C$DW$T$37
    3231                    
    3232                            .dwattr $C$DW$T$37, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsDense/VLIB_haarDetectObjectsDense_d.se66 PAGE   71

    3233                            .dwattr $C$DW$T$37, DW_AT_decl_line(0xcd)
    3234                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    3235                    $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_HAARDETOBJ_sClassifier")
    3236                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$37)
    3237                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3238                            .dwattr $C$DW$T$41, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66
    3239                            .dwattr $C$DW$T$41, DW_AT_decl_line(0xd5)
    3240                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x03)
    3241                    $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    3242                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    3243                            .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    3244                    $C$DW$T$63      .dwtag  DW_TAG_restrict_type
    3245                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$42)
    3246                    
    3247                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3248                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x08)
    3249                    $C$DW$288       .dwtag  DW_TAG_member
    3250                            .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
    3251                            .dwattr $C$DW$288, DW_AT_name("numObjects")
    3252                            .dwattr $C$DW$288, DW_AT_TI_symbol_name("numObjects")
    3253                            .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3254                            .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3255                            .dwattr $C$DW$288, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    3256                            .dwattr $C$DW$288, DW_AT_decl_line(0xe5)
    3257                            .dwattr $C$DW$288, DW_AT_decl_column(0x0f)
    3258                    $C$DW$289       .dwtag  DW_TAG_member
    3259                            .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$39)
    3260                            .dwattr $C$DW$289, DW_AT_name("objectPos")
    3261                            .dwattr $C$DW$289, DW_AT_TI_symbol_name("objectPos")
    3262                            .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3263                            .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3264                            .dwattr $C$DW$289, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66\
    3265                            .dwattr $C$DW$289, DW_AT_decl_line(0xe6)
    3266                            .dwattr $C$DW$289, DW_AT_decl_column(0x0f)
    3267                            .dwendtag $C$DW$T$40
    3268                    
    3269                            .dwattr $C$DW$T$40, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66
    3270                            .dwattr $C$DW$T$40, DW_AT_decl_line(0xe4)
    3271                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    3272                    $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_HAARDETOBJ_sObjectList")
    3273                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$40)
    3274                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    3275                            .dwattr $C$DW$T$65, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\c66
    3276                            .dwattr $C$DW$T$65, DW_AT_decl_line(0xe7)
    3277                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    3278                    $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    3279                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    3280                            .dwattr $C$DW$T$66, DW_AT_address_class(0x20)
    3281                    $C$DW$T$67      .dwtag  DW_TAG_restrict_type
    3282                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    3283                    
    3284                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    3285                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x30)
    3286                    $C$DW$290       .dwtag  DW_TAG_member
    3287                            .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$21)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsDense/VLIB_haarDetectObjectsDense_d.se66 PAGE   72

    3288                            .dwattr $C$DW$290, DW_AT_name("testPattern")
    3289                            .dwattr $C$DW$290, DW_AT_TI_symbol_name("testPattern")
    3290                            .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3291                            .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3292                            .dwattr $C$DW$290, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\VLIB
    3293                            .dwattr $C$DW$290, DW_AT_decl_line(0x26)
    3294                            .dwattr $C$DW$290, DW_AT_decl_column(0x22)
    3295                    $C$DW$291       .dwtag  DW_TAG_member
    3296                            .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$39)
    3297                            .dwattr $C$DW$291, DW_AT_name("integralImg")
    3298                            .dwattr $C$DW$291, DW_AT_TI_symbol_name("integralImg")
    3299                            .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3300                            .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3301                            .dwattr $C$DW$291, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\VLIB
    3302                            .dwattr $C$DW$291, DW_AT_decl_line(0x27)
    3303                            .dwattr $C$DW$291, DW_AT_decl_column(0x22)
    3304                    $C$DW$292       .dwtag  DW_TAG_member
    3305                            .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$27)
    3306                            .dwattr $C$DW$292, DW_AT_name("integralImgWidth")
    3307                            .dwattr $C$DW$292, DW_AT_TI_symbol_name("integralImgWidth")
    3308                            .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3309                            .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3310                            .dwattr $C$DW$292, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\VLIB
    3311                            .dwattr $C$DW$292, DW_AT_decl_line(0x28)
    3312                            .dwattr $C$DW$292, DW_AT_decl_column(0x22)
    3313                    $C$DW$293       .dwtag  DW_TAG_member
    3314                            .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$27)
    3315                            .dwattr $C$DW$293, DW_AT_name("integralImgHeight")
    3316                            .dwattr $C$DW$293, DW_AT_TI_symbol_name("integralImgHeight")
    3317                            .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3318                            .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3319                            .dwattr $C$DW$293, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\VLIB
    3320                            .dwattr $C$DW$293, DW_AT_decl_line(0x29)
    3321                            .dwattr $C$DW$293, DW_AT_decl_column(0x22)
    3322                    $C$DW$294       .dwtag  DW_TAG_member
    3323                            .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$27)
    3324                            .dwattr $C$DW$294, DW_AT_name("integralImgPitch")
    3325                            .dwattr $C$DW$294, DW_AT_TI_symbol_name("integralImgPitch")
    3326                            .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3327                            .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3328                            .dwattr $C$DW$294, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\VLIB
    3329                            .dwattr $C$DW$294, DW_AT_decl_line(0x2a)
    3330                            .dwattr $C$DW$294, DW_AT_decl_column(0x22)
    3331                    $C$DW$295       .dwtag  DW_TAG_member
    3332                            .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$27)
    3333                            .dwattr $C$DW$295, DW_AT_name("startStage")
    3334                            .dwattr $C$DW$295, DW_AT_TI_symbol_name("startStage")
    3335                            .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3336                            .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3337                            .dwattr $C$DW$295, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\VLIB
    3338                            .dwattr $C$DW$295, DW_AT_decl_line(0x2b)
    3339                            .dwattr $C$DW$295, DW_AT_decl_column(0x22)
    3340                    $C$DW$296       .dwtag  DW_TAG_member
    3341                            .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$27)
    3342                            .dwattr $C$DW$296, DW_AT_name("endStage")
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsDense/VLIB_haarDetectObjectsDense_d.se66 PAGE   73

    3343                            .dwattr $C$DW$296, DW_AT_TI_symbol_name("endStage")
    3344                            .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3345                            .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3346                            .dwattr $C$DW$296, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\VLIB
    3347                            .dwattr $C$DW$296, DW_AT_decl_line(0x2c)
    3348                            .dwattr $C$DW$296, DW_AT_decl_column(0x22)
    3349                    $C$DW$297       .dwtag  DW_TAG_member
    3350                            .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$27)
    3351                            .dwattr $C$DW$297, DW_AT_name("dualIntImgFlow")
    3352                            .dwattr $C$DW$297, DW_AT_TI_symbol_name("dualIntImgFlow")
    3353                            .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3354                            .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3355                            .dwattr $C$DW$297, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\VLIB
    3356                            .dwattr $C$DW$297, DW_AT_decl_line(0x2d)
    3357                            .dwattr $C$DW$297, DW_AT_decl_column(0x22)
    3358                    $C$DW$298       .dwtag  DW_TAG_member
    3359                            .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$27)
    3360                            .dwattr $C$DW$298, DW_AT_name("maxObjects")
    3361                            .dwattr $C$DW$298, DW_AT_TI_symbol_name("maxObjects")
    3362                            .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3363                            .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3364                            .dwattr $C$DW$298, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\VLIB
    3365                            .dwattr $C$DW$298, DW_AT_decl_line(0x2e)
    3366                            .dwattr $C$DW$298, DW_AT_decl_column(0x22)
    3367                    $C$DW$299       .dwtag  DW_TAG_member
    3368                            .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$42)
    3369                            .dwattr $C$DW$299, DW_AT_name("classifier")
    3370                            .dwattr $C$DW$299, DW_AT_TI_symbol_name("classifier")
    3371                            .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3372                            .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3373                            .dwattr $C$DW$299, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\VLIB
    3374                            .dwattr $C$DW$299, DW_AT_decl_line(0x2f)
    3375                            .dwattr $C$DW$299, DW_AT_decl_column(0x22)
    3376                    $C$DW$300       .dwtag  DW_TAG_member
    3377                            .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$39)
    3378                            .dwattr $C$DW$300, DW_AT_name("objectPos")
    3379                            .dwattr $C$DW$300, DW_AT_TI_symbol_name("objectPos")
    3380                            .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3381                            .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3382                            .dwattr $C$DW$300, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\VLIB
    3383                            .dwattr $C$DW$300, DW_AT_decl_line(0x30)
    3384                            .dwattr $C$DW$300, DW_AT_decl_column(0x22)
    3385                    $C$DW$301       .dwtag  DW_TAG_member
    3386                            .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$44)
    3387                            .dwattr $C$DW$301, DW_AT_name("desc")
    3388                            .dwattr $C$DW$301, DW_AT_TI_symbol_name("desc")
    3389                            .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3390                            .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3391                            .dwattr $C$DW$301, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\VLIB
    3392                            .dwattr $C$DW$301, DW_AT_decl_line(0x31)
    3393                            .dwattr $C$DW$301, DW_AT_decl_column(0x22)
    3394                            .dwendtag $C$DW$T$45
    3395                    
    3396                            .dwattr $C$DW$T$45, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\VLI
    3397                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x25)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsDense/VLIB_haarDetectObjectsDense_d.se66 PAGE   74

    3398                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
    3399                    $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    3400                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$45)
    3401                            .dwattr $C$DW$T$69, DW_AT_address_class(0x20)
    3402                    $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("haarDetectObjectsDense_testParams_t")
    3403                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$45)
    3404                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    3405                            .dwattr $C$DW$T$71, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\VLI
    3406                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x32)
    3407                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    3408                    $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    3409                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    3410                            .dwattr $C$DW$T$72, DW_AT_address_class(0x20)
    3411                    $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    3412                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    3413                            .dwattr $C$DW$T$73, DW_AT_address_class(0x20)
    3414                    
    3415                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    3416                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x18)
    3417                    $C$DW$302       .dwtag  DW_TAG_member
    3418                            .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$10)
    3419                            .dwattr $C$DW$302, DW_AT_name("fd")
    3420                            .dwattr $C$DW$302, DW_AT_TI_symbol_name("fd")
    3421                            .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3422                            .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3423                            .dwattr $C$DW$302, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3424                            .dwattr $C$DW$302, DW_AT_decl_line(0x49)
    3425                            .dwattr $C$DW$302, DW_AT_decl_column(0x0b)
    3426                    $C$DW$303       .dwtag  DW_TAG_member
    3427                            .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$46)
    3428                            .dwattr $C$DW$303, DW_AT_name("buf")
    3429                            .dwattr $C$DW$303, DW_AT_TI_symbol_name("buf")
    3430                            .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3431                            .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3432                            .dwattr $C$DW$303, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3433                            .dwattr $C$DW$303, DW_AT_decl_line(0x4a)
    3434                            .dwattr $C$DW$303, DW_AT_decl_column(0x16)
    3435                    $C$DW$304       .dwtag  DW_TAG_member
    3436                            .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$46)
    3437                            .dwattr $C$DW$304, DW_AT_name("pos")
    3438                            .dwattr $C$DW$304, DW_AT_TI_symbol_name("pos")
    3439                            .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3440                            .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3441                            .dwattr $C$DW$304, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3442                            .dwattr $C$DW$304, DW_AT_decl_line(0x4b)
    3443                            .dwattr $C$DW$304, DW_AT_decl_column(0x16)
    3444                    $C$DW$305       .dwtag  DW_TAG_member
    3445                            .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$46)
    3446                            .dwattr $C$DW$305, DW_AT_name("bufend")
    3447                            .dwattr $C$DW$305, DW_AT_TI_symbol_name("bufend")
    3448                            .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3449                            .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3450                            .dwattr $C$DW$305, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3451                            .dwattr $C$DW$305, DW_AT_decl_line(0x4c)
    3452                            .dwattr $C$DW$305, DW_AT_decl_column(0x16)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsDense/VLIB_haarDetectObjectsDense_d.se66 PAGE   75

    3453                    $C$DW$306       .dwtag  DW_TAG_member
    3454                            .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$46)
    3455                            .dwattr $C$DW$306, DW_AT_name("buff_stop")
    3456                            .dwattr $C$DW$306, DW_AT_TI_symbol_name("buff_stop")
    3457                            .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3458                            .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3459                            .dwattr $C$DW$306, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3460                            .dwattr $C$DW$306, DW_AT_decl_line(0x4d)
    3461                            .dwattr $C$DW$306, DW_AT_decl_column(0x16)
    3462                    $C$DW$307       .dwtag  DW_TAG_member
    3463                            .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$11)
    3464                            .dwattr $C$DW$307, DW_AT_name("flags")
    3465                            .dwattr $C$DW$307, DW_AT_TI_symbol_name("flags")
    3466                            .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3467                            .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3468                            .dwattr $C$DW$307, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3469                            .dwattr $C$DW$307, DW_AT_decl_line(0x4e)
    3470                            .dwattr $C$DW$307, DW_AT_decl_column(0x16)
    3471                            .dwendtag $C$DW$T$47
    3472                    
    3473                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3474                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x48)
    3475                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x10)
    3476                    $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    3477                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$47)
    3478                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    3479                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3480                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x4f)
    3481                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    3482                    
    3483                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    3484                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x08)
    3485                    $C$DW$308       .dwtag  DW_TAG_member
    3486                            .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$10)
    3487                            .dwattr $C$DW$308, DW_AT_name("quot")
    3488                            .dwattr $C$DW$308, DW_AT_TI_symbol_name("quot")
    3489                            .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3490                            .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3491                            .dwattr $C$DW$308, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3492                            .dwattr $C$DW$308, DW_AT_decl_line(0x3e)
    3493                            .dwattr $C$DW$308, DW_AT_decl_column(0x16)
    3494                    $C$DW$309       .dwtag  DW_TAG_member
    3495                            .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$10)
    3496                            .dwattr $C$DW$309, DW_AT_name("rem")
    3497                            .dwattr $C$DW$309, DW_AT_TI_symbol_name("rem")
    3498                            .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3499                            .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3500                            .dwattr $C$DW$309, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3501                            .dwattr $C$DW$309, DW_AT_decl_line(0x3e)
    3502                            .dwattr $C$DW$309, DW_AT_decl_column(0x1c)
    3503                            .dwendtag $C$DW$T$48
    3504                    
    3505                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3506                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x3e)
    3507                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x10)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsDense/VLIB_haarDetectObjectsDense_d.se66 PAGE   76

    3508                    $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    3509                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$48)
    3510                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3511                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3512                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x3e)
    3513                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x23)
    3514                    
    3515                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    3516                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x08)
    3517                    $C$DW$310       .dwtag  DW_TAG_member
    3518                            .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$10)
    3519                            .dwattr $C$DW$310, DW_AT_name("quot")
    3520                            .dwattr $C$DW$310, DW_AT_TI_symbol_name("quot")
    3521                            .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3522                            .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3523                            .dwattr $C$DW$310, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3524                            .dwattr $C$DW$310, DW_AT_decl_line(0x40)
    3525                            .dwattr $C$DW$310, DW_AT_decl_column(0x17)
    3526                    $C$DW$311       .dwtag  DW_TAG_member
    3527                            .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$10)
    3528                            .dwattr $C$DW$311, DW_AT_name("rem")
    3529                            .dwattr $C$DW$311, DW_AT_TI_symbol_name("rem")
    3530                            .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3531                            .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3532                            .dwattr $C$DW$311, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3533                            .dwattr $C$DW$311, DW_AT_decl_line(0x40)
    3534                            .dwattr $C$DW$311, DW_AT_decl_column(0x1d)
    3535                            .dwendtag $C$DW$T$49
    3536                    
    3537                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3538                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x40)
    3539                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x10)
    3540                    $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    3541                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$49)
    3542                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    3543                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3544                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x40)
    3545                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x24)
    3546                    
    3547                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    3548                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x10)
    3549                    $C$DW$312       .dwtag  DW_TAG_member
    3550                            .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$14)
    3551                            .dwattr $C$DW$312, DW_AT_name("quot")
    3552                            .dwattr $C$DW$312, DW_AT_TI_symbol_name("quot")
    3553                            .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3554                            .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3555                            .dwattr $C$DW$312, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3556                            .dwattr $C$DW$312, DW_AT_decl_line(0x43)
    3557                            .dwattr $C$DW$312, DW_AT_decl_column(0x1c)
    3558                    $C$DW$313       .dwtag  DW_TAG_member
    3559                            .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$14)
    3560                            .dwattr $C$DW$313, DW_AT_name("rem")
    3561                            .dwattr $C$DW$313, DW_AT_TI_symbol_name("rem")
    3562                            .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsDense/VLIB_haarDetectObjectsDense_d.se66 PAGE   77

    3563                            .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3564                            .dwattr $C$DW$313, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3565                            .dwattr $C$DW$313, DW_AT_decl_line(0x43)
    3566                            .dwattr $C$DW$313, DW_AT_decl_column(0x22)
    3567                            .dwendtag $C$DW$T$50
    3568                    
    3569                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3570                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x43)
    3571                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
    3572                    $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    3573                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$50)
    3574                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    3575                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3576                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x43)
    3577                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x29)
    3578                    
    3579                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    3580                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x24)
    3581                    $C$DW$314       .dwtag  DW_TAG_member
    3582                            .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$27)
    3583                            .dwattr $C$DW$314, DW_AT_name("area")
    3584                            .dwattr $C$DW$314, DW_AT_TI_symbol_name("area")
    3585                            .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3586                            .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3587                            .dwattr $C$DW$314, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\..\c
    3588                            .dwattr $C$DW$314, DW_AT_decl_line(0x69)
    3589                            .dwattr $C$DW$314, DW_AT_decl_column(0x0d)
    3590                    $C$DW$315       .dwtag  DW_TAG_member
    3591                            .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$27)
    3592                            .dwattr $C$DW$315, DW_AT_name("xsum")
    3593                            .dwattr $C$DW$315, DW_AT_TI_symbol_name("xsum")
    3594                            .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3595                            .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3596                            .dwattr $C$DW$315, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\..\c
    3597                            .dwattr $C$DW$315, DW_AT_decl_line(0x6a)
    3598                            .dwattr $C$DW$315, DW_AT_decl_column(0x0d)
    3599                    $C$DW$316       .dwtag  DW_TAG_member
    3600                            .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$27)
    3601                            .dwattr $C$DW$316, DW_AT_name("ysum")
    3602                            .dwattr $C$DW$316, DW_AT_TI_symbol_name("ysum")
    3603                            .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3604                            .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3605                            .dwattr $C$DW$316, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\..\c
    3606                            .dwattr $C$DW$316, DW_AT_decl_line(0x6b)
    3607                            .dwattr $C$DW$316, DW_AT_decl_column(0x0d)
    3608                    $C$DW$317       .dwtag  DW_TAG_member
    3609                            .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$27)
    3610                            .dwattr $C$DW$317, DW_AT_name("xmin")
    3611                            .dwattr $C$DW$317, DW_AT_TI_symbol_name("xmin")
    3612                            .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3613                            .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3614                            .dwattr $C$DW$317, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\..\c
    3615                            .dwattr $C$DW$317, DW_AT_decl_line(0x6d)
    3616                            .dwattr $C$DW$317, DW_AT_decl_column(0x0d)
    3617                    $C$DW$318       .dwtag  DW_TAG_member
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsDense/VLIB_haarDetectObjectsDense_d.se66 PAGE   78

    3618                            .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$27)
    3619                            .dwattr $C$DW$318, DW_AT_name("ymin")
    3620                            .dwattr $C$DW$318, DW_AT_TI_symbol_name("ymin")
    3621                            .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3622                            .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3623                            .dwattr $C$DW$318, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\..\c
    3624                            .dwattr $C$DW$318, DW_AT_decl_line(0x6e)
    3625                            .dwattr $C$DW$318, DW_AT_decl_column(0x0d)
    3626                    $C$DW$319       .dwtag  DW_TAG_member
    3627                            .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$27)
    3628                            .dwattr $C$DW$319, DW_AT_name("xmax")
    3629                            .dwattr $C$DW$319, DW_AT_TI_symbol_name("xmax")
    3630                            .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3631                            .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3632                            .dwattr $C$DW$319, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\..\c
    3633                            .dwattr $C$DW$319, DW_AT_decl_line(0x6f)
    3634                            .dwattr $C$DW$319, DW_AT_decl_column(0x0d)
    3635                    $C$DW$320       .dwtag  DW_TAG_member
    3636                            .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$27)
    3637                            .dwattr $C$DW$320, DW_AT_name("ymax")
    3638                            .dwattr $C$DW$320, DW_AT_TI_symbol_name("ymax")
    3639                            .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3640                            .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3641                            .dwattr $C$DW$320, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\..\c
    3642                            .dwattr $C$DW$320, DW_AT_decl_line(0x70)
    3643                            .dwattr $C$DW$320, DW_AT_decl_column(0x0d)
    3644                    $C$DW$321       .dwtag  DW_TAG_member
    3645                            .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$27)
    3646                            .dwattr $C$DW$321, DW_AT_name("seedx")
    3647                            .dwattr $C$DW$321, DW_AT_TI_symbol_name("seedx")
    3648                            .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3649                            .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3650                            .dwattr $C$DW$321, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\..\c
    3651                            .dwattr $C$DW$321, DW_AT_decl_line(0x72)
    3652                            .dwattr $C$DW$321, DW_AT_decl_column(0x0d)
    3653                    $C$DW$322       .dwtag  DW_TAG_member
    3654                            .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$27)
    3655                            .dwattr $C$DW$322, DW_AT_name("seedy")
    3656                            .dwattr $C$DW$322, DW_AT_TI_symbol_name("seedy")
    3657                            .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3658                            .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3659                            .dwattr $C$DW$322, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\..\c
    3660                            .dwattr $C$DW$322, DW_AT_decl_line(0x73)
    3661                            .dwattr $C$DW$322, DW_AT_decl_column(0x0d)
    3662                            .dwendtag $C$DW$T$51
    3663                    
    3664                            .dwattr $C$DW$T$51, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\..\
    3665                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x68)
    3666                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x10)
    3667                    $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CC")
    3668                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$51)
    3669                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    3670                            .dwattr $C$DW$T$78, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\..\
    3671                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x75)
    3672                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsDense/VLIB_haarDetectObjectsDense_d.se66 PAGE   79

    3673                    
    3674                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    3675                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x10)
    3676                    $C$DW$323       .dwtag  DW_TAG_member
    3677                            .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$8)
    3678                            .dwattr $C$DW$323, DW_AT_name("daylight")
    3679                            .dwattr $C$DW$323, DW_AT_TI_symbol_name("daylight")
    3680                            .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3681                            .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3682                            .dwattr $C$DW$323, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3683                            .dwattr $C$DW$323, DW_AT_decl_line(0x52)
    3684                            .dwattr $C$DW$323, DW_AT_decl_column(0x0b)
    3685                    $C$DW$324       .dwtag  DW_TAG_member
    3686                            .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$10)
    3687                            .dwattr $C$DW$324, DW_AT_name("timezone")
    3688                            .dwattr $C$DW$324, DW_AT_TI_symbol_name("timezone")
    3689                            .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3690                            .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3691                            .dwattr $C$DW$324, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3692                            .dwattr $C$DW$324, DW_AT_decl_line(0x53)
    3693                            .dwattr $C$DW$324, DW_AT_decl_column(0x0b)
    3694                    $C$DW$325       .dwtag  DW_TAG_member
    3695                            .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$52)
    3696                            .dwattr $C$DW$325, DW_AT_name("tzname")
    3697                            .dwattr $C$DW$325, DW_AT_TI_symbol_name("tzname")
    3698                            .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3699                            .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3700                            .dwattr $C$DW$325, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3701                            .dwattr $C$DW$325, DW_AT_decl_line(0x54)
    3702                            .dwattr $C$DW$325, DW_AT_decl_column(0x0b)
    3703                    $C$DW$326       .dwtag  DW_TAG_member
    3704                            .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$52)
    3705                            .dwattr $C$DW$326, DW_AT_name("dstname")
    3706                            .dwattr $C$DW$326, DW_AT_TI_symbol_name("dstname")
    3707                            .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3708                            .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3709                            .dwattr $C$DW$326, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3710                            .dwattr $C$DW$326, DW_AT_decl_line(0x55)
    3711                            .dwattr $C$DW$326, DW_AT_decl_column(0x0b)
    3712                            .dwendtag $C$DW$T$53
    3713                    
    3714                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3715                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x51)
    3716                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
    3717                    $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("TZ")
    3718                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$53)
    3719                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    3720                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3721                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x56)
    3722                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x03)
    3723                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3724                            .dwattr $C$DW$T$2, DW_AT_name("void")
    3725                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3726                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3727                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsDense/VLIB_haarDetectObjectsDense_d.se66 PAGE   80

    3728                    $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_PTR")
    3729                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$3)
    3730                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    3731                            .dwattr $C$DW$T$80, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\..\
    3732                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x5c)
    3733                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x19)
    3734                    $C$DW$T$81      .dwtag  DW_TAG_const_type
    3735                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$2)
    3736                    $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    3737                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    3738                            .dwattr $C$DW$T$82, DW_AT_address_class(0x20)
    3739                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    3740                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3741                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    3742                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3743                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    3744                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3745                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3746                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3747                    $C$DW$T$111     .dwtag  DW_TAG_pointer_type
    3748                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$5)
    3749                            .dwattr $C$DW$T$111, DW_AT_address_class(0x20)
    3750                    $C$DW$T$127     .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    3751                            .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$5)
    3752                            .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    3753                            .dwattr $C$DW$T$127, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3754                            .dwattr $C$DW$T$127, DW_AT_decl_line(0x2a)
    3755                            .dwattr $C$DW$T$127, DW_AT_decl_column(0x1d)
    3756                    $C$DW$T$128     .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    3757                            .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
    3758                            .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    3759                            .dwattr $C$DW$T$128, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3760                            .dwattr $C$DW$T$128, DW_AT_decl_line(0x39)
    3761                            .dwattr $C$DW$T$128, DW_AT_decl_column(0x17)
    3762                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    3763                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3764                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3765                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3766                    $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3767                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$6)
    3768                            .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    3769                    $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    3770                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$6)
    3771                            .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    3772                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3773                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x2b)
    3774                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x1c)
    3775                    
    3776                    $C$DW$T$22      .dwtag  DW_TAG_array_type
    3777                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    3778                            .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    3779                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    3780                    $C$DW$327       .dwtag  DW_TAG_subrange_type
    3781                            .dwattr $C$DW$327, DW_AT_upper_bound(0x03)
    3782                            .dwendtag $C$DW$T$22
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsDense/VLIB_haarDetectObjectsDense_d.se66 PAGE   81

    3783                    
    3784                    
    3785                    $C$DW$T$23      .dwtag  DW_TAG_array_type
    3786                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$21)
    3787                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    3788                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x0c)
    3789                    $C$DW$328       .dwtag  DW_TAG_subrange_type
    3790                            .dwattr $C$DW$328, DW_AT_upper_bound(0x02)
    3791                    $C$DW$329       .dwtag  DW_TAG_subrange_type
    3792                            .dwattr $C$DW$329, DW_AT_upper_bound(0x03)
    3793                            .dwendtag $C$DW$T$23
    3794                    
    3795                    
    3796                    $C$DW$T$30      .dwtag  DW_TAG_array_type
    3797                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$21)
    3798                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3799                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x03)
    3800                    $C$DW$330       .dwtag  DW_TAG_subrange_type
    3801                            .dwattr $C$DW$330, DW_AT_upper_bound(0x02)
    3802                            .dwendtag $C$DW$T$30
    3803                    
    3804                    
    3805                    $C$DW$T$33      .dwtag  DW_TAG_array_type
    3806                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$21)
    3807                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3808                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x20)
    3809                    $C$DW$331       .dwtag  DW_TAG_subrange_type
    3810                            .dwattr $C$DW$331, DW_AT_upper_bound(0x1f)
    3811                            .dwendtag $C$DW$T$33
    3812                    
    3813                    $C$DW$T$130     .dwtag  DW_TAG_pointer_type
    3814                            .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$21)
    3815                            .dwattr $C$DW$T$130, DW_AT_address_class(0x20)
    3816                    $C$DW$T$131     .dwtag  DW_TAG_restrict_type
    3817                            .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$130)
    3818                    $C$DW$T$132     .dwtag  DW_TAG_const_type
    3819                            .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$21)
    3820                    $C$DW$T$133     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    3821                            .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$21)
    3822                            .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    3823                            .dwattr $C$DW$T$133, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3824                            .dwattr $C$DW$T$133, DW_AT_decl_line(0x3a)
    3825                            .dwattr $C$DW$T$133, DW_AT_decl_column(0x16)
    3826                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    3827                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3828                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3829                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    3830                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    3831                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3832                            .dwattr $C$DW$T$8, DW_AT_name("short")
    3833                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    3834                    $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    3835                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$8)
    3836                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    3837                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsDense/VLIB_haarDetectObjectsDense_d.se66 PAGE   82

    3838                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
    3839                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x1d)
    3840                    
    3841                    $C$DW$T$29      .dwtag  DW_TAG_array_type
    3842                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$19)
    3843                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    3844                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x10)
    3845                    $C$DW$332       .dwtag  DW_TAG_subrange_type
    3846                            .dwattr $C$DW$332, DW_AT_upper_bound(0x07)
    3847                            .dwendtag $C$DW$T$29
    3848                    
    3849                    $C$DW$T$134     .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    3850                            .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$19)
    3851                            .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    3852                            .dwattr $C$DW$T$134, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3853                            .dwattr $C$DW$T$134, DW_AT_decl_line(0x3c)
    3854                            .dwattr $C$DW$T$134, DW_AT_decl_column(0x17)
    3855                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    3856                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3857                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3858                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    3859                    $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    3860                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$9)
    3861                            .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    3862                            .dwattr $C$DW$T$104, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3863                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x2d)
    3864                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x1c)
    3865                    $C$DW$T$136     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    3866                            .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$104)
    3867                            .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
    3868                            .dwattr $C$DW$T$136, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3869                            .dwattr $C$DW$T$136, DW_AT_decl_line(0x3d)
    3870                            .dwattr $C$DW$T$136, DW_AT_decl_column(0x16)
    3871                    $C$DW$T$135     .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    3872                            .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$9)
    3873                            .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
    3874                            .dwattr $C$DW$T$135, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3875                            .dwattr $C$DW$T$135, DW_AT_decl_line(0x53)
    3876                            .dwattr $C$DW$T$135, DW_AT_decl_column(0x1a)
    3877                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    3878                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3879                            .dwattr $C$DW$T$10, DW_AT_name("int")
    3880                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    3881                    
    3882                    $C$DW$T$150     .dwtag  DW_TAG_array_type
    3883                            .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$10)
    3884                            .dwattr $C$DW$T$150, DW_AT_language(DW_LANG_C)
    3885                            .dwattr $C$DW$T$150, DW_AT_byte_size(0x08)
    3886                    $C$DW$333       .dwtag  DW_TAG_subrange_type
    3887                            .dwattr $C$DW$333, DW_AT_upper_bound(0x01)
    3888                            .dwendtag $C$DW$T$150
    3889                    
    3890                    $C$DW$T$161     .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
    3891                            .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$10)
    3892                            .dwattr $C$DW$T$161, DW_AT_language(DW_LANG_C)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsDense/VLIB_haarDetectObjectsDense_d.se66 PAGE   83

    3893                            .dwattr $C$DW$T$161, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3894                            .dwattr $C$DW$T$161, DW_AT_decl_line(0x53)
    3895                            .dwattr $C$DW$T$161, DW_AT_decl_column(0x0d)
    3896                    $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    3897                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$10)
    3898                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    3899                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3900                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x2e)
    3901                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x1d)
    3902                    $C$DW$T$153     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CCHandle")
    3903                            .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$27)
    3904                            .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    3905                            .dwattr $C$DW$T$153, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\..
    3906                            .dwattr $C$DW$T$153, DW_AT_decl_line(0x77)
    3907                            .dwattr $C$DW$T$153, DW_AT_decl_column(0x11)
    3908                    
    3909                    $C$DW$T$28      .dwtag  DW_TAG_array_type
    3910                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    3911                            .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    3912                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    3913                    $C$DW$334       .dwtag  DW_TAG_subrange_type
    3914                            .dwattr $C$DW$334, DW_AT_upper_bound(0x02)
    3915                            .dwendtag $C$DW$T$28
    3916                    
    3917                    
    3918                    $C$DW$T$32      .dwtag  DW_TAG_array_type
    3919                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$27)
    3920                            .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    3921                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x08)
    3922                    $C$DW$335       .dwtag  DW_TAG_subrange_type
    3923                            .dwattr $C$DW$335, DW_AT_upper_bound(0x01)
    3924                            .dwendtag $C$DW$T$32
    3925                    
    3926                    
    3927                    $C$DW$T$34      .dwtag  DW_TAG_array_type
    3928                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$27)
    3929                            .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    3930                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x80)
    3931                    $C$DW$336       .dwtag  DW_TAG_subrange_type
    3932                            .dwattr $C$DW$336, DW_AT_upper_bound(0x1f)
    3933                            .dwendtag $C$DW$T$34
    3934                    
    3935                    
    3936                    $C$DW$T$54      .dwtag  DW_TAG_array_type
    3937                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$27)
    3938                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    3939                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x10)
    3940                    $C$DW$337       .dwtag  DW_TAG_subrange_type
    3941                            .dwattr $C$DW$337, DW_AT_upper_bound(0x03)
    3942                            .dwendtag $C$DW$T$54
    3943                    
    3944                    $C$DW$T$107     .dwtag  DW_TAG_pointer_type
    3945                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$27)
    3946                            .dwattr $C$DW$T$107, DW_AT_address_class(0x20)
    3947                    $C$DW$T$156     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsDense/VLIB_haarDetectObjectsDense_d.se66 PAGE   84

    3948                            .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$27)
    3949                            .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    3950                            .dwattr $C$DW$T$156, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3951                            .dwattr $C$DW$T$156, DW_AT_decl_line(0x4b)
    3952                            .dwattr $C$DW$T$156, DW_AT_decl_column(0x17)
    3953                    $C$DW$T$157     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    3954                            .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$27)
    3955                            .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
    3956                            .dwattr $C$DW$T$157, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3957                            .dwattr $C$DW$T$157, DW_AT_decl_line(0x4e)
    3958                            .dwattr $C$DW$T$157, DW_AT_decl_column(0x17)
    3959                    $C$DW$T$158     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    3960                            .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$27)
    3961                            .dwattr $C$DW$T$158, DW_AT_language(DW_LANG_C)
    3962                            .dwattr $C$DW$T$158, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3963                            .dwattr $C$DW$T$158, DW_AT_decl_line(0x49)
    3964                            .dwattr $C$DW$T$158, DW_AT_decl_column(0x17)
    3965                    $C$DW$T$159     .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    3966                            .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$27)
    3967                            .dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
    3968                            .dwattr $C$DW$T$159, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3969                            .dwattr $C$DW$T$159, DW_AT_decl_line(0x3e)
    3970                            .dwattr $C$DW$T$159, DW_AT_decl_column(0x17)
    3971                    $C$DW$T$160     .dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
    3972                            .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$10)
    3973                            .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
    3974                            .dwattr $C$DW$T$160, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3975                            .dwattr $C$DW$T$160, DW_AT_decl_line(0x58)
    3976                            .dwattr $C$DW$T$160, DW_AT_decl_column(0x1a)
    3977                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    3978                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3979                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    3980                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    3981                    $C$DW$T$162     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_VAL")
    3982                            .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$11)
    3983                            .dwattr $C$DW$T$162, DW_AT_language(DW_LANG_C)
    3984                            .dwattr $C$DW$T$162, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsDense\..
    3985                            .dwattr $C$DW$T$162, DW_AT_decl_line(0x5d)
    3986                            .dwattr $C$DW$T$162, DW_AT_decl_column(0x17)
    3987                    $C$DW$T$163     .dwtag  DW_TAG_pointer_type
    3988                            .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$11)
    3989                            .dwattr $C$DW$T$163, DW_AT_address_class(0x20)
    3990                    $C$DW$T$174     .dwtag  DW_TAG_typedef, DW_AT_name("clock_t")
    3991                            .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$11)
    3992                            .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    3993                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3994                            .dwattr $C$DW$T$174, DW_AT_decl_line(0x37)
    3995                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x16)
    3996                    $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    3997                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$11)
    3998                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3999                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4000                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x45)
    4001                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x19)
    4002                    $C$DW$T$167     .dwtag  DW_TAG_typedef, DW_AT_name("time_t")
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsDense/VLIB_haarDetectObjectsDense_d.se66 PAGE   85

    4003                            .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$11)
    4004                            .dwattr $C$DW$T$167, DW_AT_language(DW_LANG_C)
    4005                            .dwattr $C$DW$T$167, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4006                            .dwattr $C$DW$T$167, DW_AT_decl_line(0x38)
    4007                            .dwattr $C$DW$T$167, DW_AT_decl_column(0x16)
    4008                    $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    4009                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$11)
    4010                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4011                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4012                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x2f)
    4013                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x1c)
    4014                    $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    4015                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    4016                            .dwattr $C$DW$T$39, DW_AT_address_class(0x20)
    4017                    $C$DW$T$145     .dwtag  DW_TAG_restrict_type
    4018                            .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$39)
    4019                    $C$DW$T$169     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast16_t")
    4020                            .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$38)
    4021                            .dwattr $C$DW$T$169, DW_AT_language(DW_LANG_C)
    4022                            .dwattr $C$DW$T$169, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4023                            .dwattr $C$DW$T$169, DW_AT_decl_line(0x4c)
    4024                            .dwattr $C$DW$T$169, DW_AT_decl_column(0x16)
    4025                    $C$DW$T$170     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast32_t")
    4026                            .dwattr $C$DW$T$170, DW_AT_type(*$C$DW$T$38)
    4027                            .dwattr $C$DW$T$170, DW_AT_language(DW_LANG_C)
    4028                            .dwattr $C$DW$T$170, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4029                            .dwattr $C$DW$T$170, DW_AT_decl_line(0x4f)
    4030                            .dwattr $C$DW$T$170, DW_AT_decl_column(0x16)
    4031                    $C$DW$T$171     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast8_t")
    4032                            .dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$38)
    4033                            .dwattr $C$DW$T$171, DW_AT_language(DW_LANG_C)
    4034                            .dwattr $C$DW$T$171, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4035                            .dwattr $C$DW$T$171, DW_AT_decl_line(0x4a)
    4036                            .dwattr $C$DW$T$171, DW_AT_decl_column(0x16)
    4037                    $C$DW$T$172     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least32_t")
    4038                            .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$38)
    4039                            .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
    4040                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4041                            .dwattr $C$DW$T$172, DW_AT_decl_line(0x3f)
    4042                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x16)
    4043                    $C$DW$T$173     .dwtag  DW_TAG_typedef, DW_AT_name("uintptr_t")
    4044                            .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$11)
    4045                            .dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
    4046                            .dwattr $C$DW$T$173, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4047                            .dwattr $C$DW$T$173, DW_AT_decl_line(0x59)
    4048                            .dwattr $C$DW$T$173, DW_AT_decl_column(0x1a)
    4049                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    4050                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    4051                            .dwattr $C$DW$T$12, DW_AT_name("__int40_t")
    4052                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x08)
    4053                            .dwattr $C$DW$T$12, DW_AT_bit_size(0x28)
    4054                            .dwattr $C$DW$T$12, DW_AT_bit_offset(0x18)
    4055                    $C$DW$T$175     .dwtag  DW_TAG_typedef, DW_AT_name("int40_t")
    4056                            .dwattr $C$DW$T$175, DW_AT_type(*$C$DW$T$12)
    4057                            .dwattr $C$DW$T$175, DW_AT_language(DW_LANG_C)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsDense/VLIB_haarDetectObjectsDense_d.se66 PAGE   86

    4058                            .dwattr $C$DW$T$175, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4059                            .dwattr $C$DW$T$175, DW_AT_decl_line(0x31)
    4060                            .dwattr $C$DW$T$175, DW_AT_decl_column(0x21)
