TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:21 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsSparse/VLIB_haarDetectObjectsSparse_d.se66 PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v7.4.2 *
       3                    ;* Date/Time created: Sat Sep 26 11:10:20 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --c64p_l1d_workaround=off --endian=little --hll_source=on --long_pre
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C66xx                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *

    2782                            .dwattr $C$DW$239, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\../
    2783                            .dwattr $C$DW$239, DW_AT_decl_line(0x6c)
    2784                            .dwattr $C$DW$239, DW_AT_decl_column(0x05)
    2785                            .dwendtag $C$DW$T$59
    2786                    
    2787                            .dwattr $C$DW$T$59, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\..
    2788                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x69)
    2789                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x06)
    2790                    
    2791                    $C$DW$T$60      .dwtag  DW_TAG_enumeration_type
    2792                            .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    2793                    $C$DW$240       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_FAIL"), DW_AT_const_value(0x00)
    2794                            .dwattr $C$DW$240, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\../
    2795                            .dwattr $C$DW$240, DW_AT_decl_line(0x72)
    2796                            .dwattr $C$DW$240, DW_AT_decl_column(0x05)
    2797                    $C$DW$241       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_PASS"), DW_AT_const_value(0x01)
    2798                            .dwattr $C$DW$241, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\../
    2799                            .dwattr $C$DW$241, DW_AT_decl_line(0x73)
    2800                            .dwattr $C$DW$241, DW_AT_decl_column(0x05)
    2801                            .dwendtag $C$DW$T$60
    2802                    
    2803                            .dwattr $C$DW$T$60, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\..
    2804                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x71)
    2805                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x06)
    2806                    
    2807                    $C$DW$T$61      .dwtag  DW_TAG_enumeration_type
    2808                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    2809                    $C$DW$242       .dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_HAAR_X2"), DW_AT_const_value(0x01)
    2810                            .dwattr $C$DW$242, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
    2811                            .dwattr $C$DW$242, DW_AT_decl_line(0x76)
    2812                            .dwattr $C$DW$242, DW_AT_decl_column(0x05)
    2813                    $C$DW$243       .dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_HAAR_Y2"), DW_AT_const_value(0x02)
    2814                            .dwattr $C$DW$243, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
    2815                            .dwattr $C$DW$243, DW_AT_decl_line(0x77)
    2816                            .dwattr $C$DW$243, DW_AT_decl_column(0x05)
    2817                    $C$DW$244       .dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_HAAR_X2_Y2"), DW_AT_const_value(0x03)
    2818                            .dwattr $C$DW$244, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
    2819                            .dwattr $C$DW$244, DW_AT_decl_line(0x78)
    2820                            .dwattr $C$DW$244, DW_AT_decl_column(0x05)
    2821                    $C$DW$245       .dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_HAAR_GEN2"), DW_AT_const_value(0x04)
    2822                            .dwattr $C$DW$245, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
    2823                            .dwattr $C$DW$245, DW_AT_decl_line(0x79)
    2824                            .dwattr $C$DW$245, DW_AT_decl_column(0x05)
    2825                    $C$DW$246       .dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_HAAR_GEN3"), DW_AT_const_value(0x05)
    2826                            .dwattr $C$DW$246, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:21 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsSparse/VLIB_haarDetectObjectsSparse_d.se66 PAGE   62

    2827                            .dwattr $C$DW$246, DW_AT_decl_line(0x7a)
    2828                            .dwattr $C$DW$246, DW_AT_decl_column(0x05)
    2829                            .dwendtag $C$DW$T$61
    2830                    
    2831                            .dwattr $C$DW$T$61, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c6
    2832                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x75)
    2833                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x0e)
    2834                    $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_HAARDETOBJ_rectType")
    2835                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    2836                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2837                            .dwattr $C$DW$T$62, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c6
    2838                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x7b)
    2839                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    2840                    
    2841                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2842                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
    2843                    $C$DW$247       .dwtag  DW_TAG_member
    2844                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    2845                            .dwattr $C$DW$247, DW_AT_name("numObjects")
    2846                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("numObjects")
    2847                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2848                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2849                            .dwattr $C$DW$247, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
    2850                            .dwattr $C$DW$247, DW_AT_decl_line(0xe5)
    2851                            .dwattr $C$DW$247, DW_AT_decl_column(0x0f)
    2852                    $C$DW$248       .dwtag  DW_TAG_member
    2853                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$21)
    2854                            .dwattr $C$DW$248, DW_AT_name("objectPos")
    2855                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("objectPos")
    2856                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2857                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2858                            .dwattr $C$DW$248, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
    2859                            .dwattr $C$DW$248, DW_AT_decl_line(0xe6)
    2860                            .dwattr $C$DW$248, DW_AT_decl_column(0x0f)
    2861                            .dwendtag $C$DW$T$22
    2862                    
    2863                            .dwattr $C$DW$T$22, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c6
    2864                            .dwattr $C$DW$T$22, DW_AT_decl_line(0xe4)
    2865                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    2866                    $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_HAARDETOBJ_sObjectList")
    2867                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$22)
    2868                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    2869                            .dwattr $C$DW$T$63, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c6
    2870                            .dwattr $C$DW$T$63, DW_AT_decl_line(0xe7)
    2871                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    2872                    $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    2873                            .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    2874                            .dwattr $C$DW$T$64, DW_AT_address_class(0x20)
    2875                    $C$DW$T$65      .dwtag  DW_TAG_restrict_type
    2876                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    2877                    
    2878                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2879                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
    2880                    $C$DW$249       .dwtag  DW_TAG_member
    2881                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:21 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsSparse/VLIB_haarDetectObjectsSparse_d.se66 PAGE   63

    2882                            .dwattr $C$DW$249, DW_AT_name("offsetTL")
    2883                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("offsetTL")
    2884                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2885                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2886                            .dwattr $C$DW$249, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
    2887                            .dwattr $C$DW$249, DW_AT_decl_line(0x41)
    2888                            .dwattr $C$DW$249, DW_AT_decl_column(0x0d)
    2889                    $C$DW$250       .dwtag  DW_TAG_member
    2890                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    2891                            .dwattr $C$DW$250, DW_AT_name("offsetTR")
    2892                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("offsetTR")
    2893                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2894                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2895                            .dwattr $C$DW$250, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
    2896                            .dwattr $C$DW$250, DW_AT_decl_line(0x42)
    2897                            .dwattr $C$DW$250, DW_AT_decl_column(0x0d)
    2898                    $C$DW$251       .dwtag  DW_TAG_member
    2899                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    2900                            .dwattr $C$DW$251, DW_AT_name("offsetBL")
    2901                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("offsetBL")
    2902                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2903                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2904                            .dwattr $C$DW$251, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
    2905                            .dwattr $C$DW$251, DW_AT_decl_line(0x43)
    2906                            .dwattr $C$DW$251, DW_AT_decl_column(0x0d)
    2907                    $C$DW$252       .dwtag  DW_TAG_member
    2908                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
    2909                            .dwattr $C$DW$252, DW_AT_name("offsetBR")
    2910                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("offsetBR")
    2911                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2912                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2913                            .dwattr $C$DW$252, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
    2914                            .dwattr $C$DW$252, DW_AT_decl_line(0x44)
    2915                            .dwattr $C$DW$252, DW_AT_decl_column(0x0d)
    2916                            .dwendtag $C$DW$T$23
    2917                    
    2918                            .dwattr $C$DW$T$23, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c6
    2919                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x40)
    2920                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
    2921                    $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_HAARDETOBJ_sRect")
    2922                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$23)
    2923                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    2924                            .dwattr $C$DW$T$27, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c6
    2925                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x45)
    2926                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x03)
    2927                    
    2928                    $C$DW$T$28      .dwtag  DW_TAG_array_type
    2929                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    2930                            .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    2931                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x18)
    2932                    $C$DW$253       .dwtag  DW_TAG_subrange_type
    2933                            .dwattr $C$DW$253, DW_AT_upper_bound(0x02)
    2934                            .dwendtag $C$DW$T$28
    2935                    
    2936                    
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:21 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsSparse/VLIB_haarDetectObjectsSparse_d.se66 PAGE   64

    2937                    $C$DW$T$29      .dwtag  DW_TAG_array_type
    2938                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$27)
    2939                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    2940                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x48)
    2941                    $C$DW$254       .dwtag  DW_TAG_subrange_type
    2942                            .dwattr $C$DW$254, DW_AT_upper_bound(0x02)
    2943                    $C$DW$255       .dwtag  DW_TAG_subrange_type
    2944                            .dwattr $C$DW$255, DW_AT_upper_bound(0x02)
    2945                            .dwendtag $C$DW$T$29
    2946                    
    2947                    
    2948                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2949                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x78)
    2950                    $C$DW$256       .dwtag  DW_TAG_member
    2951                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$26)
    2952                            .dwattr $C$DW$256, DW_AT_name("weight")
    2953                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("weight")
    2954                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2955                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2956                            .dwattr $C$DW$256, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
    2957                            .dwattr $C$DW$256, DW_AT_decl_line(0xae)
    2958                            .dwattr $C$DW$256, DW_AT_decl_column(0x1b)
    2959                    $C$DW$257       .dwtag  DW_TAG_member
    2960                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    2961                            .dwattr $C$DW$257, DW_AT_name("numNodes")
    2962                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("numNodes")
    2963                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2964                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2965                            .dwattr $C$DW$257, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
    2966                            .dwattr $C$DW$257, DW_AT_decl_line(0xaf)
    2967                            .dwattr $C$DW$257, DW_AT_decl_column(0x1b)
    2968                    $C$DW$258       .dwtag  DW_TAG_member
    2969                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$29)
    2970                            .dwattr $C$DW$258, DW_AT_name("rect")
    2971                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("rect")
    2972                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2973                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2974                            .dwattr $C$DW$258, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
    2975                            .dwattr $C$DW$258, DW_AT_decl_line(0xb0)
    2976                            .dwattr $C$DW$258, DW_AT_decl_column(0x1b)
    2977                    $C$DW$259       .dwtag  DW_TAG_member
    2978                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$31)
    2979                            .dwattr $C$DW$259, DW_AT_name("alpha")
    2980                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("alpha")
    2981                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2982                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2983                            .dwattr $C$DW$259, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
    2984                            .dwattr $C$DW$259, DW_AT_decl_line(0xb1)
    2985                            .dwattr $C$DW$259, DW_AT_decl_column(0x1b)
    2986                    $C$DW$260       .dwtag  DW_TAG_member
    2987                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$32)
    2988                            .dwattr $C$DW$260, DW_AT_name("result")
    2989                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("result")
    2990                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2991                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:21 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsSparse/VLIB_haarDetectObjectsSparse_d.se66 PAGE   65

    2992                            .dwattr $C$DW$260, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
    2993                            .dwattr $C$DW$260, DW_AT_decl_line(0xb2)
    2994                            .dwattr $C$DW$260, DW_AT_decl_column(0x1b)
    2995                    $C$DW$261       .dwtag  DW_TAG_member
    2996                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$33)
    2997                            .dwattr $C$DW$261, DW_AT_name("rectType")
    2998                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("rectType")
    2999                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    3000                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3001                            .dwattr $C$DW$261, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
    3002                            .dwattr $C$DW$261, DW_AT_decl_line(0xb3)
    3003                            .dwattr $C$DW$261, DW_AT_decl_column(0x1b)
    3004                            .dwendtag $C$DW$T$34
    3005                    
    3006                            .dwattr $C$DW$T$34, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c6
    3007                            .dwattr $C$DW$T$34, DW_AT_decl_line(0xad)
    3008                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    3009                    $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_HAARDETOBJ_sTree")
    3010                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$34)
    3011                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3012                            .dwattr $C$DW$T$38, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c6
    3013                            .dwattr $C$DW$T$38, DW_AT_decl_line(0xb4)
    3014                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x03)
    3015                    $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    3016                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    3017                            .dwattr $C$DW$T$39, DW_AT_address_class(0x20)
    3018                    
    3019                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3020                            .dwattr $C$DW$T$40, DW_AT_byte_size(0xd4)
    3021                    $C$DW$262       .dwtag  DW_TAG_member
    3022                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$30)
    3023                            .dwattr $C$DW$262, DW_AT_name("numStages")
    3024                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("numStages")
    3025                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3026                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3027                            .dwattr $C$DW$262, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
    3028                            .dwattr $C$DW$262, DW_AT_decl_line(0xce)
    3029                            .dwattr $C$DW$262, DW_AT_decl_column(0x1c)
    3030                    $C$DW$263       .dwtag  DW_TAG_member
    3031                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$30)
    3032                            .dwattr $C$DW$263, DW_AT_name("maxNodesPerTree")
    3033                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("maxNodesPerTree")
    3034                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3035                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3036                            .dwattr $C$DW$263, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
    3037                            .dwattr $C$DW$263, DW_AT_decl_line(0xcf)
    3038                            .dwattr $C$DW$263, DW_AT_decl_column(0x1c)
    3039                    $C$DW$264       .dwtag  DW_TAG_member
    3040                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$35)
    3041                            .dwattr $C$DW$264, DW_AT_name("patchSize")
    3042                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("patchSize")
    3043                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3044                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3045                            .dwattr $C$DW$264, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
    3046                            .dwattr $C$DW$264, DW_AT_decl_line(0xd0)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:21 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsSparse/VLIB_haarDetectObjectsSparse_d.se66 PAGE   66

    3047                            .dwattr $C$DW$264, DW_AT_decl_column(0x1c)
    3048                    $C$DW$265       .dwtag  DW_TAG_member
    3049                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$36)
    3050                            .dwattr $C$DW$265, DW_AT_name("numTrees")
    3051                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("numTrees")
    3052                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3053                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3054                            .dwattr $C$DW$265, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
    3055                            .dwattr $C$DW$265, DW_AT_decl_line(0xd1)
    3056                            .dwattr $C$DW$265, DW_AT_decl_column(0x1c)
    3057                    $C$DW$266       .dwtag  DW_TAG_member
    3058                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$36)
    3059                            .dwattr $C$DW$266, DW_AT_name("maxRectangle")
    3060                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("maxRectangle")
    3061                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3062                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3063                            .dwattr $C$DW$266, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
    3064                            .dwattr $C$DW$266, DW_AT_decl_line(0xd2)
    3065                            .dwattr $C$DW$266, DW_AT_decl_column(0x1c)
    3066                    $C$DW$267       .dwtag  DW_TAG_member
    3067                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$37)
    3068                            .dwattr $C$DW$267, DW_AT_name("stageTh")
    3069                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("stageTh")
    3070                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3071                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3072                            .dwattr $C$DW$267, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
    3073                            .dwattr $C$DW$267, DW_AT_decl_line(0xd3)
    3074                            .dwattr $C$DW$267, DW_AT_decl_column(0x1c)
    3075                    $C$DW$268       .dwtag  DW_TAG_member
    3076                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$39)
    3077                            .dwattr $C$DW$268, DW_AT_name("tree")
    3078                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("tree")
    3079                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3080                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3081                            .dwattr $C$DW$268, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c66
    3082                            .dwattr $C$DW$268, DW_AT_decl_line(0xd4)
    3083                            .dwattr $C$DW$268, DW_AT_decl_column(0x1c)
    3084                            .dwendtag $C$DW$T$40
    3085                    
    3086                            .dwattr $C$DW$T$40, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c6
    3087                            .dwattr $C$DW$T$40, DW_AT_decl_line(0xcd)
    3088                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    3089                    $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_HAARDETOBJ_sClassifier")
    3090                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    3091                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3092                            .dwattr $C$DW$T$41, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\c6
    3093                            .dwattr $C$DW$T$41, DW_AT_decl_line(0xd5)
    3094                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x03)
    3095                    $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    3096                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    3097                            .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    3098                    $C$DW$T$67      .dwtag  DW_TAG_restrict_type
    3099                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$42)
    3100                    
    3101                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:21 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsSparse/VLIB_haarDetectObjectsSparse_d.se66 PAGE   67

    3102                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x30)
    3103                    $C$DW$269       .dwtag  DW_TAG_member
    3104                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$24)
    3105                            .dwattr $C$DW$269, DW_AT_name("testPattern")
    3106                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("testPattern")
    3107                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3108                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3109                            .dwattr $C$DW$269, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\VLI
    3110                            .dwattr $C$DW$269, DW_AT_decl_line(0x25)
    3111                            .dwattr $C$DW$269, DW_AT_decl_column(0x22)
    3112                    $C$DW$270       .dwtag  DW_TAG_member
    3113                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$21)
    3114                            .dwattr $C$DW$270, DW_AT_name("integralImg")
    3115                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("integralImg")
    3116                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3117                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3118                            .dwattr $C$DW$270, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\VLI
    3119                            .dwattr $C$DW$270, DW_AT_decl_line(0x26)
    3120                            .dwattr $C$DW$270, DW_AT_decl_column(0x22)
    3121                    $C$DW$271       .dwtag  DW_TAG_member
    3122                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$30)
    3123                            .dwattr $C$DW$271, DW_AT_name("integralImgWidth")
    3124                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("integralImgWidth")
    3125                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3126                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3127                            .dwattr $C$DW$271, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\VLI
    3128                            .dwattr $C$DW$271, DW_AT_decl_line(0x27)
    3129                            .dwattr $C$DW$271, DW_AT_decl_column(0x22)
    3130                    $C$DW$272       .dwtag  DW_TAG_member
    3131                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$30)
    3132                            .dwattr $C$DW$272, DW_AT_name("integralImgHeight")
    3133                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("integralImgHeight")
    3134                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3135                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3136                            .dwattr $C$DW$272, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\VLI
    3137                            .dwattr $C$DW$272, DW_AT_decl_line(0x28)
    3138                            .dwattr $C$DW$272, DW_AT_decl_column(0x22)
    3139                    $C$DW$273       .dwtag  DW_TAG_member
    3140                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$30)
    3141                            .dwattr $C$DW$273, DW_AT_name("integralImgPitch")
    3142                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("integralImgPitch")
    3143                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3144                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3145                            .dwattr $C$DW$273, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\VLI
    3146                            .dwattr $C$DW$273, DW_AT_decl_line(0x29)
    3147                            .dwattr $C$DW$273, DW_AT_decl_column(0x22)
    3148                    $C$DW$274       .dwtag  DW_TAG_member
    3149                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$30)
    3150                            .dwattr $C$DW$274, DW_AT_name("startStage")
    3151                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("startStage")
    3152                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3153                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3154                            .dwattr $C$DW$274, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\VLI
    3155                            .dwattr $C$DW$274, DW_AT_decl_line(0x2a)
    3156                            .dwattr $C$DW$274, DW_AT_decl_column(0x22)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:21 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsSparse/VLIB_haarDetectObjectsSparse_d.se66 PAGE   68

    3157                    $C$DW$275       .dwtag  DW_TAG_member
    3158                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$30)
    3159                            .dwattr $C$DW$275, DW_AT_name("endStage")
    3160                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("endStage")
    3161                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3162                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3163                            .dwattr $C$DW$275, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\VLI
    3164                            .dwattr $C$DW$275, DW_AT_decl_line(0x2b)
    3165                            .dwattr $C$DW$275, DW_AT_decl_column(0x22)
    3166                    $C$DW$276       .dwtag  DW_TAG_member
    3167                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    3168                            .dwattr $C$DW$276, DW_AT_name("numInPos")
    3169                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("numInPos")
    3170                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3171                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3172                            .dwattr $C$DW$276, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\VLI
    3173                            .dwattr $C$DW$276, DW_AT_decl_line(0x2c)
    3174                            .dwattr $C$DW$276, DW_AT_decl_column(0x22)
    3175                    $C$DW$277       .dwtag  DW_TAG_member
    3176                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$21)
    3177                            .dwattr $C$DW$277, DW_AT_name("inObjectPos")
    3178                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("inObjectPos")
    3179                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3180                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3181                            .dwattr $C$DW$277, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\VLI
    3182                            .dwattr $C$DW$277, DW_AT_decl_line(0x2d)
    3183                            .dwattr $C$DW$277, DW_AT_decl_column(0x22)
    3184                    $C$DW$278       .dwtag  DW_TAG_member
    3185                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$42)
    3186                            .dwattr $C$DW$278, DW_AT_name("classifier")
    3187                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("classifier")
    3188                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3189                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3190                            .dwattr $C$DW$278, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\VLI
    3191                            .dwattr $C$DW$278, DW_AT_decl_line(0x2e)
    3192                            .dwattr $C$DW$278, DW_AT_decl_column(0x22)
    3193                    $C$DW$279       .dwtag  DW_TAG_member
    3194                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$21)
    3195                            .dwattr $C$DW$279, DW_AT_name("outObjectPos")
    3196                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("outObjectPos")
    3197                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3198                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3199                            .dwattr $C$DW$279, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\VLI
    3200                            .dwattr $C$DW$279, DW_AT_decl_line(0x2f)
    3201                            .dwattr $C$DW$279, DW_AT_decl_column(0x22)
    3202                    $C$DW$280       .dwtag  DW_TAG_member
    3203                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$44)
    3204                            .dwattr $C$DW$280, DW_AT_name("desc")
    3205                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("desc")
    3206                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3207                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3208                            .dwattr $C$DW$280, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\VLI
    3209                            .dwattr $C$DW$280, DW_AT_decl_line(0x30)
    3210                            .dwattr $C$DW$280, DW_AT_decl_column(0x22)
    3211                            .dwendtag $C$DW$T$45
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:21 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsSparse/VLIB_haarDetectObjectsSparse_d.se66 PAGE   69

    3212                    
    3213                            .dwattr $C$DW$T$45, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\VL
    3214                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x24)
    3215                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
    3216                    $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    3217                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$45)
    3218                            .dwattr $C$DW$T$69, DW_AT_address_class(0x20)
    3219                    $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("haarDetectObjectsSparse_testParams_t")
    3220                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$45)
    3221                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    3222                            .dwattr $C$DW$T$71, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\VL
    3223                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x31)
    3224                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    3225                    $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    3226                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    3227                            .dwattr $C$DW$T$72, DW_AT_address_class(0x20)
    3228                    $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    3229                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    3230                            .dwattr $C$DW$T$73, DW_AT_address_class(0x20)
    3231                    
    3232                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    3233                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x18)
    3234                    $C$DW$281       .dwtag  DW_TAG_member
    3235                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$10)
    3236                            .dwattr $C$DW$281, DW_AT_name("fd")
    3237                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("fd")
    3238                            .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3239                            .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3240                            .dwattr $C$DW$281, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3241                            .dwattr $C$DW$281, DW_AT_decl_line(0x49)
    3242                            .dwattr $C$DW$281, DW_AT_decl_column(0x0b)
    3243                    $C$DW$282       .dwtag  DW_TAG_member
    3244                            .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$46)
    3245                            .dwattr $C$DW$282, DW_AT_name("buf")
    3246                            .dwattr $C$DW$282, DW_AT_TI_symbol_name("buf")
    3247                            .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3248                            .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3249                            .dwattr $C$DW$282, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3250                            .dwattr $C$DW$282, DW_AT_decl_line(0x4a)
    3251                            .dwattr $C$DW$282, DW_AT_decl_column(0x16)
    3252                    $C$DW$283       .dwtag  DW_TAG_member
    3253                            .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$46)
    3254                            .dwattr $C$DW$283, DW_AT_name("pos")
    3255                            .dwattr $C$DW$283, DW_AT_TI_symbol_name("pos")
    3256                            .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3257                            .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3258                            .dwattr $C$DW$283, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3259                            .dwattr $C$DW$283, DW_AT_decl_line(0x4b)
    3260                            .dwattr $C$DW$283, DW_AT_decl_column(0x16)
    3261                    $C$DW$284       .dwtag  DW_TAG_member
    3262                            .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$46)
    3263                            .dwattr $C$DW$284, DW_AT_name("bufend")
    3264                            .dwattr $C$DW$284, DW_AT_TI_symbol_name("bufend")
    3265                            .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3266                            .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:21 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsSparse/VLIB_haarDetectObjectsSparse_d.se66 PAGE   70

    3267                            .dwattr $C$DW$284, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3268                            .dwattr $C$DW$284, DW_AT_decl_line(0x4c)
    3269                            .dwattr $C$DW$284, DW_AT_decl_column(0x16)
    3270                    $C$DW$285       .dwtag  DW_TAG_member
    3271                            .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$46)
    3272                            .dwattr $C$DW$285, DW_AT_name("buff_stop")
    3273                            .dwattr $C$DW$285, DW_AT_TI_symbol_name("buff_stop")
    3274                            .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3275                            .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3276                            .dwattr $C$DW$285, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3277                            .dwattr $C$DW$285, DW_AT_decl_line(0x4d)
    3278                            .dwattr $C$DW$285, DW_AT_decl_column(0x16)
    3279                    $C$DW$286       .dwtag  DW_TAG_member
    3280                            .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$11)
    3281                            .dwattr $C$DW$286, DW_AT_name("flags")
    3282                            .dwattr $C$DW$286, DW_AT_TI_symbol_name("flags")
    3283                            .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3284                            .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3285                            .dwattr $C$DW$286, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3286                            .dwattr $C$DW$286, DW_AT_decl_line(0x4e)
    3287                            .dwattr $C$DW$286, DW_AT_decl_column(0x16)
    3288                            .dwendtag $C$DW$T$47
    3289                    
    3290                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3291                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x48)
    3292                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x10)
    3293                    $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    3294                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$47)
    3295                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    3296                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3297                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x4f)
    3298                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    3299                    
    3300                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    3301                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x08)
    3302                    $C$DW$287       .dwtag  DW_TAG_member
    3303                            .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$10)
    3304                            .dwattr $C$DW$287, DW_AT_name("quot")
    3305                            .dwattr $C$DW$287, DW_AT_TI_symbol_name("quot")
    3306                            .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3307                            .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3308                            .dwattr $C$DW$287, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3309                            .dwattr $C$DW$287, DW_AT_decl_line(0x3e)
    3310                            .dwattr $C$DW$287, DW_AT_decl_column(0x16)
    3311                    $C$DW$288       .dwtag  DW_TAG_member
    3312                            .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$10)
    3313                            .dwattr $C$DW$288, DW_AT_name("rem")
    3314                            .dwattr $C$DW$288, DW_AT_TI_symbol_name("rem")
    3315                            .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3316                            .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3317                            .dwattr $C$DW$288, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3318                            .dwattr $C$DW$288, DW_AT_decl_line(0x3e)
    3319                            .dwattr $C$DW$288, DW_AT_decl_column(0x1c)
    3320                            .dwendtag $C$DW$T$48
    3321                    
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:21 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsSparse/VLIB_haarDetectObjectsSparse_d.se66 PAGE   71

    3322                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3323                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x3e)
    3324                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x10)
    3325                    $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    3326                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$48)
    3327                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3328                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3329                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x3e)
    3330                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x23)
    3331                    
    3332                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    3333                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x08)
    3334                    $C$DW$289       .dwtag  DW_TAG_member
    3335                            .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$10)
    3336                            .dwattr $C$DW$289, DW_AT_name("quot")
    3337                            .dwattr $C$DW$289, DW_AT_TI_symbol_name("quot")
    3338                            .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3339                            .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3340                            .dwattr $C$DW$289, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3341                            .dwattr $C$DW$289, DW_AT_decl_line(0x40)
    3342                            .dwattr $C$DW$289, DW_AT_decl_column(0x17)
    3343                    $C$DW$290       .dwtag  DW_TAG_member
    3344                            .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$10)
    3345                            .dwattr $C$DW$290, DW_AT_name("rem")
    3346                            .dwattr $C$DW$290, DW_AT_TI_symbol_name("rem")
    3347                            .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3348                            .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3349                            .dwattr $C$DW$290, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3350                            .dwattr $C$DW$290, DW_AT_decl_line(0x40)
    3351                            .dwattr $C$DW$290, DW_AT_decl_column(0x1d)
    3352                            .dwendtag $C$DW$T$49
    3353                    
    3354                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3355                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x40)
    3356                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x10)
    3357                    $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    3358                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$49)
    3359                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    3360                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3361                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x40)
    3362                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x24)
    3363                    
    3364                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    3365                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x10)
    3366                    $C$DW$291       .dwtag  DW_TAG_member
    3367                            .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$14)
    3368                            .dwattr $C$DW$291, DW_AT_name("quot")
    3369                            .dwattr $C$DW$291, DW_AT_TI_symbol_name("quot")
    3370                            .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3371                            .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3372                            .dwattr $C$DW$291, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3373                            .dwattr $C$DW$291, DW_AT_decl_line(0x43)
    3374                            .dwattr $C$DW$291, DW_AT_decl_column(0x1c)
    3375                    $C$DW$292       .dwtag  DW_TAG_member
    3376                            .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$14)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:21 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsSparse/VLIB_haarDetectObjectsSparse_d.se66 PAGE   72

    3377                            .dwattr $C$DW$292, DW_AT_name("rem")
    3378                            .dwattr $C$DW$292, DW_AT_TI_symbol_name("rem")
    3379                            .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3380                            .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3381                            .dwattr $C$DW$292, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3382                            .dwattr $C$DW$292, DW_AT_decl_line(0x43)
    3383                            .dwattr $C$DW$292, DW_AT_decl_column(0x22)
    3384                            .dwendtag $C$DW$T$50
    3385                    
    3386                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3387                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x43)
    3388                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
    3389                    $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    3390                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$50)
    3391                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    3392                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3393                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x43)
    3394                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x29)
    3395                    
    3396                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    3397                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x24)
    3398                    $C$DW$293       .dwtag  DW_TAG_member
    3399                            .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$30)
    3400                            .dwattr $C$DW$293, DW_AT_name("area")
    3401                            .dwattr $C$DW$293, DW_AT_TI_symbol_name("area")
    3402                            .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3403                            .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3404                            .dwattr $C$DW$293, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\..\
    3405                            .dwattr $C$DW$293, DW_AT_decl_line(0x69)
    3406                            .dwattr $C$DW$293, DW_AT_decl_column(0x0d)
    3407                    $C$DW$294       .dwtag  DW_TAG_member
    3408                            .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$30)
    3409                            .dwattr $C$DW$294, DW_AT_name("xsum")
    3410                            .dwattr $C$DW$294, DW_AT_TI_symbol_name("xsum")
    3411                            .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3412                            .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3413                            .dwattr $C$DW$294, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\..\
    3414                            .dwattr $C$DW$294, DW_AT_decl_line(0x6a)
    3415                            .dwattr $C$DW$294, DW_AT_decl_column(0x0d)
    3416                    $C$DW$295       .dwtag  DW_TAG_member
    3417                            .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$30)
    3418                            .dwattr $C$DW$295, DW_AT_name("ysum")
    3419                            .dwattr $C$DW$295, DW_AT_TI_symbol_name("ysum")
    3420                            .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3421                            .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3422                            .dwattr $C$DW$295, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\..\
    3423                            .dwattr $C$DW$295, DW_AT_decl_line(0x6b)
    3424                            .dwattr $C$DW$295, DW_AT_decl_column(0x0d)
    3425                    $C$DW$296       .dwtag  DW_TAG_member
    3426                            .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$30)
    3427                            .dwattr $C$DW$296, DW_AT_name("xmin")
    3428                            .dwattr $C$DW$296, DW_AT_TI_symbol_name("xmin")
    3429                            .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3430                            .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3431                            .dwattr $C$DW$296, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\..\
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:21 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsSparse/VLIB_haarDetectObjectsSparse_d.se66 PAGE   73

    3432                            .dwattr $C$DW$296, DW_AT_decl_line(0x6d)
    3433                            .dwattr $C$DW$296, DW_AT_decl_column(0x0d)
    3434                    $C$DW$297       .dwtag  DW_TAG_member
    3435                            .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$30)
    3436                            .dwattr $C$DW$297, DW_AT_name("ymin")
    3437                            .dwattr $C$DW$297, DW_AT_TI_symbol_name("ymin")
    3438                            .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3439                            .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3440                            .dwattr $C$DW$297, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\..\
    3441                            .dwattr $C$DW$297, DW_AT_decl_line(0x6e)
    3442                            .dwattr $C$DW$297, DW_AT_decl_column(0x0d)
    3443                    $C$DW$298       .dwtag  DW_TAG_member
    3444                            .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$30)
    3445                            .dwattr $C$DW$298, DW_AT_name("xmax")
    3446                            .dwattr $C$DW$298, DW_AT_TI_symbol_name("xmax")
    3447                            .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3448                            .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3449                            .dwattr $C$DW$298, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\..\
    3450                            .dwattr $C$DW$298, DW_AT_decl_line(0x6f)
    3451                            .dwattr $C$DW$298, DW_AT_decl_column(0x0d)
    3452                    $C$DW$299       .dwtag  DW_TAG_member
    3453                            .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$30)
    3454                            .dwattr $C$DW$299, DW_AT_name("ymax")
    3455                            .dwattr $C$DW$299, DW_AT_TI_symbol_name("ymax")
    3456                            .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3457                            .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3458                            .dwattr $C$DW$299, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\..\
    3459                            .dwattr $C$DW$299, DW_AT_decl_line(0x70)
    3460                            .dwattr $C$DW$299, DW_AT_decl_column(0x0d)
    3461                    $C$DW$300       .dwtag  DW_TAG_member
    3462                            .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$30)
    3463                            .dwattr $C$DW$300, DW_AT_name("seedx")
    3464                            .dwattr $C$DW$300, DW_AT_TI_symbol_name("seedx")
    3465                            .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3466                            .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3467                            .dwattr $C$DW$300, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\..\
    3468                            .dwattr $C$DW$300, DW_AT_decl_line(0x72)
    3469                            .dwattr $C$DW$300, DW_AT_decl_column(0x0d)
    3470                    $C$DW$301       .dwtag  DW_TAG_member
    3471                            .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$30)
    3472                            .dwattr $C$DW$301, DW_AT_name("seedy")
    3473                            .dwattr $C$DW$301, DW_AT_TI_symbol_name("seedy")
    3474                            .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3475                            .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3476                            .dwattr $C$DW$301, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\..\
    3477                            .dwattr $C$DW$301, DW_AT_decl_line(0x73)
    3478                            .dwattr $C$DW$301, DW_AT_decl_column(0x0d)
    3479                            .dwendtag $C$DW$T$51
    3480                    
    3481                            .dwattr $C$DW$T$51, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\..
    3482                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x68)
    3483                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x10)
    3484                    $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CC")
    3485                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$51)
    3486                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:21 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsSparse/VLIB_haarDetectObjectsSparse_d.se66 PAGE   74

    3487                            .dwattr $C$DW$T$78, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\..
    3488                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x75)
    3489                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
    3490                    
    3491                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    3492                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x10)
    3493                    $C$DW$302       .dwtag  DW_TAG_member
    3494                            .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$8)
    3495                            .dwattr $C$DW$302, DW_AT_name("daylight")
    3496                            .dwattr $C$DW$302, DW_AT_TI_symbol_name("daylight")
    3497                            .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3498                            .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3499                            .dwattr $C$DW$302, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3500                            .dwattr $C$DW$302, DW_AT_decl_line(0x52)
    3501                            .dwattr $C$DW$302, DW_AT_decl_column(0x0b)
    3502                    $C$DW$303       .dwtag  DW_TAG_member
    3503                            .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$10)
    3504                            .dwattr $C$DW$303, DW_AT_name("timezone")
    3505                            .dwattr $C$DW$303, DW_AT_TI_symbol_name("timezone")
    3506                            .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3507                            .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3508                            .dwattr $C$DW$303, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3509                            .dwattr $C$DW$303, DW_AT_decl_line(0x53)
    3510                            .dwattr $C$DW$303, DW_AT_decl_column(0x0b)
    3511                    $C$DW$304       .dwtag  DW_TAG_member
    3512                            .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$52)
    3513                            .dwattr $C$DW$304, DW_AT_name("tzname")
    3514                            .dwattr $C$DW$304, DW_AT_TI_symbol_name("tzname")
    3515                            .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3516                            .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3517                            .dwattr $C$DW$304, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3518                            .dwattr $C$DW$304, DW_AT_decl_line(0x54)
    3519                            .dwattr $C$DW$304, DW_AT_decl_column(0x0b)
    3520                    $C$DW$305       .dwtag  DW_TAG_member
    3521                            .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$52)
    3522                            .dwattr $C$DW$305, DW_AT_name("dstname")
    3523                            .dwattr $C$DW$305, DW_AT_TI_symbol_name("dstname")
    3524                            .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3525                            .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3526                            .dwattr $C$DW$305, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3527                            .dwattr $C$DW$305, DW_AT_decl_line(0x55)
    3528                            .dwattr $C$DW$305, DW_AT_decl_column(0x0b)
    3529                            .dwendtag $C$DW$T$53
    3530                    
    3531                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3532                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x51)
    3533                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
    3534                    $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("TZ")
    3535                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$53)
    3536                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    3537                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3538                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x56)
    3539                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x03)
    3540                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3541                            .dwattr $C$DW$T$2, DW_AT_name("void")
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:21 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsSparse/VLIB_haarDetectObjectsSparse_d.se66 PAGE   75

    3542                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3543                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3544                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3545                    $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_PTR")
    3546                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$3)
    3547                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    3548                            .dwattr $C$DW$T$80, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\..
    3549                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x5c)
    3550                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x19)
    3551                    $C$DW$T$81      .dwtag  DW_TAG_const_type
    3552                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$2)
    3553                    $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    3554                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    3555                            .dwattr $C$DW$T$82, DW_AT_address_class(0x20)
    3556                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    3557                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3558                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    3559                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3560                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    3561                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3562                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3563                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3564                    $C$DW$T$111     .dwtag  DW_TAG_pointer_type
    3565                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$5)
    3566                            .dwattr $C$DW$T$111, DW_AT_address_class(0x20)
    3567                    $C$DW$T$127     .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    3568                            .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$5)
    3569                            .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    3570                            .dwattr $C$DW$T$127, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3571                            .dwattr $C$DW$T$127, DW_AT_decl_line(0x2a)
    3572                            .dwattr $C$DW$T$127, DW_AT_decl_column(0x1d)
    3573                    $C$DW$T$128     .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    3574                            .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
    3575                            .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    3576                            .dwattr $C$DW$T$128, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3577                            .dwattr $C$DW$T$128, DW_AT_decl_line(0x39)
    3578                            .dwattr $C$DW$T$128, DW_AT_decl_column(0x17)
    3579                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    3580                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3581                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3582                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3583                    $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3584                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$6)
    3585                            .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    3586                    $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    3587                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$6)
    3588                            .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    3589                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3590                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x2b)
    3591                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x1c)
    3592                    
    3593                    $C$DW$T$25      .dwtag  DW_TAG_array_type
    3594                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    3595                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    3596                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:21 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsSparse/VLIB_haarDetectObjectsSparse_d.se66 PAGE   76

    3597                    $C$DW$306       .dwtag  DW_TAG_subrange_type
    3598                            .dwattr $C$DW$306, DW_AT_upper_bound(0x03)
    3599                            .dwendtag $C$DW$T$25
    3600                    
    3601                    
    3602                    $C$DW$T$26      .dwtag  DW_TAG_array_type
    3603                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$24)
    3604                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    3605                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x0c)
    3606                    $C$DW$307       .dwtag  DW_TAG_subrange_type
    3607                            .dwattr $C$DW$307, DW_AT_upper_bound(0x02)
    3608                    $C$DW$308       .dwtag  DW_TAG_subrange_type
    3609                            .dwattr $C$DW$308, DW_AT_upper_bound(0x03)
    3610                            .dwendtag $C$DW$T$26
    3611                    
    3612                    
    3613                    $C$DW$T$33      .dwtag  DW_TAG_array_type
    3614                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$24)
    3615                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3616                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x03)
    3617                    $C$DW$309       .dwtag  DW_TAG_subrange_type
    3618                            .dwattr $C$DW$309, DW_AT_upper_bound(0x02)
    3619                            .dwendtag $C$DW$T$33
    3620                    
    3621                    
    3622                    $C$DW$T$36      .dwtag  DW_TAG_array_type
    3623                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$24)
    3624                            .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    3625                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x20)
    3626                    $C$DW$310       .dwtag  DW_TAG_subrange_type
    3627                            .dwattr $C$DW$310, DW_AT_upper_bound(0x1f)
    3628                            .dwendtag $C$DW$T$36
    3629                    
    3630                    $C$DW$T$130     .dwtag  DW_TAG_pointer_type
    3631                            .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$24)
    3632                            .dwattr $C$DW$T$130, DW_AT_address_class(0x20)
    3633                    $C$DW$T$131     .dwtag  DW_TAG_restrict_type
    3634                            .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$130)
    3635                    $C$DW$T$132     .dwtag  DW_TAG_const_type
    3636                            .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$24)
    3637                    $C$DW$T$133     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    3638                            .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$24)
    3639                            .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    3640                            .dwattr $C$DW$T$133, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3641                            .dwattr $C$DW$T$133, DW_AT_decl_line(0x3a)
    3642                            .dwattr $C$DW$T$133, DW_AT_decl_column(0x16)
    3643                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    3644                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3645                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3646                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    3647                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    3648                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3649                            .dwattr $C$DW$T$8, DW_AT_name("short")
    3650                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    3651                    $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:21 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsSparse/VLIB_haarDetectObjectsSparse_d.se66 PAGE   77

    3652                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$8)
    3653                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    3654                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3655                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
    3656                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x1d)
    3657                    
    3658                    $C$DW$T$32      .dwtag  DW_TAG_array_type
    3659                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
    3660                            .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    3661                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x10)
    3662                    $C$DW$311       .dwtag  DW_TAG_subrange_type
    3663                            .dwattr $C$DW$311, DW_AT_upper_bound(0x07)
    3664                            .dwendtag $C$DW$T$32
    3665                    
    3666                    $C$DW$T$134     .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    3667                            .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$19)
    3668                            .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    3669                            .dwattr $C$DW$T$134, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3670                            .dwattr $C$DW$T$134, DW_AT_decl_line(0x3c)
    3671                            .dwattr $C$DW$T$134, DW_AT_decl_column(0x17)
    3672                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    3673                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3674                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3675                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    3676                    $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    3677                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$9)
    3678                            .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    3679                            .dwattr $C$DW$T$104, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3680                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x2d)
    3681                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x1c)
    3682                    $C$DW$T$136     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    3683                            .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$104)
    3684                            .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
    3685                            .dwattr $C$DW$T$136, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3686                            .dwattr $C$DW$T$136, DW_AT_decl_line(0x3d)
    3687                            .dwattr $C$DW$T$136, DW_AT_decl_column(0x16)
    3688                    $C$DW$T$135     .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    3689                            .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$9)
    3690                            .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
    3691                            .dwattr $C$DW$T$135, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3692                            .dwattr $C$DW$T$135, DW_AT_decl_line(0x53)
    3693                            .dwattr $C$DW$T$135, DW_AT_decl_column(0x1a)
    3694                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    3695                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3696                            .dwattr $C$DW$T$10, DW_AT_name("int")
    3697                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    3698                    $C$DW$T$159     .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
    3699                            .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$10)
    3700                            .dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
    3701                            .dwattr $C$DW$T$159, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3702                            .dwattr $C$DW$T$159, DW_AT_decl_line(0x53)
    3703                            .dwattr $C$DW$T$159, DW_AT_decl_column(0x0d)
    3704                    $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    3705                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$10)
    3706                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:21 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsSparse/VLIB_haarDetectObjectsSparse_d.se66 PAGE   78

    3707                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3708                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x2e)
    3709                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x1d)
    3710                    $C$DW$T$151     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CCHandle")
    3711                            .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$30)
    3712                            .dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
    3713                            .dwattr $C$DW$T$151, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\.
    3714                            .dwattr $C$DW$T$151, DW_AT_decl_line(0x77)
    3715                            .dwattr $C$DW$T$151, DW_AT_decl_column(0x11)
    3716                    
    3717                    $C$DW$T$31      .dwtag  DW_TAG_array_type
    3718                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    3719                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3720                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x0c)
    3721                    $C$DW$312       .dwtag  DW_TAG_subrange_type
    3722                            .dwattr $C$DW$312, DW_AT_upper_bound(0x02)
    3723                            .dwendtag $C$DW$T$31
    3724                    
    3725                    
    3726                    $C$DW$T$35      .dwtag  DW_TAG_array_type
    3727                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$30)
    3728                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3729                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x08)
    3730                    $C$DW$313       .dwtag  DW_TAG_subrange_type
    3731                            .dwattr $C$DW$313, DW_AT_upper_bound(0x01)
    3732                            .dwendtag $C$DW$T$35
    3733                    
    3734                    
    3735                    $C$DW$T$37      .dwtag  DW_TAG_array_type
    3736                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$30)
    3737                            .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    3738                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x80)
    3739                    $C$DW$314       .dwtag  DW_TAG_subrange_type
    3740                            .dwattr $C$DW$314, DW_AT_upper_bound(0x1f)
    3741                            .dwendtag $C$DW$T$37
    3742                    
    3743                    
    3744                    $C$DW$T$54      .dwtag  DW_TAG_array_type
    3745                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$30)
    3746                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    3747                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x10)
    3748                    $C$DW$315       .dwtag  DW_TAG_subrange_type
    3749                            .dwattr $C$DW$315, DW_AT_upper_bound(0x03)
    3750                            .dwendtag $C$DW$T$54
    3751                    
    3752                    $C$DW$T$107     .dwtag  DW_TAG_pointer_type
    3753                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$30)
    3754                            .dwattr $C$DW$T$107, DW_AT_address_class(0x20)
    3755                    $C$DW$T$154     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    3756                            .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$30)
    3757                            .dwattr $C$DW$T$154, DW_AT_language(DW_LANG_C)
    3758                            .dwattr $C$DW$T$154, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3759                            .dwattr $C$DW$T$154, DW_AT_decl_line(0x4b)
    3760                            .dwattr $C$DW$T$154, DW_AT_decl_column(0x17)
    3761                    $C$DW$T$155     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:21 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsSparse/VLIB_haarDetectObjectsSparse_d.se66 PAGE   79

    3762                            .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$30)
    3763                            .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    3764                            .dwattr $C$DW$T$155, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3765                            .dwattr $C$DW$T$155, DW_AT_decl_line(0x4e)
    3766                            .dwattr $C$DW$T$155, DW_AT_decl_column(0x17)
    3767                    $C$DW$T$156     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    3768                            .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$30)
    3769                            .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    3770                            .dwattr $C$DW$T$156, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3771                            .dwattr $C$DW$T$156, DW_AT_decl_line(0x49)
    3772                            .dwattr $C$DW$T$156, DW_AT_decl_column(0x17)
    3773                    $C$DW$T$157     .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    3774                            .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$30)
    3775                            .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
    3776                            .dwattr $C$DW$T$157, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3777                            .dwattr $C$DW$T$157, DW_AT_decl_line(0x3e)
    3778                            .dwattr $C$DW$T$157, DW_AT_decl_column(0x17)
    3779                    $C$DW$T$158     .dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
    3780                            .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$10)
    3781                            .dwattr $C$DW$T$158, DW_AT_language(DW_LANG_C)
    3782                            .dwattr $C$DW$T$158, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3783                            .dwattr $C$DW$T$158, DW_AT_decl_line(0x58)
    3784                            .dwattr $C$DW$T$158, DW_AT_decl_column(0x1a)
    3785                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    3786                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3787                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    3788                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    3789                    $C$DW$T$160     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_VAL")
    3790                            .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$11)
    3791                            .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
    3792                            .dwattr $C$DW$T$160, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_haarDetectObjectsSparse\.
    3793                            .dwattr $C$DW$T$160, DW_AT_decl_line(0x5d)
    3794                            .dwattr $C$DW$T$160, DW_AT_decl_column(0x17)
    3795                    $C$DW$T$161     .dwtag  DW_TAG_pointer_type
    3796                            .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$11)
    3797                            .dwattr $C$DW$T$161, DW_AT_address_class(0x20)
    3798                    $C$DW$T$172     .dwtag  DW_TAG_typedef, DW_AT_name("clock_t")
    3799                            .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$11)
    3800                            .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
    3801                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3802                            .dwattr $C$DW$T$172, DW_AT_decl_line(0x37)
    3803                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x16)
    3804                    $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    3805                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$11)
    3806                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3807                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3808                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x45)
    3809                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x19)
    3810                    $C$DW$T$165     .dwtag  DW_TAG_typedef, DW_AT_name("time_t")
    3811                            .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$11)
    3812                            .dwattr $C$DW$T$165, DW_AT_language(DW_LANG_C)
    3813                            .dwattr $C$DW$T$165, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3814                            .dwattr $C$DW$T$165, DW_AT_decl_line(0x38)
    3815                            .dwattr $C$DW$T$165, DW_AT_decl_column(0x16)
    3816                    $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:21 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsSparse/VLIB_haarDetectObjectsSparse_d.se66 PAGE   80

    3817                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$11)
    3818                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    3819                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3820                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x2f)
    3821                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x1c)
    3822                    $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    3823                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    3824                            .dwattr $C$DW$T$21, DW_AT_address_class(0x20)
    3825                    $C$DW$T$145     .dwtag  DW_TAG_restrict_type
    3826                            .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$21)
    3827                    $C$DW$T$167     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast16_t")
    3828                            .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$20)
    3829                            .dwattr $C$DW$T$167, DW_AT_language(DW_LANG_C)
    3830                            .dwattr $C$DW$T$167, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3831                            .dwattr $C$DW$T$167, DW_AT_decl_line(0x4c)
    3832                            .dwattr $C$DW$T$167, DW_AT_decl_column(0x16)
    3833                    $C$DW$T$168     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast32_t")
    3834                            .dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$20)
    3835                            .dwattr $C$DW$T$168, DW_AT_language(DW_LANG_C)
    3836                            .dwattr $C$DW$T$168, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3837                            .dwattr $C$DW$T$168, DW_AT_decl_line(0x4f)
    3838                            .dwattr $C$DW$T$168, DW_AT_decl_column(0x16)
    3839                    $C$DW$T$169     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast8_t")
    3840                            .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$20)
    3841                            .dwattr $C$DW$T$169, DW_AT_language(DW_LANG_C)
    3842                            .dwattr $C$DW$T$169, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3843                            .dwattr $C$DW$T$169, DW_AT_decl_line(0x4a)
    3844                            .dwattr $C$DW$T$169, DW_AT_decl_column(0x16)
    3845                    $C$DW$T$170     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least32_t")
    3846                            .dwattr $C$DW$T$170, DW_AT_type(*$C$DW$T$20)
    3847                            .dwattr $C$DW$T$170, DW_AT_language(DW_LANG_C)
    3848                            .dwattr $C$DW$T$170, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3849                            .dwattr $C$DW$T$170, DW_AT_decl_line(0x3f)
    3850                            .dwattr $C$DW$T$170, DW_AT_decl_column(0x16)
    3851                    $C$DW$T$171     .dwtag  DW_TAG_typedef, DW_AT_name("uintptr_t")
    3852                            .dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$11)
    3853                            .dwattr $C$DW$T$171, DW_AT_language(DW_LANG_C)
    3854                            .dwattr $C$DW$T$171, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3855                            .dwattr $C$DW$T$171, DW_AT_decl_line(0x59)
    3856                            .dwattr $C$DW$T$171, DW_AT_decl_column(0x1a)
    3857                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    3858                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    3859                            .dwattr $C$DW$T$12, DW_AT_name("__int40_t")
    3860                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x08)
    3861                            .dwattr $C$DW$T$12, DW_AT_bit_size(0x28)
    3862                            .dwattr $C$DW$T$12, DW_AT_bit_offset(0x18)
    3863                    $C$DW$T$173     .dwtag  DW_TAG_typedef, DW_AT_name("int40_t")
    3864                            .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$12)
    3865                            .dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
    3866                            .dwattr $C$DW$T$173, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3867                            .dwattr $C$DW$T$173, DW_AT_decl_line(0x31)
    3868                            .dwattr $C$DW$T$173, DW_AT_decl_column(0x21)
    3869                    $C$DW$T$174     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast40_t")
    3870                            .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$173)
    3871                            .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
TMS320C6x Assembler PC v7.4.2 Sat Sep 26 11:10:21 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_haarDetectObjectsSparse/VLIB_haarDetectObjectsSparse_d.se66 PAGE   81

    3872                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3873                            .dwattr $C$DW$T$174, DW_AT_decl_line(0x51)
    3874                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x17)
